{
  "id": "9",
  "title": "The Enchanted Chronicles",
  "author": "Elena Mysticwind",
  "cover": "/assets/book1-cover.jpg",
  "description": "A mystical journey through ancient realms where magic and reality intertwine.",
  "genre": "Mystery Thriller",
  "pages": [
    {
      "id": "page-9-1",
      "pageNumber": 1,
      "content": "When We Fell in Love Again\n\nBeginning\n\nChapter 1: The Train Journey\n\nThe train screeched to a halt at New Delhi Railway Station, jolting Aarav out of his thoughts. He adjusted his backpack, stepped onto the platform, and inhaled the warm air thick with dust, diesel, and chai vendors shouting in chorus. Delhi always overwhelmed him, but today it felt different.\n\nToday was the first day of his internship at a reputed media house—his first big step towards proving that he wasn’t just the quiet boy from Lucknow who hid behind books.\n\nAs he dragged his suitcase across the crowded platform, he noticed her.\n\nShe was standing near a tea stall, her hair tied messily in a bun, wearing a simple blue kurti and jeans, sipping chai like the world owed her nothing but this moment of calm. Something about her stood out—maybe the way she looked at the chaos without flinching, as if she belonged to it.\n\nAarav froze.\n\nNot because she was beautiful (though she was), but because he had seen her before. A face he thought he had forgotten, but one memory pulled back like a flood.\n\nRiya."
    },
    {
      "id": "page-9-2",
      "pageNumber": 2,
      "content": "The same girl who once sat two benches away in their school classroom. The girl he had never dared to talk to, except in borrowed glances and awkward stolen moments.\n\nFive years. And here she was.\n\nHe wanted to walk up, say hello, maybe make a joke about fate pulling pranks. But he hesitated. What if she didn’t remember him? What if she had moved on, the way people do?\n\nHis phone buzzed. His new boss. “Be in office at 10 sharp. Don’t be late.”\n\nAarav sighed, forced his eyes away, and turned to leave. But just as he stepped forward, he heard a familiar voice.\n\n“Aarav? Is that you?”\n\nHe froze mid-step. His heart skipped a beat.\n\nChapter 2: Old Names, New Faces\n\n“Aarav Pradhan from St. Mary’s School, Lucknow?”\n\nRiya’s smile was playful, her tone laced with curiosity. Aarav turned slowly, and for a second, it felt like the platform blurred out. She still had the same spark in her eyes.\n\n“Yeah,” he managed, awkwardly. “And you’re… Riya Sharma.”\n\nShe laughed softly. “Wow. Five years and you still remember.”"
    },
    {
      "id": "page-9-3",
      "pageNumber": 3,
      "content": "Of course, he remembered. He had memorized every detail about her back then—how she twirled her pen when she was bored, how she laughed even when teachers scolded her, how she always had her diary open during recess.\n\nThey stood facing each other, the air heavy with nostalgia. The awkward silence stretched until Riya broke it.\n\n“So, Delhi? Internship? Or…”\n\n“Internship,” Aarav said quickly. “Media house. You?”\n\n“Final year Journalism. DU. I’m staying here in the hostel. Delhi kind of grows on you.”\n\nThey started walking together towards the exit. Aarav couldn’t help but notice how easily she carried herself, how naturally conversations flowed from her lips. Meanwhile, he found himself calculating each word before speaking, afraid he might sound foolish.\n\n“Still the quiet one?” she teased.\n\nHe chuckled nervously. “Some things don’t change.”\n\n“Good. The world needs more listeners.”\n\nChapter 3: Threads of Fate\n\nOutside, the city buzzed with its usual madness. Horns blared, rickshaw pullers argued, vendors sold everything from sunglasses to phone covers. Aarav tried booking a cab on his phone, but the app kept showing surge prices."
    },
    {
      "id": "page-9-4",
      "pageNumber": 4,
      "content": "“Where are you headed?” Riya asked.\n\n“Karol Bagh. My PG’s there.”\n\nHer eyes lit up. “No way! My hostel’s nearby. Come, we’ll share an auto.”\n\nAnd just like that, Aarav found himself sitting next to her in a rattling auto-rickshaw, watching the city blur past.\n\nIt felt surreal. A girl he once admired silently was now inches away, her hair occasionally brushing against his shoulder with every bump in the road. He wanted to say so much—about the past, about how fate had a funny way of reconnecting people. But instead, he stayed quiet, content in the moment.\n\nRiya, on the other hand, seemed in no mood for silence.\n\n“You know, Aarav, I used to think you hated me,” she said suddenly.\n\n“What? Why?”\n\n“Because you never talked. You’d just… look sometimes. Then look away.”\n\nHeat crept up his neck. “I didn’t hate you. I just…” He paused. “…didn’t know how to talk to you.”\n\nHer laugh rang out, carefree. “Well, here’s your second chance. Don’t waste it.”\n\nAarav smiled, and for the first time in years, he felt like maybe—just maybe—life was giving him a story worth living.\n\nRediscovering Each Other"
    },
    {
      "id": "page-9-5",
      "pageNumber": 5,
      "content": "Chapter 4: Settling In\n\nThe auto-rickshaw stopped outside a narrow lane in Karol Bagh, lined with old houses converted into PGs. Aarav got down, pulling his suitcase along. Riya looked around, her face scrunching up.\n\n“You’re staying here?” she asked.\n\n“Yeah. What’s wrong with it?” Aarav looked defensive.\n\n“Nothing,” she said quickly, hiding a smile. “It’s just… typical you. Always choosing the simplest option.”\n\nHe raised an eyebrow. “And what does that mean?”\n\nShe shrugged. “Back in school, when everyone else showed off with fancy pens, you wrote with the same old Reynolds. When everyone carried expensive lunchboxes, you still brought home-packed parathas wrapped in foil.”\n\nAarav chuckled. “And you still notice everything.”\n\nRiya grinned. “Guilty.”\n\nThey stood there, neither willing to break the moment. Then Riya checked her phone. “I should go. Hostel warden’s strict. But… hey, let’s meet tomorrow evening? Coffee?”\n\nAarav’s heart skipped. “Yeah. Sure.”\n\n“Good. Don’t be late.” She flashed him one last smile before walking away.\n\nAs Aarav climbed the stairs to his PG, dragging his suitcase, he realized something—Delhi didn’t feel so big anymore."
    },
    {
      "id": "page-9-6",
      "pageNumber": 6,
      "content": "Chapter 5: First Day, First Jitters\n\nThe office building of Daily Chronicle towered above him like a fortress. Aarav felt a mix of excitement and nervousness as he entered. Inside, the buzz of ringing phones, clicking keyboards, and reporters rushing with files overwhelmed him.\n\n“Interns over there,” the receptionist pointed him to a group of nervous faces sitting with notepads.\n\nAarav took his seat, adjusting his glasses. Soon, a senior editor walked in—a tall man with salt-and-pepper hair and a voice that commanded respect.\n\n“Welcome to Chronicle. You’re here to learn, but also to prove if you belong in this industry. Journalism isn’t just writing. It’s chasing truths, even when they hurt. If you’re here for glamour, walk out now.”\n\nThe interns shifted uncomfortably. Aarav swallowed hard, his mind already racing with doubts.\n\nDuring introductions, he barely spoke more than his name. Some interns boasted about their achievements, while Aarav stayed quiet, his pen tapping nervously."
    },
    {
      "id": "page-9-7",
      "pageNumber": 7,
      "content": "But later that day, when the editor asked them to write a quick piece on “Delhi Through My Eyes,” Aarav poured his thoughts onto paper—about the chaos, the contradictions, the warmth hidden in its rough edges. When he handed it in, the editor raised an eyebrow.\n\n“Not bad, Pradhan. You write with honesty. Don’t lose that.”\n\nFor the first time, Aarav felt he might just belong here.\n\nChapter 6: Coffee and Confessions\n\nThat evening, Aarav waited outside a café near Connaught Place, his hands fidgeting with his phone. He kept checking the time, afraid of being too early, too eager.\n\nAnd then she arrived.\n\nRiya walked in wearing a simple white kurti and jeans, hair open this time. She looked fresh, confident, and utterly comfortable in her own skin. Aarav, on the other hand, felt like he had rehearsed a thousand conversations in his head and forgotten all of them at once.\n\n“You’re early,” she teased, sliding into the seat opposite him.\n\n“You said not to be late,” he replied, trying to sound casual."
    },
    {
      "id": "page-9-8",
      "pageNumber": 8,
      "content": "They ordered coffee, and soon, conversation flowed. They talked about old school teachers, about how time had changed them, about Delhi’s madness. Riya narrated hostel stories with dramatic hand gestures that made people at the next table chuckle. Aarav mostly listened, smiling at how easily she spoke.\n\nBut then, her tone shifted.\n\n“You know, Aarav… people think I’m this confident girl who knows what she wants. Truth is, I’m terrified half the time.”\n\nHe blinked. “You? Terrified?”\n\nShe nodded, stirring her coffee absentmindedly. “Journalism’s tough. Deadlines, competition, family expectations… Sometimes I wonder if I’ll ever make it.”\n\nAarav leaned forward. “You will. If there’s one thing I remember about you, it’s that you never give up.”\n\nHer eyes softened. “And if there’s one thing I remember about you, it’s that you always meant what you said.”\n\nThe café’s dim lights reflected in her eyes, and for a fleeting moment, the world outside didn’t exist.\n\nChapter 7: A Promise Rekindled\n\nAs they stepped out of the café, Delhi’s night air wrapped around them—cool, restless, alive. Streetlights glowed, vendors still called out, and the city showed no signs of sleeping."
    },
    {
      "id": "page-9-9",
      "pageNumber": 9,
      "content": "“Feels good to talk after so long,” Riya said.\n\n“Yeah. Feels… easy,” Aarav admitted.\n\nThey walked side by side, silence settling comfortably between them. Then Riya spoke again, her voice thoughtful.\n\n“Back in school, I always wished we had talked more. Maybe even been friends. You were the mystery boy in the corner, always scribbling something in your notebook.”\n\nAarav smiled faintly. “Poems. Bad ones.”\n\n“I’d like to read them someday,” she said softly.\n\nHe glanced at her, heart pounding. “Maybe someday.”\n\nAs they reached the crossroads where their ways parted, Riya stopped.\n\n“Let’s not lose touch this time, Aarav.”\n\nHe looked at her, remembering how five years ago he had let distance win. Not again.\n\n“Promise,” he said.\n\nAnd with that, fate stitched their paths together once more.\n\nCloseness & Confessions\n\nChapter 8: Midnight Messages\n\nIt started with a “Did you reach safely?” text from Riya after their coffee meeting.\n Aarav stared at his phone longer than necessary before replying: “Yeah. You?”"
    },
    {
      "id": "page-9-10",
      "pageNumber": 10,
      "content": "That one simple check-in became a thread. By the end of the week, they were messaging daily—small things at first. Riya sending him photos of hostel food with captions like, “See what torture tastes like.” Aarav replying with memes about his PG roommate snoring like a truck.\n\nSoon, it wasn’t just banter. It was late-night talks. About books, about dreams, about fears they couldn’t tell anyone else. Aarav realized he was writing more on WhatsApp than he had ever spoken in person.\n\nOne night, Riya asked, “Do you still write?”\n\nAarav hesitated, fingers hovering. Then he sent her a photo of a page from his notebook—an unfinished poem about Delhi’s chaos mirroring the human heart.\n\nMinutes later, Riya replied:\n “You have no idea how good you are, Aarav. You should publish.”\n\nHe smiled in the dark, heart racing. No one had ever believed in him like that before.\n\nChapter 9: Little Things\n\nThey began meeting more often. Sometimes after Aarav’s office hours, sometimes during Riya’s free lectures. They would sit on the steps of India Gate, sharing roasted peanuts from a paper cone. Or sneak into old Delhi lanes for street food, laughing when they argued about whether chole bhature was better than momos."
    },
    {
      "id": "page-9-11",
      "pageNumber": 11,
      "content": "One rainy evening, they got stuck near Connaught Place. Shops were shutting, traffic was a mess. Aarav instinctively held his bag over Riya’s head to shield her from the rain. She burst out laughing.\n\n“What are you doing?”\n\n“Saving your hair,” he said sheepishly.\n\n“Idiot. You’ll get drenched.”\n\n“It’s fine. I don’t look half as good as you anyway.”\n\nHe regretted the words the moment they slipped out. But instead of mocking him, Riya looked away, her cheeks turning pink.\n\nThat was the moment Aarav realized: this wasn’t just nostalgia. He was falling—deeply, irreversibly—again.\n\nChapter 10: Cracks Appear\n\nBut reality never stayed dreamy for long.\n\nOne Saturday, Riya showed up at their usual café looking distracted. Her coffee remained untouched.\n\n“What’s wrong?” Aarav asked.\n\nShe sighed. “Parents. They called today. Another lecture on how journalism isn’t a ‘real’ career. They’ve already started dropping hints about marriage.”\n\nAarav froze. “Marriage? But… you’re still studying.”\n\n“Exactly. But you know how families are. Stability, society, shaadi… it’s like they have a checklist.”"
    },
    {
      "id": "page-9-12",
      "pageNumber": 12,
      "content": "Her voice wavered, and for the first time, Aarav saw her eyes glisten. He wanted to reach across the table, hold her hand, tell her she wasn’t alone. But his courage failed.\n\nInstead, he muttered, “You’ll figure it out. You always do.”\n\nRiya nodded, but her smile didn’t reach her eyes.\n\nThat night, Aarav couldn’t sleep. He kept replaying her words. Somewhere deep down, a fear clawed at him—what if history repeated itself? What if, just like in school, Riya drifted away again… this time for good?\n\nAlmost Confessions & Cracks Deepening\n\nChapter 11: The Metro Ride\n\nIt was almost midnight when Aarav and Riya boarded the last metro from Rajiv Chowk. They had spent the evening wandering Janpath, bargaining over junk jewelry neither of them planned to buy, and sharing a plate of golgappas from a roadside stall.\n\nThe metro was nearly empty, its fluorescent lights flickering against the silence. Riya sat by the window, resting her head on the glass, humming a tune softly. Aarav sat beside her, stealing glances.\n\n“Why are you smiling like that?” she asked suddenly, catching him.\n\nHe panicked. “Nothing. Just… the song. It’s nice.”"
    },
    {
      "id": "page-9-13",
      "pageNumber": 13,
      "content": "She narrowed her eyes playfully. “Liar. You’ve always been terrible at lying.”\n\nHe looked away, heart hammering. He wanted to tell her. That he had thought about her every single day since school. That seeing her again felt like life was giving him a second chance. That her laughter made Delhi’s chaos feel like home.\n\nBut the words stuck.\n\nInstead, he whispered, “I’m just glad we met again.”\n\nRiya’s expression softened. “Me too, Aarav. Me too.”\n\nThe train slowed, announcing her stop. She stood, adjusting her bag. “Goodnight, mystery boy.”\n\nAnd just like that, the moment slipped.\n\nChapter 12: Uninvited Choices\n\nThe next afternoon, Riya called him, her voice strained.\n\n“Aarav, can we meet? Urgent.”\n\nThey sat at their café, but unlike usual, she didn’t order her cappuccino. She was restless, tapping her fingers on the table.\n\n“My mom’s cousin came today,” she began. “They… they’ve started looking for matches. Apparently some family in Jaipur is interested.”\n\nAarav’s chest tightened. “And what did you say?”\n\n“That I’m not ready. That my career comes first. But you know how it goes… they think journalism is a hobby, not a job.”"
    },
    {
      "id": "page-9-14",
      "pageNumber": 14,
      "content": "She laughed bitterly. “They told me, ‘Who’ll marry a girl who runs behind breaking news?’”\n\nAarav clenched his fists under the table. He wanted to shout that any man who couldn’t see her worth didn’t deserve her. He wanted to say I’ll marry you.\n\nBut again, silence betrayed him.\n\nAll he managed was, “You’ll prove them wrong. You always do.”\n\nRiya smiled faintly, but her eyes were clouded.\n\nChapter 13: The Diary\n\nA week later, they met in Riya’s hostel room when her roommate was away. Books were scattered, papers piled up—her world looked like organized chaos.\n\nShe handed him a small diary. “Read this.”\n\nInside were her own writings—raw articles, half-formed essays, even a short story about a girl who wanted to fly but was tied down by invisible ropes.\n\n“It’s brilliant,” Aarav said honestly.\n\nRiya shrugged. “My parents would never call it that.”\n\nHe looked at her, something inside him breaking. “Riya, you can’t let them decide who you are.”\n\nHer gaze held his. For a second, it felt like the air thickened. She was so close. He could see the faint dimple near her lip, the strands of hair brushing her cheek."
    },
    {
      "id": "page-9-15",
      "pageNumber": 15,
      "content": "He wanted to lean in, to bridge the gap between words and silence.\n\nBut her phone rang—her mother’s name flashing on the screen.\n\nThe moment shattered.\n\nShe turned away to answer, her voice soft, restrained. Aarav sat there, clutching the diary, realizing that love wasn’t just about stolen glances and laughter. It was also about timing. And his… never seemed right.\n\nSparks and Shadows\n\nChapter 14: The Festival of Lights\n\nIt was Diwali week, and Delhi was wrapped in fairy lights. Every street glowed, every corner smelled of sweets and fireworks. Aarav hadn’t expected to celebrate much—his PG felt too dull, too quiet. But Riya had other plans.\n\n“You’re coming with me to campus fest. No excuses.”\n\nAnd so he found himself at her college grounds, surrounded by stalls, music, and laughter. Riya looked radiant in a simple yellow kurti with silver jhumkas, her hair tied up casually yet perfectly. Aarav couldn’t stop staring.\n\n“You clean up well, intern saab,” she teased, nudging his arm.\n\nThey roamed the stalls together—trying bhel puri, laughing at badly sung karaoke, watching fireworks crackle above. For Aarav, it felt like a dream stitched with colors."
    },
    {
      "id": "page-9-16",
      "pageNumber": 16,
      "content": "At one stall, Riya picked up a clay diya, its flame flickering. She handed it to him.\n\n“Make a wish.”\n\nHe closed his eyes. Let her stay. Let this moment last.\n\nWhen he opened them, Riya was still watching him, her eyes softer than he had ever seen.\n\nFor a second, the world dimmed—the noise, the crowd, everything blurred. It was just her. And him. And the unspoken.\n\nChapter 15: The Dance\n\nAs night fell, music filled the courtyard. Students gathered for garba. Riya pulled him in.\n\n“No, no, I can’t dance,” Aarav protested, shaking his head.\n\n“You can write poems but not move your feet? Come on!” she laughed, dragging him.\n\nAwkward at first, he stumbled, stepped on her dupatta once, earning playful glares. But soon, he loosened up. Her laughter was infectious, her energy magnetic. For the first time in years, Aarav felt free—like the boy he used to be before life got heavy.\n\nWhen the song slowed, couples paired off. Riya placed her hand in his, her bangles clinking softly. They swayed under the fairy lights, too close, too vulnerable.\n\nAarav’s heart screamed: Say it. Tell her. Now.\n\nHis lips parted—“Riya, I…”"
    },
    {
      "id": "page-9-17",
      "pageNumber": 17,
      "content": "But just then, her phone buzzed again. The moment snapped. She frowned, silencing the call. Aarav’s chest ached with the weight of unsaid words.\n\nChapter 16: First Clash\n\nLater that night, walking her back, Aarav tried again. “Riya, about earlier… I wanted to tell you something.”\n\nBut she cut him off, frustration spilling. “Aarav, you don’t understand. My mom just called again. She said they’re coming to Delhi next week to meet me. They’ve already lined up a boy from Jaipur.”\n\nHis throat tightened. “And… what do you want?”\n\n“I want time. Freedom. But do I ever get that?” she snapped, her voice sharp.\n\nAarav stayed silent for a beat, then said, “Maybe you should just tell them clearly, Riya. That you won’t marry. That you have your dreams.”\n\nShe turned to him, anger flaring. “It’s not that easy. Not everyone can rebel and walk away. You don’t get it!”\n\nSomething inside him cracked. “Maybe I don’t. But do you even see me, Riya? I’m standing right here, trying to be there for you, and all you talk about is how helpless you are. You’re not helpless—you’re just… scared.”\n\nHer eyes widened, hurt flashing across her face.\n\nSilence. Heavy, unbearable."
    },
    {
      "id": "page-9-18",
      "pageNumber": 18,
      "content": "Finally, she whispered, “Maybe I was wrong. Maybe we shouldn’t meet so often.”\n\nThose words stung deeper than he could admit. Aarav wanted to take them back, to apologize, but his pride chained him.\n\nSo he let her walk away into the night, her shadow shrinking with every step, while his heart felt heavier than ever.\n\nDistance & Longing\n\nChapter 17: Silent Days\n\nThe week after their fight, Delhi felt emptier to Aarav. The streets buzzed, office alarms rang, but nothing mattered. Every sound reminded him of Riya’s laughter, every corner of Connaught Place reminded him of her.\n\nHe tried messaging her. “Are you okay?”\n No reply.\n\n“I’m here if you need me.”\n Nothing.\n\nDays stretched into silence. Aarav replayed the fight over and over. He remembered her words: “Maybe we shouldn’t meet so often.”\n\nIt hurt more than he wanted to admit. And yet, he couldn’t bring himself to stop thinking about her."
    },
    {
      "id": "page-9-19",
      "pageNumber": 19,
      "content": "Meanwhile, Riya was struggling too. Her mother’s calls increased. The boy from Jaipur’s family sent polite messages. She kept herself busy with journalism assignments, but every evening, her thoughts wandered to Aarav—the way he held the diya, his awkward dance steps, the quiet way he supported her.\n\nNeither spoke. Neither reached out. And the unspoken love between them grew heavier with every passing day.\n\nChapter 18: The Cafe That Waited\n\nOne evening, Aarav found himself at their usual café. The same corner table, the same old menu board. He sat, staring at the empty chair across from him, a cup of coffee growing cold.\n\nHe pulled out his notebook and started writing:\n\n“You’re everywhere I look. I see you in every corner of this city. I see you in every poem I write. I see you in every laugh I hear, every song I hum. And yet… you’re not here.”\n\nRiya’s favorite cappuccino arrived—he hadn’t ordered it. A note slipped underneath:\n\n“I miss you too. Don’t stop fighting for yourself. –R”\n\nHis chest tightened. She had come here, somehow, without meeting him. Somehow, her heart was still speaking to him, even in silence."
    },
    {
      "id": "page-9-20",
      "pageNumber": 20,
      "content": "Chapter 19: Reflection\n\nThat night, Aarav wandered through Delhi streets. The city seemed quiet, holding its breath. He thought about the Diwali night, about their laughter, about the dance. About how he had almost confessed, but the words died on his lips.\n\n“Why do I keep hesitating?” he muttered to himself.\n\nBecause love was easy to feel, but terrifying to voice. Because fear of losing her completely loomed larger than hope of gaining her. Because life had taught him that sometimes, the hardest battles are the ones inside your own heart.\n\nHe paused near India Gate, watching couples stroll, families laughing, strangers hugging. He imagined Riya there, smiling at someone else, living her life while he lingered on what-ifs.\n\nAnd he realized—if he didn’t act soon, he might lose her forever.\n\nChapter 20: A Glimmer of Hope\n\nMeanwhile, Riya sat in her hostel room, staring at the diary Aarav had held. She traced his handwriting, remembering how he had looked at her in that moment. A part of her wanted to call him, to fix everything. Another part feared it was too late.\n\nHer phone buzzed. A new message from Aarav:"
    },
    {
      "id": "page-9-21",
      "pageNumber": 21,
      "content": "“Meet me tomorrow, near India Gate. 6 PM. Come. Please.”\n\nHer heart leaped. Hope, fear, excitement—all tangled together. She typed back hesitantly: “Okay. I’ll come.”\n\nIt wasn’t a solution. It wasn’t a confession. But it was a start.\n\nAnd sometimes, a start is all love needs.\n\nReunion & Confession\n\nChapter 21: The Meeting\n\nAarav reached India Gate early, pacing nervously. The evening air was crisp, filled with the scent of street food and the distant laughter of families strolling. His palms were sweaty, heart hammering.\n\nRiya appeared from the pathway, her silhouette framed by the fading sun. She looked hesitant, cautious, but her eyes softened the moment they met his gaze.\n\n“Hi,” she whispered.\n\n“Hi,” he replied, his voice barely audible.\n\nFor a few seconds, they just stood there, the city humming around them, yet somehow paused for their reunion.\n\nChapter 22: Words at Last\n\n“I… I’ve missed you,” Aarav finally said, his voice trembling slightly.\n\nRiya’s eyes glistened. “I missed you too. But I was scared… scared of what would happen if we spoke. My parents… the expectations…”"
    },
    {
      "id": "page-9-22",
      "pageNumber": 22,
      "content": "He stepped closer. “Riya, I don’t care about anything else. I care about you. I’ve cared since school. I’ve cared all over again since that day at the platform. I… I love you.”\n\nHer breath caught. She wanted to laugh, cry, scream—all at once. She took a shaky step toward him. “Aarav… I… I love you too. But… my family, my career…”\n\nHe held her hands firmly. “Then we’ll face it together. We’ll figure it out. But I can’t keep pretending I don’t feel this way. I can’t let you go again.”\n\nTears slipped from her eyes. “I was so afraid I’d ruin this… ruin us.”\n\n“You couldn’t,” he said softly, brushing a strand of hair from her face. “Not now. Not ever.”\n\nFor the first time in weeks, they smiled without fear. The city lights reflected in their eyes, glittering like the beginning of a new chapter.\n\nChapter 23: The First Kiss\n\nA quiet pause settled between them. The air was thick, almost tangible, with unspoken words and years of longing. Aarav leaned in slowly. Riya tilted her face.\n\nTheir lips met softly at first—hesitant, trembling—but then with the weight of all their missed chances, all their silent nights, all the longing they couldn’t put into words."
    },
    {
      "id": "page-9-23",
      "pageNumber": 23,
      "content": "It wasn’t just a kiss. It was a promise. A confession. A declaration that neither time nor fear could erase what they felt.\n\nWhen they pulled away, they rested foreheads together, breathing in sync.\n\n“I never want to let you go again,” Aarav murmured.\n\n“You won’t,” Riya replied, voice steady despite the tears.\n\nAnd for that moment, the world outside—the city, the noise, the expectations—didn’t exist. There was only them.\n\nChapter 24: Subtle Shadows\n\nAs they walked home together under the streetlights, laughter occasionally breaking through, Riya’s phone buzzed again—a reminder of the looming family pressure. Aarav noticed her stiffen.\n\n“You okay?” he asked.\n\nShe nodded, forcing a smile. “Yeah… just some work. We’ll handle it.”\n\nAarav squeezed her hand. He understood. This wasn’t the end of their struggle. But it was the beginning of their together.\n\nAnd sometimes, beginnings mattered more than endings.\n\nConflict Escalation\n\nChapter 25: The Call\n\nAarav was at his PG, staring at his laptop, when Riya’s call came through.\n\n“Hello?” he said, a hint of worry creeping in.\n\n“Hi… can we talk? My parents…” Her voice trailed off, heavy with frustration."
    },
    {
      "id": "page-9-24",
      "pageNumber": 24,
      "content": "They met at a quiet café near her hostel. Riya looked tense, biting her lip.\n\n“My parents are visiting next week. They want to meet someone. The boy from Jaipur. They don’t want to hear about journalism. Nothing. Just marriage.”\n\nAarav’s stomach sank. “And you…?”\n\n“I don’t know what to say. I don’t want to disappoint them… but I don’t want to lose you either.”\n\nSilence hung between them. For the first time, Aarav felt the weight of reality pressing down on their bubble.\n\nChapter 26: Misunderstanding\n\nA few days later, Aarav noticed Riya being distant. She seemed preoccupied, often avoiding his messages. One evening, he saw a social media post: a picture of her with the Jaipur boy’s family at a dinner, smiling politely.\n\nHis heart sank. She hadn’t told him.\n\nHe tried calling. No answer. Messaged her: “Riya, what’s happening?”\n No reply.\n\nDoubt, fear, and hurt twisted in his chest. He remembered her parents’ warnings, the first fight, the pressure. His mind spiraled: Has she moved on? Was our reunion just… temporary?"
    },
    {
      "id": "page-9-25",
      "pageNumber": 25,
      "content": "Riya, meanwhile, was overwhelmed. She was juggling work, family expectations, and the need to reassure Aarav without escalating his fears. She saw the posts as nothing more than courtesy photos, but didn’t realize how it looked from his perspective.\n\nChapter 27: Alone With Thoughts\n\nAarav spent the night wandering Delhi streets, trying to make sense of it all. The lights, the sounds, the chaos—they were once comforting. Now, they felt like a mirror of his confusion.\n\n“Maybe I was too late… maybe I should have confessed everything earlier… maybe I don’t belong in her world…”\n\nHe stopped near India Gate, the same spot where they had reunited. Memories of her laugh, her hand in his, the first kiss—they cut deep.\n\nHe didn’t know if hope remained or if the city had swallowed it.\n\nChapter 28: Riya’s Struggle\n\nRiya sat in her hostel room, head in her hands. Her parents were visiting in three days, and the boy’s family expected her to entertain them. She wanted to talk to Aarav, to explain, but she feared adding to his doubts.\n\nShe typed a message: “I’ll explain everything soon. Please trust me.”"
    },
    {
      "id": "page-9-26",
      "pageNumber": 26,
      "content": "She stared at it for minutes, then deleted it. Somehow, words felt too small. The distance between them was growing, and neither knew how to bridge it.\n\nChapter 29: The Looming Storm\n\nAs Diwali lights faded into everyday city glow, both Aarav and Riya felt the tension tighten like a noose. Their reunion had been real, their love undeniable—but now life was testing them.\n\nFamily expectations, career paths, unspoken fears—all loomed ahead.\n\nAnd the city of Delhi, with all its chaos and beauty, waited silently as their hearts prepared for the next challenge.\n\nFamily Confrontation & Temporary Separation\n\nChapter 30: Arrival\n\nRiya’s parents arrived in Delhi on a bright Saturday morning. The city felt heavier to her now, each honking car a reminder of the storm looming over her love life.\n\nHer father’s first words after stepping out of the car:\n “Riya, we’ve arranged something important for you. We expect you to be polite.”\n\nAarav waited outside her hostel, watching from a distance. He hadn’t been formally invited, but he felt the tension pressing on his chest. Today could change everything."
    },
    {
      "id": "page-9-27",
      "pageNumber": 27,
      "content": "Chapter 31: The Dinner\n\nThe Jaipur family was charming, polite, and perfectly formal. Riya’s parents smiled proudly, expecting her to shine. Aarav sat quietly across the room, feeling like an intruder.\n\nThe boy from Jaipur was polite, respectful, yet his presence made Aarav’s jaw tighten. Every laugh, every smile seemed rehearsed, like a test.\n\nAt one point, Riya’s mother whispered to her:\n “You need to show them who you are. Your dreams are secondary right now.”\n\nRiya nodded silently, trying to balance honesty with diplomacy. Aarav watched her hands fidget with the napkin, realizing she was suffocating under expectations he could not ease.\n\nChapter 32: The Clash\n\nAfter dinner, Aarav stepped outside for fresh air. Riya followed quietly.\n\n“I can’t do this,” she admitted, her voice barely above a whisper.\n\nAarav looked at her, pain and frustration mixing. “Do what? Pretend? Smile for them while you slowly disappear?”\n\n“They won’t understand us,” she said. “They’ll never approve. Maybe… maybe we’re just too different.”\n\nHis heart ached. “We’ve fought for so long to get here, Riya. We’re together. Isn’t that enough?”"
    },
    {
      "id": "page-9-28",
      "pageNumber": 28,
      "content": "“It’s not enough, Aarav. Not for them. And maybe… not for us either.”\n\nTears welled in her eyes. Aarav felt his own threatening. They stood in silence, the city humming around them, but for them, the world had narrowed to heartbreak and helplessness.\n\nFinally, she whispered:\n “Maybe we should… take some time apart. To think. To breathe. To not hurt each other more.”\n\nHe wanted to scream, to beg her to stay. But the reality was clear—sometimes love alone couldn’t fight the world.\n\nChapter 33: Parting\n\nThey walked to the edge of the street, hesitant to touch, hesitant to let go, yet knowing they must.\n\nAarav finally said, “No matter what… I’ll wait. I’ll fight. But I’ll respect your choice.”\n\nRiya nodded, tears sliding silently. “And I… I’ll always care for you. Always.”\n\nThey parted with a lingering look, hearts heavy, steps slow, the city lights around them both glowing and mocking.\n\nIt wasn’t the end of their story—but it was the most painful chapter yet.\n\nResolution & Heartfelt Reunion\n\nChapter 34: Time Passes\n\nMonths went by. Delhi’s chaos continued, but Aarav and Riya were living parallel lives, their hearts heavy with longing."
    },
    {
      "id": "page-9-29",
      "pageNumber": 29,
      "content": "Aarav threw himself into work, finally securing a permanent position at a leading media firm. His poetry and articles began gaining recognition online, giving him confidence he hadn’t felt in years.\n\nRiya excelled in her journalism career, landing a prominent editorial role. Yet, every achievement felt incomplete without Aarav.\n\nThough physically apart, neither day passed without thoughts of the other.\n\nChapter 35: Unexpected Meeting\n\nOne rainy evening, Aarav attended a media conference at a downtown hotel. He barely noticed the chatter, until he looked up and saw her—Riya, standing near the stage, reporting live, her umbrella forgotten in her hand.\n\nTime froze. Their eyes met across the crowd. A thousand unspoken words passed between them.\n\nAfter the event, Aarav approached. “Riya…”\n\nShe turned, heart skipping. “Aarav… it’s been months.”\n\n“Yes,” he said softly, smiling despite the ache in his chest. “Too long.”\n\nThey talked, slowly bridging the distance, sharing stories of growth, struggles, and achievements. For the first time, it felt like their worlds were aligned."
    },
    {
      "id": "page-9-30",
      "pageNumber": 30,
      "content": "Chapter 36: Family Realizations\n\nRiya’s parents, seeing her success and happiness, began reconsidering their stance. Her father said one evening:\n “Maybe we underestimated her choices… and maybe she isn’t so different from us after all.”\n\nHer mother nodded, quietly approving Riya’s decisions. The Jaipur boy’s family politely withdrew, realizing the strength of Riya’s independence and Aarav’s dedication.\n\nThe path cleared—not because obstacles vanished, but because both families recognized the love and maturity between the two.\n\nChapter 37: Reunion\n\nAarav and Riya decided to meet at their favorite spot—India Gate. The same place where they had reunited months ago and faced separation.\n\nRiya approached, her hair damp from the drizzle, but her eyes bright with certainty. Aarav ran to her, not stopping until he reached her side.\n\n“I waited,” he said simply.\n\n“I know,” she replied, tears slipping down her cheeks. “And I’ve realized… I don’t want to let go again.”\n\nThey embraced, letting months of pain, longing, and hope melt into the moment."
    },
    {
      "id": "page-9-31",
      "pageNumber": 31,
      "content": "Chapter 38: Love Rekindled\n\nAs they walked hand in hand under the city lights, the world felt lighter. The challenges weren’t gone—career pressures, family expectations, life’s uncertainties—but together, they felt unstoppable.\n\nAarav whispered, “No more almost confessions. No more misunderstandings. Just us, facing everything together.”\n\nRiya smiled, leaning her head on his shoulder. “Together. Always.”\n\nAnd for the first time in what felt like forever, the city didn’t seem so chaotic. The world didn’t seem so heavy. There was only them—two hearts, stronger and wiser, ready to embrace love without fear.\n\nEpilogue: A Year Later\n\nChapter 39: A New Dawn\n\nAarav opened the curtains of his Delhi apartment, sunlight spilling across his desk. The room smelled faintly of coffee, paper, and something else—Riya’s perfume, lingering from her morning visit.\n\nRiya was in the kitchen, humming a tune, preparing breakfast. The casual chaos of their morning felt perfect. Aarav watched her for a moment, heart full, realizing how far they had come.\n\n“Good morning,” she said, glancing at him with a warm smile."
    },
    {
      "id": "page-9-32",
      "pageNumber": 32,
      "content": "“Morning,” he replied, walking over to kiss her forehead. “I missed you.”\n\n“You just saw me five minutes ago,” she teased.\n\n“But I missed you anyway,” he said, pulling her into a hug.\n\nChapter 40: Dreams Together\n\nOver the past year, both had grown tremendously. Aarav’s media firm had recognized him with a promotion. Riya’s journalism work had earned her accolades, and she was now heading a small editorial team.\n\nYet, despite their busy lives, they made time for each other. Weekends meant exploring Delhi, cooking together, or simply laughing over silly stories. They had learned the art of balance—between work, family, and love.\n\nRiya’s parents, once a source of tension, had become her greatest supporters. Aarav had won them over with patience, respect, and love. Even the Jaipur boy and his family had politely stepped away, realizing Riya’s heart and priorities were set.\n\nChapter 41: Celebrating Love\n\nOne evening, Aarav surprised Riya at India Gate—the place where they had reunited months ago. Fairy lights adorned the pathways, and the air smelled of roasted corn and jasmine from street vendors."
    },
    {
      "id": "page-9-33",
      "pageNumber": 33,
      "content": "He handed her a small gift—a delicate bracelet engraved with: “Together. Always.”\n\nRiya’s eyes glistened. “You remembered.”\n\n“Of course,” Aarav said. “Every milestone, every memory… I want to remember it all with you.”\n\nThey walked hand in hand, reminiscing about the journey—from school friends to young lovers, from misunderstandings to emotional separation, and finally, to this peaceful, loving moment.\n\nChapter 42: A Quiet Promise\n\nSitting on their favorite bench under the dim streetlights, Aarav whispered, “No matter what comes next… career, family, life… we’ll face it together. Always.”\n\nRiya leaned her head on his shoulder. “Always.”\n\nThe city buzzed around them, but for Aarav and Riya, the world was calm, full of possibilities and hope. They had learned that love wasn’t just about stolen glances or secret messages—it was about standing by each other through storms and celebrating the small, quiet victories together.\n\nAnd as fireworks from a distant festival lit up the sky, they smiled, knowing that this was only the beginning of a lifetime together."
    }
  ],
  "languages": {
    "english": {
      "title": "The Enchanted Chronicles",
      "description": "A mystical journey through ancient realms where magic and reality intertwine.",
      "pages": [
        {
          "id": "page-9-1",
          "pageNumber": 1,
          "content": "When We Fell in Love Again\n\nBeginning\n\nChapter 1: The Train Journey\n\nThe train screeched to a halt at New Delhi Railway Station, jolting Aarav out of his thoughts. He adjusted his backpack, stepped onto the platform, and inhaled the warm air thick with dust, diesel, and chai vendors shouting in chorus. Delhi always overwhelmed him, but today it felt different.\n\nToday was the first day of his internship at a reputed media house—his first big step towards proving that he wasn’t just the quiet boy from Lucknow who hid behind books.\n\nAs he dragged his suitcase across the crowded platform, he noticed her.\n\nShe was standing near a tea stall, her hair tied messily in a bun, wearing a simple blue kurti and jeans, sipping chai like the world owed her nothing but this moment of calm. Something about her stood out—maybe the way she looked at the chaos without flinching, as if she belonged to it.\n\nAarav froze.\n\nNot because she was beautiful (though she was), but because he had seen her before. A face he thought he had forgotten, but one memory pulled back like a flood.\n\nRiya."
        },
        {
          "id": "page-9-2",
          "pageNumber": 2,
          "content": "The same girl who once sat two benches away in their school classroom. The girl he had never dared to talk to, except in borrowed glances and awkward stolen moments.\n\nFive years. And here she was.\n\nHe wanted to walk up, say hello, maybe make a joke about fate pulling pranks. But he hesitated. What if she didn’t remember him? What if she had moved on, the way people do?\n\nHis phone buzzed. His new boss. “Be in office at 10 sharp. Don’t be late.”\n\nAarav sighed, forced his eyes away, and turned to leave. But just as he stepped forward, he heard a familiar voice.\n\n“Aarav? Is that you?”\n\nHe froze mid-step. His heart skipped a beat.\n\nChapter 2: Old Names, New Faces\n\n“Aarav Pradhan from St. Mary’s School, Lucknow?”\n\nRiya’s smile was playful, her tone laced with curiosity. Aarav turned slowly, and for a second, it felt like the platform blurred out. She still had the same spark in her eyes.\n\n“Yeah,” he managed, awkwardly. “And you’re… Riya Sharma.”\n\nShe laughed softly. “Wow. Five years and you still remember.”"
        },
        {
          "id": "page-9-3",
          "pageNumber": 3,
          "content": "Of course, he remembered. He had memorized every detail about her back then—how she twirled her pen when she was bored, how she laughed even when teachers scolded her, how she always had her diary open during recess.\n\nThey stood facing each other, the air heavy with nostalgia. The awkward silence stretched until Riya broke it.\n\n“So, Delhi? Internship? Or…”\n\n“Internship,” Aarav said quickly. “Media house. You?”\n\n“Final year Journalism. DU. I’m staying here in the hostel. Delhi kind of grows on you.”\n\nThey started walking together towards the exit. Aarav couldn’t help but notice how easily she carried herself, how naturally conversations flowed from her lips. Meanwhile, he found himself calculating each word before speaking, afraid he might sound foolish.\n\n“Still the quiet one?” she teased.\n\nHe chuckled nervously. “Some things don’t change.”\n\n“Good. The world needs more listeners.”\n\nChapter 3: Threads of Fate\n\nOutside, the city buzzed with its usual madness. Horns blared, rickshaw pullers argued, vendors sold everything from sunglasses to phone covers. Aarav tried booking a cab on his phone, but the app kept showing surge prices."
        },
        {
          "id": "page-9-4",
          "pageNumber": 4,
          "content": "“Where are you headed?” Riya asked.\n\n“Karol Bagh. My PG’s there.”\n\nHer eyes lit up. “No way! My hostel’s nearby. Come, we’ll share an auto.”\n\nAnd just like that, Aarav found himself sitting next to her in a rattling auto-rickshaw, watching the city blur past.\n\nIt felt surreal. A girl he once admired silently was now inches away, her hair occasionally brushing against his shoulder with every bump in the road. He wanted to say so much—about the past, about how fate had a funny way of reconnecting people. But instead, he stayed quiet, content in the moment.\n\nRiya, on the other hand, seemed in no mood for silence.\n\n“You know, Aarav, I used to think you hated me,” she said suddenly.\n\n“What? Why?”\n\n“Because you never talked. You’d just… look sometimes. Then look away.”\n\nHeat crept up his neck. “I didn’t hate you. I just…” He paused. “…didn’t know how to talk to you.”\n\nHer laugh rang out, carefree. “Well, here’s your second chance. Don’t waste it.”\n\nAarav smiled, and for the first time in years, he felt like maybe—just maybe—life was giving him a story worth living.\n\nRediscovering Each Other"
        },
        {
          "id": "page-9-5",
          "pageNumber": 5,
          "content": "Chapter 4: Settling In\n\nThe auto-rickshaw stopped outside a narrow lane in Karol Bagh, lined with old houses converted into PGs. Aarav got down, pulling his suitcase along. Riya looked around, her face scrunching up.\n\n“You’re staying here?” she asked.\n\n“Yeah. What’s wrong with it?” Aarav looked defensive.\n\n“Nothing,” she said quickly, hiding a smile. “It’s just… typical you. Always choosing the simplest option.”\n\nHe raised an eyebrow. “And what does that mean?”\n\nShe shrugged. “Back in school, when everyone else showed off with fancy pens, you wrote with the same old Reynolds. When everyone carried expensive lunchboxes, you still brought home-packed parathas wrapped in foil.”\n\nAarav chuckled. “And you still notice everything.”\n\nRiya grinned. “Guilty.”\n\nThey stood there, neither willing to break the moment. Then Riya checked her phone. “I should go. Hostel warden’s strict. But… hey, let’s meet tomorrow evening? Coffee?”\n\nAarav’s heart skipped. “Yeah. Sure.”\n\n“Good. Don’t be late.” She flashed him one last smile before walking away.\n\nAs Aarav climbed the stairs to his PG, dragging his suitcase, he realized something—Delhi didn’t feel so big anymore."
        },
        {
          "id": "page-9-6",
          "pageNumber": 6,
          "content": "Chapter 5: First Day, First Jitters\n\nThe office building of Daily Chronicle towered above him like a fortress. Aarav felt a mix of excitement and nervousness as he entered. Inside, the buzz of ringing phones, clicking keyboards, and reporters rushing with files overwhelmed him.\n\n“Interns over there,” the receptionist pointed him to a group of nervous faces sitting with notepads.\n\nAarav took his seat, adjusting his glasses. Soon, a senior editor walked in—a tall man with salt-and-pepper hair and a voice that commanded respect.\n\n“Welcome to Chronicle. You’re here to learn, but also to prove if you belong in this industry. Journalism isn’t just writing. It’s chasing truths, even when they hurt. If you’re here for glamour, walk out now.”\n\nThe interns shifted uncomfortably. Aarav swallowed hard, his mind already racing with doubts.\n\nDuring introductions, he barely spoke more than his name. Some interns boasted about their achievements, while Aarav stayed quiet, his pen tapping nervously."
        },
        {
          "id": "page-9-7",
          "pageNumber": 7,
          "content": "But later that day, when the editor asked them to write a quick piece on “Delhi Through My Eyes,” Aarav poured his thoughts onto paper—about the chaos, the contradictions, the warmth hidden in its rough edges. When he handed it in, the editor raised an eyebrow.\n\n“Not bad, Pradhan. You write with honesty. Don’t lose that.”\n\nFor the first time, Aarav felt he might just belong here.\n\nChapter 6: Coffee and Confessions\n\nThat evening, Aarav waited outside a café near Connaught Place, his hands fidgeting with his phone. He kept checking the time, afraid of being too early, too eager.\n\nAnd then she arrived.\n\nRiya walked in wearing a simple white kurti and jeans, hair open this time. She looked fresh, confident, and utterly comfortable in her own skin. Aarav, on the other hand, felt like he had rehearsed a thousand conversations in his head and forgotten all of them at once.\n\n“You’re early,” she teased, sliding into the seat opposite him.\n\n“You said not to be late,” he replied, trying to sound casual."
        },
        {
          "id": "page-9-8",
          "pageNumber": 8,
          "content": "They ordered coffee, and soon, conversation flowed. They talked about old school teachers, about how time had changed them, about Delhi’s madness. Riya narrated hostel stories with dramatic hand gestures that made people at the next table chuckle. Aarav mostly listened, smiling at how easily she spoke.\n\nBut then, her tone shifted.\n\n“You know, Aarav… people think I’m this confident girl who knows what she wants. Truth is, I’m terrified half the time.”\n\nHe blinked. “You? Terrified?”\n\nShe nodded, stirring her coffee absentmindedly. “Journalism’s tough. Deadlines, competition, family expectations… Sometimes I wonder if I’ll ever make it.”\n\nAarav leaned forward. “You will. If there’s one thing I remember about you, it’s that you never give up.”\n\nHer eyes softened. “And if there’s one thing I remember about you, it’s that you always meant what you said.”\n\nThe café’s dim lights reflected in her eyes, and for a fleeting moment, the world outside didn’t exist.\n\nChapter 7: A Promise Rekindled\n\nAs they stepped out of the café, Delhi’s night air wrapped around them—cool, restless, alive. Streetlights glowed, vendors still called out, and the city showed no signs of sleeping."
        },
        {
          "id": "page-9-9",
          "pageNumber": 9,
          "content": "“Feels good to talk after so long,” Riya said.\n\n“Yeah. Feels… easy,” Aarav admitted.\n\nThey walked side by side, silence settling comfortably between them. Then Riya spoke again, her voice thoughtful.\n\n“Back in school, I always wished we had talked more. Maybe even been friends. You were the mystery boy in the corner, always scribbling something in your notebook.”\n\nAarav smiled faintly. “Poems. Bad ones.”\n\n“I’d like to read them someday,” she said softly.\n\nHe glanced at her, heart pounding. “Maybe someday.”\n\nAs they reached the crossroads where their ways parted, Riya stopped.\n\n“Let’s not lose touch this time, Aarav.”\n\nHe looked at her, remembering how five years ago he had let distance win. Not again.\n\n“Promise,” he said.\n\nAnd with that, fate stitched their paths together once more.\n\nCloseness & Confessions\n\nChapter 8: Midnight Messages\n\nIt started with a “Did you reach safely?” text from Riya after their coffee meeting.\n Aarav stared at his phone longer than necessary before replying: “Yeah. You?”"
        },
        {
          "id": "page-9-10",
          "pageNumber": 10,
          "content": "That one simple check-in became a thread. By the end of the week, they were messaging daily—small things at first. Riya sending him photos of hostel food with captions like, “See what torture tastes like.” Aarav replying with memes about his PG roommate snoring like a truck.\n\nSoon, it wasn’t just banter. It was late-night talks. About books, about dreams, about fears they couldn’t tell anyone else. Aarav realized he was writing more on WhatsApp than he had ever spoken in person.\n\nOne night, Riya asked, “Do you still write?”\n\nAarav hesitated, fingers hovering. Then he sent her a photo of a page from his notebook—an unfinished poem about Delhi’s chaos mirroring the human heart.\n\nMinutes later, Riya replied:\n “You have no idea how good you are, Aarav. You should publish.”\n\nHe smiled in the dark, heart racing. No one had ever believed in him like that before.\n\nChapter 9: Little Things\n\nThey began meeting more often. Sometimes after Aarav’s office hours, sometimes during Riya’s free lectures. They would sit on the steps of India Gate, sharing roasted peanuts from a paper cone. Or sneak into old Delhi lanes for street food, laughing when they argued about whether chole bhature was better than momos."
        },
        {
          "id": "page-9-11",
          "pageNumber": 11,
          "content": "One rainy evening, they got stuck near Connaught Place. Shops were shutting, traffic was a mess. Aarav instinctively held his bag over Riya’s head to shield her from the rain. She burst out laughing.\n\n“What are you doing?”\n\n“Saving your hair,” he said sheepishly.\n\n“Idiot. You’ll get drenched.”\n\n“It’s fine. I don’t look half as good as you anyway.”\n\nHe regretted the words the moment they slipped out. But instead of mocking him, Riya looked away, her cheeks turning pink.\n\nThat was the moment Aarav realized: this wasn’t just nostalgia. He was falling—deeply, irreversibly—again.\n\nChapter 10: Cracks Appear\n\nBut reality never stayed dreamy for long.\n\nOne Saturday, Riya showed up at their usual café looking distracted. Her coffee remained untouched.\n\n“What’s wrong?” Aarav asked.\n\nShe sighed. “Parents. They called today. Another lecture on how journalism isn’t a ‘real’ career. They’ve already started dropping hints about marriage.”\n\nAarav froze. “Marriage? But… you’re still studying.”\n\n“Exactly. But you know how families are. Stability, society, shaadi… it’s like they have a checklist.”"
        },
        {
          "id": "page-9-12",
          "pageNumber": 12,
          "content": "Her voice wavered, and for the first time, Aarav saw her eyes glisten. He wanted to reach across the table, hold her hand, tell her she wasn’t alone. But his courage failed.\n\nInstead, he muttered, “You’ll figure it out. You always do.”\n\nRiya nodded, but her smile didn’t reach her eyes.\n\nThat night, Aarav couldn’t sleep. He kept replaying her words. Somewhere deep down, a fear clawed at him—what if history repeated itself? What if, just like in school, Riya drifted away again… this time for good?\n\nAlmost Confessions & Cracks Deepening\n\nChapter 11: The Metro Ride\n\nIt was almost midnight when Aarav and Riya boarded the last metro from Rajiv Chowk. They had spent the evening wandering Janpath, bargaining over junk jewelry neither of them planned to buy, and sharing a plate of golgappas from a roadside stall.\n\nThe metro was nearly empty, its fluorescent lights flickering against the silence. Riya sat by the window, resting her head on the glass, humming a tune softly. Aarav sat beside her, stealing glances.\n\n“Why are you smiling like that?” she asked suddenly, catching him.\n\nHe panicked. “Nothing. Just… the song. It’s nice.”"
        },
        {
          "id": "page-9-13",
          "pageNumber": 13,
          "content": "She narrowed her eyes playfully. “Liar. You’ve always been terrible at lying.”\n\nHe looked away, heart hammering. He wanted to tell her. That he had thought about her every single day since school. That seeing her again felt like life was giving him a second chance. That her laughter made Delhi’s chaos feel like home.\n\nBut the words stuck.\n\nInstead, he whispered, “I’m just glad we met again.”\n\nRiya’s expression softened. “Me too, Aarav. Me too.”\n\nThe train slowed, announcing her stop. She stood, adjusting her bag. “Goodnight, mystery boy.”\n\nAnd just like that, the moment slipped.\n\nChapter 12: Uninvited Choices\n\nThe next afternoon, Riya called him, her voice strained.\n\n“Aarav, can we meet? Urgent.”\n\nThey sat at their café, but unlike usual, she didn’t order her cappuccino. She was restless, tapping her fingers on the table.\n\n“My mom’s cousin came today,” she began. “They… they’ve started looking for matches. Apparently some family in Jaipur is interested.”\n\nAarav’s chest tightened. “And what did you say?”\n\n“That I’m not ready. That my career comes first. But you know how it goes… they think journalism is a hobby, not a job.”"
        },
        {
          "id": "page-9-14",
          "pageNumber": 14,
          "content": "She laughed bitterly. “They told me, ‘Who’ll marry a girl who runs behind breaking news?’”\n\nAarav clenched his fists under the table. He wanted to shout that any man who couldn’t see her worth didn’t deserve her. He wanted to say I’ll marry you.\n\nBut again, silence betrayed him.\n\nAll he managed was, “You’ll prove them wrong. You always do.”\n\nRiya smiled faintly, but her eyes were clouded.\n\nChapter 13: The Diary\n\nA week later, they met in Riya’s hostel room when her roommate was away. Books were scattered, papers piled up—her world looked like organized chaos.\n\nShe handed him a small diary. “Read this.”\n\nInside were her own writings—raw articles, half-formed essays, even a short story about a girl who wanted to fly but was tied down by invisible ropes.\n\n“It’s brilliant,” Aarav said honestly.\n\nRiya shrugged. “My parents would never call it that.”\n\nHe looked at her, something inside him breaking. “Riya, you can’t let them decide who you are.”\n\nHer gaze held his. For a second, it felt like the air thickened. She was so close. He could see the faint dimple near her lip, the strands of hair brushing her cheek."
        },
        {
          "id": "page-9-15",
          "pageNumber": 15,
          "content": "He wanted to lean in, to bridge the gap between words and silence.\n\nBut her phone rang—her mother’s name flashing on the screen.\n\nThe moment shattered.\n\nShe turned away to answer, her voice soft, restrained. Aarav sat there, clutching the diary, realizing that love wasn’t just about stolen glances and laughter. It was also about timing. And his… never seemed right.\n\nSparks and Shadows\n\nChapter 14: The Festival of Lights\n\nIt was Diwali week, and Delhi was wrapped in fairy lights. Every street glowed, every corner smelled of sweets and fireworks. Aarav hadn’t expected to celebrate much—his PG felt too dull, too quiet. But Riya had other plans.\n\n“You’re coming with me to campus fest. No excuses.”\n\nAnd so he found himself at her college grounds, surrounded by stalls, music, and laughter. Riya looked radiant in a simple yellow kurti with silver jhumkas, her hair tied up casually yet perfectly. Aarav couldn’t stop staring.\n\n“You clean up well, intern saab,” she teased, nudging his arm.\n\nThey roamed the stalls together—trying bhel puri, laughing at badly sung karaoke, watching fireworks crackle above. For Aarav, it felt like a dream stitched with colors."
        },
        {
          "id": "page-9-16",
          "pageNumber": 16,
          "content": "At one stall, Riya picked up a clay diya, its flame flickering. She handed it to him.\n\n“Make a wish.”\n\nHe closed his eyes. Let her stay. Let this moment last.\n\nWhen he opened them, Riya was still watching him, her eyes softer than he had ever seen.\n\nFor a second, the world dimmed—the noise, the crowd, everything blurred. It was just her. And him. And the unspoken.\n\nChapter 15: The Dance\n\nAs night fell, music filled the courtyard. Students gathered for garba. Riya pulled him in.\n\n“No, no, I can’t dance,” Aarav protested, shaking his head.\n\n“You can write poems but not move your feet? Come on!” she laughed, dragging him.\n\nAwkward at first, he stumbled, stepped on her dupatta once, earning playful glares. But soon, he loosened up. Her laughter was infectious, her energy magnetic. For the first time in years, Aarav felt free—like the boy he used to be before life got heavy.\n\nWhen the song slowed, couples paired off. Riya placed her hand in his, her bangles clinking softly. They swayed under the fairy lights, too close, too vulnerable.\n\nAarav’s heart screamed: Say it. Tell her. Now.\n\nHis lips parted—“Riya, I…”"
        },
        {
          "id": "page-9-17",
          "pageNumber": 17,
          "content": "But just then, her phone buzzed again. The moment snapped. She frowned, silencing the call. Aarav’s chest ached with the weight of unsaid words.\n\nChapter 16: First Clash\n\nLater that night, walking her back, Aarav tried again. “Riya, about earlier… I wanted to tell you something.”\n\nBut she cut him off, frustration spilling. “Aarav, you don’t understand. My mom just called again. She said they’re coming to Delhi next week to meet me. They’ve already lined up a boy from Jaipur.”\n\nHis throat tightened. “And… what do you want?”\n\n“I want time. Freedom. But do I ever get that?” she snapped, her voice sharp.\n\nAarav stayed silent for a beat, then said, “Maybe you should just tell them clearly, Riya. That you won’t marry. That you have your dreams.”\n\nShe turned to him, anger flaring. “It’s not that easy. Not everyone can rebel and walk away. You don’t get it!”\n\nSomething inside him cracked. “Maybe I don’t. But do you even see me, Riya? I’m standing right here, trying to be there for you, and all you talk about is how helpless you are. You’re not helpless—you’re just… scared.”\n\nHer eyes widened, hurt flashing across her face.\n\nSilence. Heavy, unbearable."
        },
        {
          "id": "page-9-18",
          "pageNumber": 18,
          "content": "Finally, she whispered, “Maybe I was wrong. Maybe we shouldn’t meet so often.”\n\nThose words stung deeper than he could admit. Aarav wanted to take them back, to apologize, but his pride chained him.\n\nSo he let her walk away into the night, her shadow shrinking with every step, while his heart felt heavier than ever.\n\nDistance & Longing\n\nChapter 17: Silent Days\n\nThe week after their fight, Delhi felt emptier to Aarav. The streets buzzed, office alarms rang, but nothing mattered. Every sound reminded him of Riya’s laughter, every corner of Connaught Place reminded him of her.\n\nHe tried messaging her. “Are you okay?”\n No reply.\n\n“I’m here if you need me.”\n Nothing.\n\nDays stretched into silence. Aarav replayed the fight over and over. He remembered her words: “Maybe we shouldn’t meet so often.”\n\nIt hurt more than he wanted to admit. And yet, he couldn’t bring himself to stop thinking about her."
        },
        {
          "id": "page-9-19",
          "pageNumber": 19,
          "content": "Meanwhile, Riya was struggling too. Her mother’s calls increased. The boy from Jaipur’s family sent polite messages. She kept herself busy with journalism assignments, but every evening, her thoughts wandered to Aarav—the way he held the diya, his awkward dance steps, the quiet way he supported her.\n\nNeither spoke. Neither reached out. And the unspoken love between them grew heavier with every passing day.\n\nChapter 18: The Cafe That Waited\n\nOne evening, Aarav found himself at their usual café. The same corner table, the same old menu board. He sat, staring at the empty chair across from him, a cup of coffee growing cold.\n\nHe pulled out his notebook and started writing:\n\n“You’re everywhere I look. I see you in every corner of this city. I see you in every poem I write. I see you in every laugh I hear, every song I hum. And yet… you’re not here.”\n\nRiya’s favorite cappuccino arrived—he hadn’t ordered it. A note slipped underneath:\n\n“I miss you too. Don’t stop fighting for yourself. –R”\n\nHis chest tightened. She had come here, somehow, without meeting him. Somehow, her heart was still speaking to him, even in silence."
        },
        {
          "id": "page-9-20",
          "pageNumber": 20,
          "content": "Chapter 19: Reflection\n\nThat night, Aarav wandered through Delhi streets. The city seemed quiet, holding its breath. He thought about the Diwali night, about their laughter, about the dance. About how he had almost confessed, but the words died on his lips.\n\n“Why do I keep hesitating?” he muttered to himself.\n\nBecause love was easy to feel, but terrifying to voice. Because fear of losing her completely loomed larger than hope of gaining her. Because life had taught him that sometimes, the hardest battles are the ones inside your own heart.\n\nHe paused near India Gate, watching couples stroll, families laughing, strangers hugging. He imagined Riya there, smiling at someone else, living her life while he lingered on what-ifs.\n\nAnd he realized—if he didn’t act soon, he might lose her forever.\n\nChapter 20: A Glimmer of Hope\n\nMeanwhile, Riya sat in her hostel room, staring at the diary Aarav had held. She traced his handwriting, remembering how he had looked at her in that moment. A part of her wanted to call him, to fix everything. Another part feared it was too late.\n\nHer phone buzzed. A new message from Aarav:"
        },
        {
          "id": "page-9-21",
          "pageNumber": 21,
          "content": "“Meet me tomorrow, near India Gate. 6 PM. Come. Please.”\n\nHer heart leaped. Hope, fear, excitement—all tangled together. She typed back hesitantly: “Okay. I’ll come.”\n\nIt wasn’t a solution. It wasn’t a confession. But it was a start.\n\nAnd sometimes, a start is all love needs.\n\nReunion & Confession\n\nChapter 21: The Meeting\n\nAarav reached India Gate early, pacing nervously. The evening air was crisp, filled with the scent of street food and the distant laughter of families strolling. His palms were sweaty, heart hammering.\n\nRiya appeared from the pathway, her silhouette framed by the fading sun. She looked hesitant, cautious, but her eyes softened the moment they met his gaze.\n\n“Hi,” she whispered.\n\n“Hi,” he replied, his voice barely audible.\n\nFor a few seconds, they just stood there, the city humming around them, yet somehow paused for their reunion.\n\nChapter 22: Words at Last\n\n“I… I’ve missed you,” Aarav finally said, his voice trembling slightly.\n\nRiya’s eyes glistened. “I missed you too. But I was scared… scared of what would happen if we spoke. My parents… the expectations…”"
        },
        {
          "id": "page-9-22",
          "pageNumber": 22,
          "content": "He stepped closer. “Riya, I don’t care about anything else. I care about you. I’ve cared since school. I’ve cared all over again since that day at the platform. I… I love you.”\n\nHer breath caught. She wanted to laugh, cry, scream—all at once. She took a shaky step toward him. “Aarav… I… I love you too. But… my family, my career…”\n\nHe held her hands firmly. “Then we’ll face it together. We’ll figure it out. But I can’t keep pretending I don’t feel this way. I can’t let you go again.”\n\nTears slipped from her eyes. “I was so afraid I’d ruin this… ruin us.”\n\n“You couldn’t,” he said softly, brushing a strand of hair from her face. “Not now. Not ever.”\n\nFor the first time in weeks, they smiled without fear. The city lights reflected in their eyes, glittering like the beginning of a new chapter.\n\nChapter 23: The First Kiss\n\nA quiet pause settled between them. The air was thick, almost tangible, with unspoken words and years of longing. Aarav leaned in slowly. Riya tilted her face.\n\nTheir lips met softly at first—hesitant, trembling—but then with the weight of all their missed chances, all their silent nights, all the longing they couldn’t put into words."
        },
        {
          "id": "page-9-23",
          "pageNumber": 23,
          "content": "It wasn’t just a kiss. It was a promise. A confession. A declaration that neither time nor fear could erase what they felt.\n\nWhen they pulled away, they rested foreheads together, breathing in sync.\n\n“I never want to let you go again,” Aarav murmured.\n\n“You won’t,” Riya replied, voice steady despite the tears.\n\nAnd for that moment, the world outside—the city, the noise, the expectations—didn’t exist. There was only them.\n\nChapter 24: Subtle Shadows\n\nAs they walked home together under the streetlights, laughter occasionally breaking through, Riya’s phone buzzed again—a reminder of the looming family pressure. Aarav noticed her stiffen.\n\n“You okay?” he asked.\n\nShe nodded, forcing a smile. “Yeah… just some work. We’ll handle it.”\n\nAarav squeezed her hand. He understood. This wasn’t the end of their struggle. But it was the beginning of their together.\n\nAnd sometimes, beginnings mattered more than endings.\n\nConflict Escalation\n\nChapter 25: The Call\n\nAarav was at his PG, staring at his laptop, when Riya’s call came through.\n\n“Hello?” he said, a hint of worry creeping in.\n\n“Hi… can we talk? My parents…” Her voice trailed off, heavy with frustration."
        },
        {
          "id": "page-9-24",
          "pageNumber": 24,
          "content": "They met at a quiet café near her hostel. Riya looked tense, biting her lip.\n\n“My parents are visiting next week. They want to meet someone. The boy from Jaipur. They don’t want to hear about journalism. Nothing. Just marriage.”\n\nAarav’s stomach sank. “And you…?”\n\n“I don’t know what to say. I don’t want to disappoint them… but I don’t want to lose you either.”\n\nSilence hung between them. For the first time, Aarav felt the weight of reality pressing down on their bubble.\n\nChapter 26: Misunderstanding\n\nA few days later, Aarav noticed Riya being distant. She seemed preoccupied, often avoiding his messages. One evening, he saw a social media post: a picture of her with the Jaipur boy’s family at a dinner, smiling politely.\n\nHis heart sank. She hadn’t told him.\n\nHe tried calling. No answer. Messaged her: “Riya, what’s happening?”\n No reply.\n\nDoubt, fear, and hurt twisted in his chest. He remembered her parents’ warnings, the first fight, the pressure. His mind spiraled: Has she moved on? Was our reunion just… temporary?"
        },
        {
          "id": "page-9-25",
          "pageNumber": 25,
          "content": "Riya, meanwhile, was overwhelmed. She was juggling work, family expectations, and the need to reassure Aarav without escalating his fears. She saw the posts as nothing more than courtesy photos, but didn’t realize how it looked from his perspective.\n\nChapter 27: Alone With Thoughts\n\nAarav spent the night wandering Delhi streets, trying to make sense of it all. The lights, the sounds, the chaos—they were once comforting. Now, they felt like a mirror of his confusion.\n\n“Maybe I was too late… maybe I should have confessed everything earlier… maybe I don’t belong in her world…”\n\nHe stopped near India Gate, the same spot where they had reunited. Memories of her laugh, her hand in his, the first kiss—they cut deep.\n\nHe didn’t know if hope remained or if the city had swallowed it.\n\nChapter 28: Riya’s Struggle\n\nRiya sat in her hostel room, head in her hands. Her parents were visiting in three days, and the boy’s family expected her to entertain them. She wanted to talk to Aarav, to explain, but she feared adding to his doubts.\n\nShe typed a message: “I’ll explain everything soon. Please trust me.”"
        },
        {
          "id": "page-9-26",
          "pageNumber": 26,
          "content": "She stared at it for minutes, then deleted it. Somehow, words felt too small. The distance between them was growing, and neither knew how to bridge it.\n\nChapter 29: The Looming Storm\n\nAs Diwali lights faded into everyday city glow, both Aarav and Riya felt the tension tighten like a noose. Their reunion had been real, their love undeniable—but now life was testing them.\n\nFamily expectations, career paths, unspoken fears—all loomed ahead.\n\nAnd the city of Delhi, with all its chaos and beauty, waited silently as their hearts prepared for the next challenge.\n\nFamily Confrontation & Temporary Separation\n\nChapter 30: Arrival\n\nRiya’s parents arrived in Delhi on a bright Saturday morning. The city felt heavier to her now, each honking car a reminder of the storm looming over her love life.\n\nHer father’s first words after stepping out of the car:\n “Riya, we’ve arranged something important for you. We expect you to be polite.”\n\nAarav waited outside her hostel, watching from a distance. He hadn’t been formally invited, but he felt the tension pressing on his chest. Today could change everything."
        },
        {
          "id": "page-9-27",
          "pageNumber": 27,
          "content": "Chapter 31: The Dinner\n\nThe Jaipur family was charming, polite, and perfectly formal. Riya’s parents smiled proudly, expecting her to shine. Aarav sat quietly across the room, feeling like an intruder.\n\nThe boy from Jaipur was polite, respectful, yet his presence made Aarav’s jaw tighten. Every laugh, every smile seemed rehearsed, like a test.\n\nAt one point, Riya’s mother whispered to her:\n “You need to show them who you are. Your dreams are secondary right now.”\n\nRiya nodded silently, trying to balance honesty with diplomacy. Aarav watched her hands fidget with the napkin, realizing she was suffocating under expectations he could not ease.\n\nChapter 32: The Clash\n\nAfter dinner, Aarav stepped outside for fresh air. Riya followed quietly.\n\n“I can’t do this,” she admitted, her voice barely above a whisper.\n\nAarav looked at her, pain and frustration mixing. “Do what? Pretend? Smile for them while you slowly disappear?”\n\n“They won’t understand us,” she said. “They’ll never approve. Maybe… maybe we’re just too different.”\n\nHis heart ached. “We’ve fought for so long to get here, Riya. We’re together. Isn’t that enough?”"
        },
        {
          "id": "page-9-28",
          "pageNumber": 28,
          "content": "“It’s not enough, Aarav. Not for them. And maybe… not for us either.”\n\nTears welled in her eyes. Aarav felt his own threatening. They stood in silence, the city humming around them, but for them, the world had narrowed to heartbreak and helplessness.\n\nFinally, she whispered:\n “Maybe we should… take some time apart. To think. To breathe. To not hurt each other more.”\n\nHe wanted to scream, to beg her to stay. But the reality was clear—sometimes love alone couldn’t fight the world.\n\nChapter 33: Parting\n\nThey walked to the edge of the street, hesitant to touch, hesitant to let go, yet knowing they must.\n\nAarav finally said, “No matter what… I’ll wait. I’ll fight. But I’ll respect your choice.”\n\nRiya nodded, tears sliding silently. “And I… I’ll always care for you. Always.”\n\nThey parted with a lingering look, hearts heavy, steps slow, the city lights around them both glowing and mocking.\n\nIt wasn’t the end of their story—but it was the most painful chapter yet.\n\nResolution & Heartfelt Reunion\n\nChapter 34: Time Passes\n\nMonths went by. Delhi’s chaos continued, but Aarav and Riya were living parallel lives, their hearts heavy with longing."
        },
        {
          "id": "page-9-29",
          "pageNumber": 29,
          "content": "Aarav threw himself into work, finally securing a permanent position at a leading media firm. His poetry and articles began gaining recognition online, giving him confidence he hadn’t felt in years.\n\nRiya excelled in her journalism career, landing a prominent editorial role. Yet, every achievement felt incomplete without Aarav.\n\nThough physically apart, neither day passed without thoughts of the other.\n\nChapter 35: Unexpected Meeting\n\nOne rainy evening, Aarav attended a media conference at a downtown hotel. He barely noticed the chatter, until he looked up and saw her—Riya, standing near the stage, reporting live, her umbrella forgotten in her hand.\n\nTime froze. Their eyes met across the crowd. A thousand unspoken words passed between them.\n\nAfter the event, Aarav approached. “Riya…”\n\nShe turned, heart skipping. “Aarav… it’s been months.”\n\n“Yes,” he said softly, smiling despite the ache in his chest. “Too long.”\n\nThey talked, slowly bridging the distance, sharing stories of growth, struggles, and achievements. For the first time, it felt like their worlds were aligned."
        },
        {
          "id": "page-9-30",
          "pageNumber": 30,
          "content": "Chapter 36: Family Realizations\n\nRiya’s parents, seeing her success and happiness, began reconsidering their stance. Her father said one evening:\n “Maybe we underestimated her choices… and maybe she isn’t so different from us after all.”\n\nHer mother nodded, quietly approving Riya’s decisions. The Jaipur boy’s family politely withdrew, realizing the strength of Riya’s independence and Aarav’s dedication.\n\nThe path cleared—not because obstacles vanished, but because both families recognized the love and maturity between the two.\n\nChapter 37: Reunion\n\nAarav and Riya decided to meet at their favorite spot—India Gate. The same place where they had reunited months ago and faced separation.\n\nRiya approached, her hair damp from the drizzle, but her eyes bright with certainty. Aarav ran to her, not stopping until he reached her side.\n\n“I waited,” he said simply.\n\n“I know,” she replied, tears slipping down her cheeks. “And I’ve realized… I don’t want to let go again.”\n\nThey embraced, letting months of pain, longing, and hope melt into the moment."
        },
        {
          "id": "page-9-31",
          "pageNumber": 31,
          "content": "Chapter 38: Love Rekindled\n\nAs they walked hand in hand under the city lights, the world felt lighter. The challenges weren’t gone—career pressures, family expectations, life’s uncertainties—but together, they felt unstoppable.\n\nAarav whispered, “No more almost confessions. No more misunderstandings. Just us, facing everything together.”\n\nRiya smiled, leaning her head on his shoulder. “Together. Always.”\n\nAnd for the first time in what felt like forever, the city didn’t seem so chaotic. The world didn’t seem so heavy. There was only them—two hearts, stronger and wiser, ready to embrace love without fear.\n\nEpilogue: A Year Later\n\nChapter 39: A New Dawn\n\nAarav opened the curtains of his Delhi apartment, sunlight spilling across his desk. The room smelled faintly of coffee, paper, and something else—Riya’s perfume, lingering from her morning visit.\n\nRiya was in the kitchen, humming a tune, preparing breakfast. The casual chaos of their morning felt perfect. Aarav watched her for a moment, heart full, realizing how far they had come.\n\n“Good morning,” she said, glancing at him with a warm smile."
        },
        {
          "id": "page-9-32",
          "pageNumber": 32,
          "content": "“Morning,” he replied, walking over to kiss her forehead. “I missed you.”\n\n“You just saw me five minutes ago,” she teased.\n\n“But I missed you anyway,” he said, pulling her into a hug.\n\nChapter 40: Dreams Together\n\nOver the past year, both had grown tremendously. Aarav’s media firm had recognized him with a promotion. Riya’s journalism work had earned her accolades, and she was now heading a small editorial team.\n\nYet, despite their busy lives, they made time for each other. Weekends meant exploring Delhi, cooking together, or simply laughing over silly stories. They had learned the art of balance—between work, family, and love.\n\nRiya’s parents, once a source of tension, had become her greatest supporters. Aarav had won them over with patience, respect, and love. Even the Jaipur boy and his family had politely stepped away, realizing Riya’s heart and priorities were set.\n\nChapter 41: Celebrating Love\n\nOne evening, Aarav surprised Riya at India Gate—the place where they had reunited months ago. Fairy lights adorned the pathways, and the air smelled of roasted corn and jasmine from street vendors."
        },
        {
          "id": "page-9-33",
          "pageNumber": 33,
          "content": "He handed her a small gift—a delicate bracelet engraved with: “Together. Always.”\n\nRiya’s eyes glistened. “You remembered.”\n\n“Of course,” Aarav said. “Every milestone, every memory… I want to remember it all with you.”\n\nThey walked hand in hand, reminiscing about the journey—from school friends to young lovers, from misunderstandings to emotional separation, and finally, to this peaceful, loving moment.\n\nChapter 42: A Quiet Promise\n\nSitting on their favorite bench under the dim streetlights, Aarav whispered, “No matter what comes next… career, family, life… we’ll face it together. Always.”\n\nRiya leaned her head on his shoulder. “Always.”\n\nThe city buzzed around them, but for Aarav and Riya, the world was calm, full of possibilities and hope. They had learned that love wasn’t just about stolen glances or secret messages—it was about standing by each other through storms and celebrating the small, quiet victories together.\n\nAnd as fireworks from a distant festival lit up the sky, they smiled, knowing that this was only the beginning of a lifetime together."
        }
      ]
    },
    "hindi": {
      "title": "",
      "description": "",
      "pages": [
        {
          "id": "page-9-1-hi",
          "pageNumber": 1,
          "content": ""
        },
        {
          "id": "page-9-2-hi",
          "pageNumber": 2,
          "content": ""
        },
        {
          "id": "page-9-3-hi",
          "pageNumber": 3,
          "content": ""
        },
        {
          "id": "page-9-4-hi",
          "pageNumber": 4,
          "content": ""
        },
        {
          "id": "page-9-5-hi",
          "pageNumber": 5,
          "content": ""
        },
        {
          "id": "page-9-6-hi",
          "pageNumber": 6,
          "content": ""
        },
        {
          "id": "page-9-7-hi",
          "pageNumber": 7,
          "content": ""
        },
        {
          "id": "page-9-8-hi",
          "pageNumber": 8,
          "content": ""
        },
        {
          "id": "page-9-9-hi",
          "pageNumber": 9,
          "content": ""
        },
        {
          "id": "page-9-10-hi",
          "pageNumber": 10,
          "content": ""
        },
        {
          "id": "page-9-11-hi",
          "pageNumber": 11,
          "content": ""
        },
        {
          "id": "page-9-12-hi",
          "pageNumber": 12,
          "content": ""
        },
        {
          "id": "page-9-13-hi",
          "pageNumber": 13,
          "content": ""
        },
        {
          "id": "page-9-14-hi",
          "pageNumber": 14,
          "content": ""
        },
        {
          "id": "page-9-15-hi",
          "pageNumber": 15,
          "content": ""
        },
        {
          "id": "page-9-16-hi",
          "pageNumber": 16,
          "content": ""
        },
        {
          "id": "page-9-17-hi",
          "pageNumber": 17,
          "content": ""
        },
        {
          "id": "page-9-18-hi",
          "pageNumber": 18,
          "content": ""
        },
        {
          "id": "page-9-19-hi",
          "pageNumber": 19,
          "content": ""
        },
        {
          "id": "page-9-20-hi",
          "pageNumber": 20,
          "content": ""
        },
        {
          "id": "page-9-21-hi",
          "pageNumber": 21,
          "content": ""
        },
        {
          "id": "page-9-22-hi",
          "pageNumber": 22,
          "content": ""
        },
        {
          "id": "page-9-23-hi",
          "pageNumber": 23,
          "content": ""
        },
        {
          "id": "page-9-24-hi",
          "pageNumber": 24,
          "content": ""
        },
        {
          "id": "page-9-25-hi",
          "pageNumber": 25,
          "content": ""
        },
        {
          "id": "page-9-26-hi",
          "pageNumber": 26,
          "content": ""
        },
        {
          "id": "page-9-27-hi",
          "pageNumber": 27,
          "content": ""
        },
        {
          "id": "page-9-28-hi",
          "pageNumber": 28,
          "content": ""
        },
        {
          "id": "page-9-29-hi",
          "pageNumber": 29,
          "content": ""
        },
        {
          "id": "page-9-30-hi",
          "pageNumber": 30,
          "content": ""
        },
        {
          "id": "page-9-31-hi",
          "pageNumber": 31,
          "content": ""
        },
        {
          "id": "page-9-32-hi",
          "pageNumber": 32,
          "content": ""
        },
        {
          "id": "page-9-33-hi",
          "pageNumber": 33,
          "content": ""
        }
      ]
    },
    "hinglish": {
      "title": "",
      "description": "",
      "pages": [
        {
          "id": "page-9-1-hn",
          "pageNumber": 1,
          "content": ""
        },
        {
          "id": "page-9-2-hn",
          "pageNumber": 2,
          "content": ""
        },
        {
          "id": "page-9-3-hn",
          "pageNumber": 3,
          "content": ""
        },
        {
          "id": "page-9-4-hn",
          "pageNumber": 4,
          "content": ""
        },
        {
          "id": "page-9-5-hn",
          "pageNumber": 5,
          "content": ""
        },
        {
          "id": "page-9-6-hn",
          "pageNumber": 6,
          "content": ""
        },
        {
          "id": "page-9-7-hn",
          "pageNumber": 7,
          "content": ""
        },
        {
          "id": "page-9-8-hn",
          "pageNumber": 8,
          "content": ""
        },
        {
          "id": "page-9-9-hn",
          "pageNumber": 9,
          "content": ""
        },
        {
          "id": "page-9-10-hn",
          "pageNumber": 10,
          "content": ""
        },
        {
          "id": "page-9-11-hn",
          "pageNumber": 11,
          "content": ""
        },
        {
          "id": "page-9-12-hn",
          "pageNumber": 12,
          "content": ""
        },
        {
          "id": "page-9-13-hn",
          "pageNumber": 13,
          "content": ""
        },
        {
          "id": "page-9-14-hn",
          "pageNumber": 14,
          "content": ""
        },
        {
          "id": "page-9-15-hn",
          "pageNumber": 15,
          "content": ""
        },
        {
          "id": "page-9-16-hn",
          "pageNumber": 16,
          "content": ""
        },
        {
          "id": "page-9-17-hn",
          "pageNumber": 17,
          "content": ""
        },
        {
          "id": "page-9-18-hn",
          "pageNumber": 18,
          "content": ""
        },
        {
          "id": "page-9-19-hn",
          "pageNumber": 19,
          "content": ""
        },
        {
          "id": "page-9-20-hn",
          "pageNumber": 20,
          "content": ""
        },
        {
          "id": "page-9-21-hn",
          "pageNumber": 21,
          "content": ""
        },
        {
          "id": "page-9-22-hn",
          "pageNumber": 22,
          "content": ""
        },
        {
          "id": "page-9-23-hn",
          "pageNumber": 23,
          "content": ""
        },
        {
          "id": "page-9-24-hn",
          "pageNumber": 24,
          "content": ""
        },
        {
          "id": "page-9-25-hn",
          "pageNumber": 25,
          "content": ""
        },
        {
          "id": "page-9-26-hn",
          "pageNumber": 26,
          "content": ""
        },
        {
          "id": "page-9-27-hn",
          "pageNumber": 27,
          "content": ""
        },
        {
          "id": "page-9-28-hn",
          "pageNumber": 28,
          "content": ""
        },
        {
          "id": "page-9-29-hn",
          "pageNumber": 29,
          "content": ""
        },
        {
          "id": "page-9-30-hn",
          "pageNumber": 30,
          "content": ""
        },
        {
          "id": "page-9-31-hn",
          "pageNumber": 31,
          "content": ""
        },
        {
          "id": "page-9-32-hn",
          "pageNumber": 32,
          "content": ""
        },
        {
          "id": "page-9-33-hn",
          "pageNumber": 33,
          "content": ""
        }
      ]
    }
  }
}