{
  "id": "f4680c5a-3e6a-4b8e-9990-6406864d1ec7",
  "title": "DHARANA: The Art of Conscious Flow",
  "author": "Rishish Pradhan",
  "cover": "/assets/book5-cover.png",
  "description": "DHARANA: The Art of Conscious Flow by Rishish Pradhan",
  "genre": "Drama / Philosophy",
  "pages": [
    {
      "id": "f4680c5a-3e6a-4b8e-9990-6406864d1ec7-page-1-1",
      "pageNumber": 1,
      "content": "DHARANA: The Art of Conscious Flow\nRediscovering Deep Focus in an Age of Distraction\n\nTable of Contents\n\nIntroduction: The Lost Art of Attention\n\nPart I: The Scattered Mind\nChapter 1: The Attention Crisis\nChapter 2: The Cost of Digital Drift\nChapter 3: Ancient Wisdom Meets Modern Science\n\nPart II: The Five Pillars of Dharana\nChapter 4: Ekagrata - One-Pointed Focus\nChapter 5: Pratyahara - Withdrawal of Senses\nChapter 6: Dharana - Sustained Attention\nChapter 7: Dhyana - Meditative Absorption\nChapter 8: Samadhi - Unified Consciousness\n\nPart III: The Dharana Lifestyle\nChapter 9: Morning Rituals for Mental Clarity\nChapter 10: The Art of Monotasking\nChapter 11: Digital Minimalism with Purpose\nChapter 12: Your Personal Dharana Practice"
    },
    {
      "id": "f4680c5a-3e6a-4b8e-9990-6406864d1ec7-page-1-2",
      "pageNumber": 2,
      "content": "Introduction: The Lost Art of Attention\n\n\"The faculty of voluntarily bringing back a wandering attention, over and over again, is the very root of judgment, character, and will.\" - William James, 1890\n\nSarah closed her laptop with a frustrated sigh. It was 11:47 PM, and she had spent the entire evening \"working\" on a presentation that should have taken two hours. Yet somehow, between email notifications, social media alerts, news updates, and the magnetic pull of her smartphone, those two hours had stretched into six unproductive ones filled with fragmented attention and mounting anxiety.\n\nShe wasn't alone. Sarah was experiencing what millions of people worldwide face daily: the complete erosion of our ability to sustain deep, meaningful focus. We live in an age where the average knowledge worker checks email every 11 minutes, where we touch our phones over 2,600 times per day, and where the mere presence of a smartphone—even when turned off—reduces our cognitive capacity by up to 10%.\n\nBut this isn't just about productivity. This is about the very essence of human flourishing.\n\nWhen we cannot focus, we cannot connect—with others, with our work, with ourselves, or with the deeper currents of meaning that make life worth living. We become strangers to our own minds, passengers in our own lives, constantly reacting rather than consciously creating.\n\nYet there is hope, and it lies not in the latest productivity app or life hack, but in an ancient practice that has been quietly transforming human consciousness for over 2,500 years: Dharana."
    }
  ]
