{
  "id": "3",
  "title": "Whispers of the Heart",
  "author": "Victoria Rosehaven",
  "cover": "/assets/book3-cover.jpg",
  "description": "A tale of forbidden love set against the backdrop of Victorian England.",
  "genre": "Mystery Thriller",
  "pages": [
    {
      "id": "page-3-1",
      "pageNumber": 1,
      "content": "Chapter 1: The Unexpected Encounter\n\nLondon, 1887. The gaslights flickered against the evening mist as Isabella Fairfax hurried through the cobblestone streets of Mayfair. Her emerald silk gown rustled with each quick step, and she pulled her velvet cloak tighter against the autumn chill.\n\nShe was late for the Pemberton ball, but that was the least of her concerns. The letter tucked safely in her reticule contained news that would change everything—news that could ruin her family's reputation if it fell into the wrong hands.\n\nAs she rounded the corner onto Grosvenor Square, she collided with a tall figure emerging from the shadows. Strong hands caught her shoulders, steadying her before she could fall.\n\n\"I beg your pardon, miss. Are you hurt?\"\n\nIsabella looked up into the most startling pair of grey eyes she had ever seen. The gentleman who had caught her was devastatingly handsome, with dark hair and aristocratic features, but there was something different about him—a wildness that suggested he didn't quite belong in London's refined society.\n\n\"I... no, I'm quite well, thank you,\" she managed, suddenly aware of how close they stood.\n\nHe released her shoulders but didn't step back. \"You seem distressed. Perhaps I might be of assistance?\"\n\nIsabella's heart raced, though whether from her earlier urgency or from this stranger's intense gaze, she couldn't say. \"That's very kind, but I really must be going.\"\n\n\"Of course.\" He stepped aside with a bow. \"Until we meet again, miss...?\"\n\nBut Isabella was already hurrying away, not daring to give her name to this compelling stranger who had somehow made her forget all about the dangerous letter and the Pemberton ball in the span of a single moment."
    },
    {
      "id": "page-3-2",
      "pageNumber": 2,
      "content": "Chapter 2: Secrets Revealed\n\nThe Pemberton ballroom glittered with crystal chandeliers and the jewels of London's finest society. Isabella moved through the crowd with practiced grace, nodding politely to acquaintances while her mind remained fixed on the mysterious gentleman from the street.\n\n\"Isabella, dear! There you are.\" Lady Pemberton swept toward her in a rustle of burgundy taffeta. \"I have someone I'm simply dying for you to meet.\"\n\nBefore Isabella could protest, she found herself being led across the ballroom toward a group of gentlemen near the orchestra. Her heart nearly stopped when she recognized the dark-haired stranger among them.\n\n\"Isabella Fairfax, may I present Lord Alexander Blackwood, Earl of Ravenshollow. He's just returned from his estates in Scotland.\"\n\nLord Blackwood's grey eyes met hers with unmistakable recognition and amusement. \"Miss Fairfax,\" he said, bowing formally. \"What a delightful surprise.\"\n\n\"My lord,\" Isabella managed, offering a curtsy while her cheeks burned with embarrassment.\n\n\"Alexander has the most fascinating stories of the Scottish Highlands,\" Lady Pemberton continued obliviously. \"Perhaps you might share a dance and he could tell you about them?\"\n\n\"I would be honored,\" Lord Blackwood said, offering his arm with a slight smile that suggested he was enjoying her discomfort far too much.\n\nAs he led her onto the dance floor for a waltz, Isabella realized that her encounter with this man had been no accident. The letter in her reticule suddenly felt heavier, and she wondered if Lord Alexander Blackwood might be connected to the secrets that could destroy her family.\n\nThe music began, and as he pulled her into his arms, Isabella knew her life would never be the same."
    }
  ],
  "languages": {
    "english": {
      "title": "Whispers of the Heart",
      "description": "A tale of forbidden love set against the backdrop of Victorian England.",
      "pages": [
        {
          "id": "page-3-1",
          "pageNumber": 1,
          "content": "Chapter 1: The Unexpected Encounter\n\nLondon, 1887. The gaslights flickered against the evening mist as Isabella Fairfax hurried through the cobblestone streets of Mayfair. Her emerald silk gown rustled with each quick step, and she pulled her velvet cloak tighter against the autumn chill.\n\nShe was late for the Pemberton ball, but that was the least of her concerns. The letter tucked safely in her reticule contained news that would change everything—news that could ruin her family's reputation if it fell into the wrong hands.\n\nAs she rounded the corner onto Grosvenor Square, she collided with a tall figure emerging from the shadows. Strong hands caught her shoulders, steadying her before she could fall.\n\n\"I beg your pardon, miss. Are you hurt?\"\n\nIsabella looked up into the most startling pair of grey eyes she had ever seen. The gentleman who had caught her was devastatingly handsome, with dark hair and aristocratic features, but there was something different about him—a wildness that suggested he didn't quite belong in London's refined society.\n\n\"I... no, I'm quite well, thank you,\" she managed, suddenly aware of how close they stood.\n\nHe released her shoulders but didn't step back. \"You seem distressed. Perhaps I might be of assistance?\"\n\nIsabella's heart raced, though whether from her earlier urgency or from this stranger's intense gaze, she couldn't say. \"That's very kind, but I really must be going.\"\n\n\"Of course.\" He stepped aside with a bow. \"Until we meet again, miss...?\"\n\nBut Isabella was already hurrying away, not daring to give her name to this compelling stranger who had somehow made her forget all about the dangerous letter and the Pemberton ball in the span of a single moment."
        },
        {
          "id": "page-3-2",
          "pageNumber": 2,
          "content": "Chapter 2: Secrets Revealed\n\nThe Pemberton ballroom glittered with crystal chandeliers and the jewels of London's finest society. Isabella moved through the crowd with practiced grace, nodding politely to acquaintances while her mind remained fixed on the mysterious gentleman from the street.\n\n\"Isabella, dear! There you are.\" Lady Pemberton swept toward her in a rustle of burgundy taffeta. \"I have someone I'm simply dying for you to meet.\"\n\nBefore Isabella could protest, she found herself being led across the ballroom toward a group of gentlemen near the orchestra. Her heart nearly stopped when she recognized the dark-haired stranger among them.\n\n\"Isabella Fairfax, may I present Lord Alexander Blackwood, Earl of Ravenshollow. He's just returned from his estates in Scotland.\"\n\nLord Blackwood's grey eyes met hers with unmistakable recognition and amusement. \"Miss Fairfax,\" he said, bowing formally. \"What a delightful surprise.\"\n\n\"My lord,\" Isabella managed, offering a curtsy while her cheeks burned with embarrassment.\n\n\"Alexander has the most fascinating stories of the Scottish Highlands,\" Lady Pemberton continued obliviously. \"Perhaps you might share a dance and he could tell you about them?\"\n\n\"I would be honored,\" Lord Blackwood said, offering his arm with a slight smile that suggested he was enjoying her discomfort far too much.\n\nAs he led her onto the dance floor for a waltz, Isabella realized that her encounter with this man had been no accident. The letter in her reticule suddenly felt heavier, and she wondered if Lord Alexander Blackwood might be connected to the secrets that could destroy her family.\n\nThe music began, and as he pulled her into his arms, Isabella knew her life would never be the same."
        }
      ]
    },
    "hindi": {
      "title": "दिल की फुसफुसाहट",
      "description": "विक्टोरियन इंग्लैंड की पृष्ठभूमि के खिलाफ निषिद्ध प्रेम की कहानी।",
      "pages": [
        {
          "id": "page-3-1-hi",
          "pageNumber": 1,
          "content": "अध्याय 1: अप्रत्याशित मुठभेड़\n\nलंदन, 1887। गैसलाइट्स शाम की धुंध के खिलाफ झिलमिलाईं जैसे इसाबेला फेयरफैक्स मेफेयर की कोब्ब्लस्टोन सड़कों से जल्दी से गुज़री। उसका पन्ना रेशम गाउन हर तेज़ कदम के साथ खड़खड़ाता था, और उसने अपने मखमली लबादे को शरद ऋतु की ठंड के खिलाफ कसकर खींचा।\n\nवह पेम्बर्टन गेंद के लिए देर से आई थी, लेकिन यह उसकी सबसे कम चिंता थी। उसके रेटिक्यूल में सुरक्षित रूप से बंद पत्र में समाचार था जो सब कुछ बदल देगा—समाचार जो उसके परिवार की प्रतिष्ठा बर्बाद कर सकता है यदि यह गलत हाथों में पड़ जाए।\n\nजैसे ही वह ग्रोसवेनर स्क्वायर के कोने को मोड़ती है, वह छाया से निकलने वाली एक लंबी आकृति से टकराई। मजबूत हाथों ने उसके कंधों को पकड़ा, उसे गिरने से पहले स्थिर किया।\n\n\"मैं क्षमा चाहता हूं, मिस। क्या आपको चोट लगी है?\"\n\nइसाबेला ने सबसे चौंकाने वाली जोड़ी धूसर आंखों में देखा जो उसने कभी देखी थी। जिस सज्जन ने उसे पकड़ा था वह विनाशकारी रूप से सुंदर था, काले बालों और कुलीन विशेषताओं के साथ, लेकिन उसके बारे में कुछ अलग था—एक जंगलीपन जो सुझाता था कि वह लंदन के परिष्कृत समाज में बिल्कुल फिट नहीं था।\n\n\"मैं... नहीं, मैं बिल्कुल ठीक हूं, धन्यवाद,\" वह अचानक इस बात से अवगत होकर कामयाब रही कि वे कितने करीब खड़े थे।\n\nउसने उसके कंधों को छोड़ दिया लेकिन पीछे नहीं हटा। \"आप परेशान लगते हैं। शायद मैं सहायता कर सकता हूं?\"\n\nइसाबेला का दिल दौड़ा, हालांकि यह उसकी पहले की तात्कालिकता से था या इस अजनबी की तीव्र नज़र से, वह नहीं कह सकती थी। \"यह बहुत दयालु है, लेकिन मुझे वास्तव में जाना होगा।\"\n\n\"बेशक।\" उसने एक धनुष के साथ एक तरफ कदम रखा। \"जब तक हम फिर से मिलते हैं, मिस...?\"\n\nलेकिन इसाबेला पहले से ही जल्दी में दूर जा रही थी, इस आकर्षक अजनबी को अपना नाम देने की हिम्मत नहीं कर रही थी जिसने किसी तरह उसे एक पल में खतरनाक पत्र और पेम्बर्टन गेंद के बारे में सब कुछ भुला दिया था।"
        },
        {
          "id": "page-3-2-hi",
          "pageNumber": 2,
          "content": "अध्याय 2: रहस्य प्रकट\n\nपेम्बर्टन बॉलरूम क्रिस्टल झूमर और लंदन के बेहतरीन समाज के रत्नों से चमक रहा था। इसाबेला अभ्यास की गई कृपा के साथ भीड़ के माध्यम से चली गई, परिचितों को विनम्रतापूर्वक सिर हिलाते हुए जबकि उसका मन सड़क के रहस्यमय सज्जन पर केंद्रित रहा।\n\n\"इसाबेला, प्रिय! वहाँ आप हैं।\" लेडी पेम्बर्टन बरगंडी तफ़्ता की एक झनझनाहट में उसकी ओर बढ़ी। \"मेरे पास कोई है जिससे मैं आपको मिलवाने के लिए बस मर रही हूं।\"\n\nIsabella ke protest se pehle, usne khud ko ballroom ke across orchestra ke paas gentlemen ke group ki taraf lead hote hue paya. Uska heart almost stop ho gaya jab usne unke beech dark-haired stranger ko recognize kiya.\n\n\"Isabella Fairfax, kya main aapko Lord Alexander Blackwood, Earl of Ravenshollow se milwa sakta hun. Woh abhi apni Scotland ki estates se return hua hai.\"\n\nLord Blackwood ki grey eyes unmistakable recognition aur amusement ke saath usse mili. \"Miss Fairfax,\" usne formally bow karte hue kaha. \"Kya delightful surprise hai.\"\n\n\"My lord,\" Isabella embarrassment se burning cheeks ke saath curtsy offer karte hue manage kar payi.\n\n\"Alexander ke paas Scottish Highlands ki most fascinating stories hain,\" Lady Pemberton obliviously continue kiya. \"Shayad aap ek dance share kar sakte hain aur woh aapko unke baare mein bata sakta hai?\"\n\n\"Mujhe honored hona hoga,\" Lord Blackwood ne slight smile ke saath apna arm offer karte hue kaha jo suggest karti thi ki woh uski discomfort ka far too much enjoy kar raha tha.\n\nJaise hi woh use waltz ke liye dance floor pe lead kiya, Isabella ko realize hua ki is man ke saath uski encounter koi accident nahi thi. Uske reticule mein letter suddenly heavier feel hui, aur usne wonder kiya ki kya Lord Alexander Blackwood un secrets se connected ho sakta hai jo uske family ko destroy kar sakte hain.\n\nMusic begin hua, aur jaise hi usne use apni arms mein pull kiya, Isabella jaanti thi ki uski life kabhi same nahi hogi."
        }
      ]
    },
    "hinglish": {
      "title": "Dil Ki Whispers",
      "description": "Victorian England ki backdrop ke against forbidden love ki tale.",
      "pages": [
        {
          "id": "page-3-1-hn",
          "pageNumber": 1,
          "content": "Chapter 1: Unexpected Mulakat\n\nLondon, 1887. Gaslights evening mist ke against flicker kar rahi thi jaise Isabella Fairfax Mayfair ki cobblestone streets se hurry kar rahi thi. Uska emerald silk gown har quick step ke saath rustle kar raha tha, aur usne apne velvet cloak ko autumn chill ke against tighter pull kiya.\n\nWoh Pemberton ball ke liye late thi, lekin yeh uski least concerns mein se tha. Uske reticule mein safely tucked letter mein news thi jo sab kuch change kar degi—news jo uske family ki reputation ruin kar sakti hai agar yeh wrong hands mein fall ho jaye.\n\nJaise hi woh Grosvenor Square pe corner round karti hai, woh shadows se emerge hone wali ek tall figure se collide ho gayi. Strong hands ne uske shoulders catch kiye, use fall karne se pehle steady kiya.\n\n\"Main maafi chahta hun, miss. Kya aapko hurt hua hai?\"\n\nIsabella ne sabse startling pair of grey eyes mein dekha jo usne kabhi dekhi thi. Jo gentleman ne use catch kiya tha woh devastatingly handsome tha, dark hair aur aristocratic features ke saath, lekin uske baare mein kuch different tha—ek wildness jo suggest karti thi ki woh London ki refined society mein bilkul belong nahi karta.\n\n\"Main... nahi, main bilkul well hun, thank you,\" woh manage kar payi, suddenly aware hokr ki woh kitne close khade the.\n\nUsne uske shoulders release kiye lekin back nahi step kiya. \"Aap distressed lagti hain. Shayad main assistance kar sakta hun?\"\n\nIsabella ka heart race kiya, though yeh uski earlier urgency se tha ya is stranger ki intense gaze se, woh nahi keh sakti thi. \"Yeh bahut kind hai, lekin mujhe really jana hoga.\"\n\n\"Of course.\" Usne ek bow ke saath aside step kiya. \"Jab tak hum phir se milte hain, miss...?\"\n\nLekin Isabella pehle se hi hurry mein away ja rahi thi, is compelling stranger ko apna naam dene ki dare nahi kar rahi thi jisne somehow use single moment mein dangerous letter aur Pemberton ball ke baare mein sab kuch bhula diya tha."
        },
        {
          "id": "page-3-2-hn",
          "pageNumber": 2,
          "content": "Chapter 2: Secrets Reveal\n\nPemberton ballroom crystal chandeliers aur London ke finest society ke jewels ke saath glitter kar raha tha. Isabella practiced grace ke saath crowd ke through move kar rahi thi, acquaintances ko politely nod karte hue jabki uska mind street ke mysterious gentleman pe fixed raha.\n\n\"Isabella, dear! Wahan aap hain.\" Lady Pemberton burgundy taffeta ki rustle mein uski taraf sweep hui. \"Mere paas koi hai jisse main aapko milwane ke liye simply dying hun.\"\n\nIsabella ke protest se pehle, usne khud ko ballroom ke across orchestra ke paas gentlemen ke group ki taraf lead hote hue paya. Uska heart almost stop ho gaya jab usne unke beech dark-haired stranger ko recognize kiya.\n\n\"Isabella Fairfax, kya main aapko Lord Alexander Blackwood, Earl of Ravenshollow se milwa sakta hun. Woh abhi apni Scotland ki estates se return hua hai.\"\n\nLord Blackwood ki grey eyes unmistakable recognition aur amusement ke saath usse mili. \"Miss Fairfax,\" usne formally bow karte hue kaha. \"Kya delightful surprise hai.\"\n\n\"My lord,\" Isabella embarrassment se burning cheeks ke saath curtsy offer karte hue manage kar payi.\n\n\"Alexander ke paas Scottish Highlands ki most fascinating stories hain,\" Lady Pemberton obliviously continue kiya. \"Shayad aap ek dance share kar sakte hain aur woh aapko unke baare mein bata sakta hai?\"\n\n\"Mujhe honored hona hoga,\" Lord Blackwood ne slight smile ke saath apna arm offer karte hue kaha jo suggest karti thi ki woh uski discomfort ka far too much enjoy kar raha tha.\n\nJaise hi woh use waltz ke liye dance floor pe lead kiya, Isabella ko realize hua ki is man ke saath uski encounter koi accident nahi thi. Uske reticule mein letter suddenly heavier feel hui, aur usne wonder kiya ki kya Lord Alexander Blackwood un secrets se connected ho sakta hai jo uske family ko destroy kar sakte hain.\n\nMusic begin hua, aur jaise hi usne use apni arms mein pull kiya, Isabella jaanti thi ki uski life kabhi same nahi hogi."
        }
      ]
    }
  }
}
