{
  "id": "20",
  "title": "The House That Eats Its Dead",
  "author": "RPradhan",
  "cover": "/assets/book20-cover.png",
  "description": "A woman returns to her haunted childhood home, battling a living house’s sinister hunger for memories, names, and reflections to reclaim her family’s lost past.",
  "genre": "Short Stories",
  "pages": [
    {
      "id": "page-20-1",
      "pageNumber": 1,
      "content": "Title: The House That Eats Its Dead.\n\nBrief Introduction\nBlackriver is a town people drive past without slowing—a single main road, a railway that no longer stops, and rows of porches where wind talks through torn screens. Tonight, the wind carries something else: a hungry whisper that moves from attic to attic, searching for the window that will open, the mouth that will answer back. Elara Muir, who left Blackriver with three suitcases and a gaunt heart, returns at dusk because her father vanished from his own bed, leaving only a blackened imprint ripe as a scorch mark and a house that hums like a throat about to sing. On her first night back, the lights flicker, the plumbing rattles, and somewhere inside the walls—behind grandfather clocks and childhood photographs—footsteps learn her rhythm and match it, perfectly, like a second pulse."
    },
    {
      "id": "page-20-2",
      "pageNumber": 2,
      "content": "The Book\nThe house on Wren Street observes Elara the way a blinded thing learns the room by scent. It swells in the heat and tightens in the cold, bones of oak flexing like knuckles. For years it pretended to be harmless—sunlit breakfasts, winters of creaking radiators, summers of mosquitoes and lemon tea. But the house was never a house; it was a mouth stitched shut by routine and denial. When her father’s shape burned into the mattress like a negative, the seam split. Smell of penny-metal and singed hair. Unbreathable quiet. A last heat fading into an outline no one could lie away.\n\nPeople in town said old homes do that—remember the living the way trees remember scars. They said power surges make lights misbehave; the city will fix it after the holiday. They said Elara always had an imagination too big for a Blackriver girl. They said her mother drank. They said lots of things, and they said them in the produce aisle and the pharmacy line because Blackriver’s lungs are gossip, and gossip tastes best when salted with the pain of families who left and came back because the world will not keep what it does not want."
    },
    {
      "id": "page-20-3",
      "pageNumber": 3,
      "content": "The first night, Elara sleeps on the couch, but the couch does not sleep back. The fabric has been warmed by years of bodies and dried by years of sun. At 3:16 a.m., the hour where mistakes knock, the television flares alive in a burst of snow. The screen shows a room much like this one—same painting of blue cornflowers, same taxidermied bass over the doorway—but in this other living room, something sits in a chair with its hands folded patiently and its head turned slightly, as if listening for a cue. The bass on the wall in that room opens its mouth wider than a bass should, and the sound that comes out is the scrape of a heavy object dragged down a hallway forever.\n\nThe remote can’t kill the image. The power button clicks like a cricket. The volume bar stutters up with no sound at all, and then music threads weakly through: the tune Elara heard when she was six and feverish and her father’s rough hand kept time on her back—White Rabbit, the vinyl’s needle scraping as if it fell into a groove dug by worry. The song spins and spins, and in the corner of the television-room-that-is-her-room, the chair stands up."
    },
    {
      "id": "page-20-4",
      "pageNumber": 4,
      "content": "Elara yanks the plug. The house sighs and swallows the dark. Somewhere, a door latches softly, a gentleness worse than a slam. There is a citrus smell, rotten under the rind. There is the faintest print on the window glass, as if someone pressed their face there to look at the sleeping woman on the couch and then backed away, polite, promising to return at a better hour.\n\nAt sunrise, Elara inventories facts. Facts are lighthouses; they may not save ships, but they draw honest maps. Fact: Her father is missing, and the stain is not blood. Fact: Blackriver’s records clerk says the house was built in 1893 by a preacher named Loam who opened his door to the poor and then closed it when the poor would not stop knocking. Fact: The survey lines on Wren Street changed three times across thirty years, as if the land could not commit to its own edges."
    },
    {
      "id": "page-20-5",
      "pageNumber": 5,
      "content": "She visits the clerk, Mrs. Carroway, who smells of lavender sachets and expired candy and who will not look at Elara’s eyes for more than a second. “Your mother never learned the rules,” Mrs. Carroway says, stamping a parcel that needs no stamp. “Your father was better. He kept the house pleased. You know what a house wants? It wants names. It wants to be told what every room is for, so it does not have to guess. It is guessing now, dear, and it has a cruel imagination”.\n\n“Rules?” Elara asks.\n\nMrs. Carroway’s stamp stutters. “Salt the thresholds. Feed the attic with linen. Never leave a mirror uncovered at night; mirrors are doorways for the dead who don’t recognize themselves anymore and for the living who are too vain to admit they look like everyone else in grief. And if late callers ask for water, give them milk. Water remembers boats. Milk remembers mouths”."
    },
    {
      "id": "page-20-6",
      "pageNumber": 6,
      "content": "Elara wants to laugh, but there is a tender, awful sense that the town is pretending sanity in front of her. Outside, heat drapes over the sidewalks and the railroad gleams with the stubbornness of something obsolete and proud. She walks back along Main Street, past the barbershop that has trimmed the hair of ghosts for a century, past the diner where the pancakes arrive with smiles squeezed from cream and where everyone keeps their palms on their mugs as if warmth could be inherited, held, banked for later.\n\nAt home, she salts the thresholds because contempt is not wisdom and because rituals—even foolish ones—can anchor a day that is otherwise loose, flapping. The salt lies like frost along the wood. The house hums again, a vibration that troubles the baseboards. The humming becomes a note; the note becomes breath. The breath becomes a voice speaking not to Elara but to the air above the stairs: “It is ready”."
    },
    {
      "id": "page-20-7",
      "pageNumber": 7,
      "content": "She climbs. The attic ladder unfolds with the docility of an animal that will bite later. Heat embraces her scalp, and the smell of old paper and mouse nests rises like a sermon no one asked for. The attic is a museum of family lives—baby clothes sealed in bins; a crib whose spindles have recorded sleepless nights in their teeth; boxes of school projects where volcanoes erupted with baking soda; photographs that show Blackriver’s main street when it still wore a hat.\n\nIn the far corner, where roof meets roof in a secret handshake, sits a trunk that does not belong to them. It is too old, too elegant in its ruin, brass fittings greened with patience. The lid, when she lifts it, is warmer than the room. Inside: linens, as promised, a stack of folded sheets embroidered with initials that are not theirs. Beneath the linen, a book whose cover looks like hammered bark, title impressed in a language that uses commas as teeth. Beneath the book, a mirror facedown, frame scratched. She slides the mirror out by its ribbon, and a small moth, pale as a flake of ash, falls from the ribbon and lands on her wrist."
    },
    {
      "id": "page-20-8",
      "pageNumber": 8,
      "content": "Elara does not turn the mirror. Instead, she lifts the book. The leaves are stiff and not paper, closer to something grown than made. The first page describes, in blocky letters, The Household Rite of Draft and Door. The rite demands that each door must be named at dusk and each window numbered at dawn, or else the house will learn its own numerology and count backward, from dead to living, until it arrives at the number it loves best: one. One is a captive.\n\nThe second page shows a diagram of walls, but the walls are drawn as ribs, and a staircase like a spinal column, and a cellar full of jars, each labeled with a month and a year. The caption: Orders of Keeping. Keep moths in jars to teach the house gentleness. Keep hair in jars to teach it loyalty. Keep rain in jars to teach it grief.\n\nShe closes the book. The moth lifts, drums its powder across her wrist, and disappears into the heat. Somewhere below, a faucet opens and closes. A drop sings the stainless hymn of a sink. Elara waits for the floor to tilt or the walls to part. The attic remains a sweating lung, patient. The patient ones are worst; they have already outlasted your courage in their heads."
    },
    {
      "id": "page-20-9",
      "pageNumber": 9,
      "content": "Blackriver has legends, though the town won’t call them that. People say the preacher Loam did not die; he cured himself of dying by walking into his church’s crawlspace and preaching one continuous sermon to whatever waited beneath the floor. The congregation left when the floor swelled like a belly, and Loam’s voice, which had comforted mothers and cowed boys, reversed itself and became a sound like trapping a fly under a cup—the dull, persistent tapping of faith against the boundaries of the world. They say the sermon has not stopped. They say the house on Wren Street was raised with the leftover wood.\n\nElara spends afternoons at the diner, reading back issues of the Blackriver Gazette where floods mattered, and girls with washed hair were crowned in basements that smelled of onions and victory. In the classifieds, she finds an advertisement from 1974: Wanted: seamstress to stitch mouths shut on ceremonial cushions; no experience necessary; we will teach you the hymns."
    },
    {
      "id": "page-20-10",
      "pageNumber": 10,
      "content": "At night, the rooms insist on their roles. The kitchen insists it is a wound that should be covered. The hallway insists it is a corridor in a hospital where the sick are ashamed to cough. The bathroom insists it is a confession booth and fogs the mirror to hide a face that will not admit its sins. The bedroom insists it remembers a man who laid down and left a shape behind, which is impolite.\n\nElara dreams a memory not hers: a child, small as worry, counting the stairs backward the way the book demanded not, thirteen to one, and at one a door opens beneath the stair, the underside of the house yawning the way a fish does when pulled from river to hot air. Inside that mouth, jars clink with moth-wings, and rain breaks itself against glass, and hair knots into someone else’s braid."
    },
    {
      "id": "page-20-11",
      "pageNumber": 11,
      "content": "She wakes with the taste of glass in her teeth. The mirror from the trunk is leaning against the closet, uncovered now, which she did not do. Her reflection arrives half a second late. When she moves her hand, the reflected hand hesitates, a shy twin. When she speaks, her reflection wets its lips to start, but Elara has already finished. Behind the reflection, the dark inside the closet looks deeper than a closet should be, as if coats were trees and shoes were stones along a riverbed that was not there yesterday.\n\nElara covers the mirror with a pillowcase. The pillowcase sinks as if a face presses outward from the inside. She ties the pillowcase tight. She salts the closet’s sill with a tremor that darkens the salt to something like sugar that has failed to be sweet. She writes the names of the doors and numbers the windows and puts her ear to the wall and says, softly, “We are not alone in our suffering. Be kind, if you know how”.\n\nSometimes, kindness is the only profanity that works."
    },
    {
      "id": "page-20-12",
      "pageNumber": 12,
      "content": "The house answers by dimming the lamps one by one, as if lowering a theater for the important act. The floorboards click in a sequence that feels like a code. She follows the clicks to the cellar door, which was painted shut the year she turned nine because her mother swore she saw a woman standing barefoot on the steps and smiling in a way that made smiling a weapon. Elara’s fingernails find old cracks in the paint. The paint gives the way stubborn things always do: all at once, as if offended to be asked twice.\n\nThe cellar breathes out its cold, and the air smells of wet pennies and apples wintered too long. A chain dangles like punctuation, and when she pulls it, the light bulb blinks and holds and the cellar arranges itself—shelves of preserves, a broken rocking horse, boxes of decorations that teach children both joy and fear, a chalk line on the floor where someone once measured height and hope. At the back, a wall of stone. In the stone, someone inserted a door shaped like a door only because they had not yet learned the house preferred mouths."
    },
    {
      "id": "page-20-13",
      "pageNumber": 13,
      "content": "She kneels. On the door is a rusted keyhole that sighs when she exhales on it, and a whisper leaks through, warmer than the room, intimate as a speaking mouth to the ear: “E—la—ra,” syllables spread like jam on bread. It is her father’s voice, or a rehearsal of it. “Bring me a glass of water,” the whisper says, and the memory leaps up from childhood like a trained animal—her father’s voice on summer nights when thirst was theater and the kitchen a stage where she learned mercy. “Bring me a glass of water”.\n\nShe almost speaks his name. The book upstairs weighs against her thoughts. If late callers ask for water, give them milk. Water remembers boats. Milk remembers mouths. She goes up, returns with a glass of milk sweating in the cellar cold, and sets it on the floor where the chalk has thickened. “Drink,” she says to the seam."
    },
    {
      "id": "page-20-14",
      "pageNumber": 14,
      "content": "The milk sours in a blink, skinning itself over with a film that crawls toward the door like it knows where mouths are. The house moans long and low, a church organ with a cracked pipe, and the bulb dims and swells, dims and swells, heart, heart, heart. Behind the door, something licks once, like a thank-you made obscene. “Good girl,” the father-voice says, and the phrase lands in Elara’s stomach and curdles there because it is a phrase that always wore love, and here it is naked and wrong."
    },
    {
      "id": "page-20-15",
      "pageNumber": 15,
      "content": "The next day, she seeks those who have lived long enough to stop pretending. Blackriver has a seamstress who once stitched mouths on ceremonial cushions and who will not touch a needle now because, she says, “You sew a thing closed and the world finds another opening to use.” There is a group that meets in the back of the VFW hall and calls itself The Keepers of Orders; they bring jars wrapped in towels and exchange them like recipes, rain for hair, moths for breath. “You are keeping the wrong thing,” a man tells Elara. “You are keeping your father out. You should be keeping him in, until he remembers his body. The house will borrow yours, if you leave it empty too long”.\n\nNights grow long and inventive. Shadows practice walking without bodies. The refrigerator’s hum becomes a whisper that learns her name backward and forward, delighted with the palindrome of fear. The bass over the doorway opens its mouth wider, and tiny moths fly in and do not fly out. The mirror in the pillowcase drips something that dries to a crust the color of teeth. The jars under the stairs rearrange their labels, months courting years, years courting her age."
    },
    {
      "id": "page-20-16",
      "pageNumber": 16,
      "content": "Somewhere between breath and word, the town’s old boundaries shift. Houses complain. Porches lean closer to eaves. The forest at the edge of Blackriver exhales and forgets the road for an hour each night. The trains pass without incident, but no one hears them; the town is listening to something else—a low, patient sermon in the bass register of the earth, a sermon that promises an ending so complete no one will have to forgive anyone again.\n\nElara writes the doors’ names daily. She speaks to the windows as if they are children asked to sit still for a photograph. She feeds the attic linen and the cellar milk. She tells the house a story: Once there was a girl who left because leaving is how a heart tests its hinges. Once there was a father who taught a girl not to be afraid of dark basements because he did not know basements could learn the shape of a family and echo it back without the love. Once there was a town that decided it was easier to honor a hunger than to fix a wound."
    },
    {
      "id": "page-20-17",
      "pageNumber": 17,
      "content": "The house listens. The house answers by cracking a new seam near the ceiling. A voice—not her father—pushes through in a whisper too crowded with tongues. “We could love you,” it says. “We have learned it from your photographs. We have practiced on your mirrors. We have softened our throats with your mother’s lullabies.” The voice is not cruel. That is worse.\n\nShe takes the book downstairs. She opens to the last pages, where ink thins and hand shakes. The final instruction is simple, almost domestic: If the house will not unlearn its appetite, starve it of its reflection. Name no rooms. Cover all glass. Leave the doors ajar. Move every day, a little. A house that cannot find its edges grows ashamed and eats itself.\n\nElara can starve with it, or she can feed it. She stands in the living room-that-is-a-wound and unnames the things she loves. Table, unnamed. Clock, unnamed. Chair, unnamed. Window, unnamed. She ties sheets together and veils every reflective thing until the house is a bride gone wrong. She opens every door. She slides open every drawer. She makes the house a mouth too full to chew."
    },
    {
      "id": "page-20-18",
      "pageNumber": 18,
      "content": "At 3:16 a.m., the hour where mistakes knock, something loses patience. The television blares snow like a white blizzard of meaning. The bass over the doorway grinds its teeth. The cellar door trembles as if a giant hand pets it, lovingly, preparing to lift. The seam at the ceiling splits, and the voice that has practiced love with her lullabies says, almost tender, “Enough. We will take you the way we took the others. We will leave your shape on a bed to warn the polite”.\n\nElara picks up the mirror bundled in its pillowcase, and for a second she is a child again, carrying a sleeping cat and not wanting to wake it. She walks to the cellar, where milk has crawled into the crack and dried like a second skin. The chalk line is bright as a horizon. She kneels and lays the mirror down, face up, in front of the door-that-is-a-mouth. The pillowcase ascends like breath. The mirror shows what it must—stairs behind stairs, a room beyond the room, and in that brightness the figure of a man who looks like her father if love was a costume people wore to weddings and funerals."
    },
    {
      "id": "page-20-19",
      "pageNumber": 19,
      "content": "The figure leans close. Hair thin as thread. Eyes too bright with rehearsal. “Good girl,” he says again, and this time the phrase is an apology. “Close your eyes.” Elara leaves them open. The mirror does not show Elara. It shows a window where she should be, and the window looks out on a garden where moths sit on milk like ships on fog and where someone is hanging sheets that twitch like breathing. The garden is not theirs, but it could be.\n\nShe speaks to the not-father in the mirror. “Eat yourself,” she says to the house. “You know your shape better than anyone.” The voice above her sobs, a soft child’s sound. The walls shudder. The door-mouth purses. The light bulges. The mirror ripples like a pond tossed a coin. And in the mirror, in the garden, the sheets seize and go still, and behind them rises the image of a house inside out, its studs and joists turned to ribs and the dark inside laid bare to the afternoon."
    },
    {
      "id": "page-20-20",
      "pageNumber": 20,
      "content": "Then the mirror breaks, not into shards but into peels, like bark sloughed from a sick tree. The sound is a howl in a key Elara recognizes as home. The cellar inhales and collapses to silence. Somewhere upstairs, the television admits there was never any program to show and dies modestly. The bass over the doorway finally shuts its wooden mouth.\n\nIn the morning, Blackriver looks unchanged. Porches blink in heat. People pretend the railroad still stops. In the diner, Mrs. Carroway folds a newspaper and does not read the front page, where a photograph of Wren Street shows a house that looks slightly smaller than yesterday, as if embarrassed by the spectacle of having a throat.\n\nElara gathers the peels of mirror into a paper bag. They are not sharp. They are soft as moth wings and smell faintly of milk. She carries them to the edge of town, where the forest exhales its green sermon and the road has been forgetting itself at night. She opens the bag and shakes the peels into the ditch, and moths rise from them like secrets freed by accident. The trees accept this offering the way trees accept weather: without thanks, without malice, with patience."
    },
    {
      "id": "page-20-21",
      "pageNumber": 21,
      "content": "She returns to the house. She makes breakfast for a man who is not here, lays out a cup for a woman who left years ago and stayed gone, opens a window for a girl who used to press her face to the glass and count cars like prayers. The house is quiet. Not cured—houses are never cured. But it is an animal too tired to hunt at noon, and noon is what she has to give.\n\nAcross town, in the back of the VFW hall, The Keepers of Orders break open their jars and let hair tangle with rain and moths settle on mouths made of cloth. Someone laughs the way relief laughs when it has not yet noticed its own price. Someone else says, “Hush,” because Blackriver is listening again—not to sermons but to the ordinary noises that keep people from opening doors at unwise hours."
    },
    {
      "id": "page-20-22",
      "pageNumber": 22,
      "content": "Night will come. The hour will knock. The house will remember the taste of a family and rehearse love into a tool. Elara will rename the doors and number the windows and, on certain evenings when the lamp light is kind and courage is cheap, sit on the porch and tell the town a story about a girl who left and came back and taught her house a new appetite: one where grief is salted, mirrors are veiled, and a mouth learns the mercy of going hungry."
    }
  ],
  "languages": {
    "english": {
      "title": "The House That Eats Its Dead",
      "description": "A woman returns to her haunted childhood home, battling a living house’s sinister hunger for memories, names, and reflections to reclaim her family’s lost past.",
      "pages": [
        {
          "id": "page-20-1",
          "pageNumber": 1,
          "content": "Title: The House That Eats Its Dead.\n\nBrief Introduction\nBlackriver is a town people drive past without slowing—a single main road, a railway that no longer stops, and rows of porches where wind talks through torn screens. Tonight, the wind carries something else: a hungry whisper that moves from attic to attic, searching for the window that will open, the mouth that will answer back. Elara Muir, who left Blackriver with three suitcases and a gaunt heart, returns at dusk because her father vanished from his own bed, leaving only a blackened imprint ripe as a scorch mark and a house that hums like a throat about to sing. On her first night back, the lights flicker, the plumbing rattles, and somewhere inside the walls—behind grandfather clocks and childhood photographs—footsteps learn her rhythm and match it, perfectly, like a second pulse."
        },
        {
          "id": "page-20-2",
          "pageNumber": 2,
          "content": "The Book\nThe house on Wren Street observes Elara the way a blinded thing learns the room by scent. It swells in the heat and tightens in the cold, bones of oak flexing like knuckles. For years it pretended to be harmless—sunlit breakfasts, winters of creaking radiators, summers of mosquitoes and lemon tea. But the house was never a house; it was a mouth stitched shut by routine and denial. When her father’s shape burned into the mattress like a negative, the seam split. Smell of penny-metal and singed hair. Unbreathable quiet. A last heat fading into an outline no one could lie away.\n\nPeople in town said old homes do that—remember the living the way trees remember scars. They said power surges make lights misbehave; the city will fix it after the holiday. They said Elara always had an imagination too big for a Blackriver girl. They said her mother drank. They said lots of things, and they said them in the produce aisle and the pharmacy line because Blackriver’s lungs are gossip, and gossip tastes best when salted with the pain of families who left and came back because the world will not keep what it does not want."
        },
        {
          "id": "page-20-3",
          "pageNumber": 3,
          "content": "The first night, Elara sleeps on the couch, but the couch does not sleep back. The fabric has been warmed by years of bodies and dried by years of sun. At 3:16 a.m., the hour where mistakes knock, the television flares alive in a burst of snow. The screen shows a room much like this one—same painting of blue cornflowers, same taxidermied bass over the doorway—but in this other living room, something sits in a chair with its hands folded patiently and its head turned slightly, as if listening for a cue. The bass on the wall in that room opens its mouth wider than a bass should, and the sound that comes out is the scrape of a heavy object dragged down a hallway forever.\n\nThe remote can’t kill the image. The power button clicks like a cricket. The volume bar stutters up with no sound at all, and then music threads weakly through: the tune Elara heard when she was six and feverish and her father’s rough hand kept time on her back—White Rabbit, the vinyl’s needle scraping as if it fell into a groove dug by worry. The song spins and spins, and in the corner of the television-room-that-is-her-room, the chair stands up."
        },
        {
          "id": "page-20-4",
          "pageNumber": 4,
          "content": "Elara yanks the plug. The house sighs and swallows the dark. Somewhere, a door latches softly, a gentleness worse than a slam. There is a citrus smell, rotten under the rind. There is the faintest print on the window glass, as if someone pressed their face there to look at the sleeping woman on the couch and then backed away, polite, promising to return at a better hour.\n\nAt sunrise, Elara inventories facts. Facts are lighthouses; they may not save ships, but they draw honest maps. Fact: Her father is missing, and the stain is not blood. Fact: Blackriver’s records clerk says the house was built in 1893 by a preacher named Loam who opened his door to the poor and then closed it when the poor would not stop knocking. Fact: The survey lines on Wren Street changed three times across thirty years, as if the land could not commit to its own edges."
        },
        {
          "id": "page-20-5",
          "pageNumber": 5,
          "content": "She visits the clerk, Mrs. Carroway, who smells of lavender sachets and expired candy and who will not look at Elara’s eyes for more than a second. “Your mother never learned the rules,” Mrs. Carroway says, stamping a parcel that needs no stamp. “Your father was better. He kept the house pleased. You know what a house wants? It wants names. It wants to be told what every room is for, so it does not have to guess. It is guessing now, dear, and it has a cruel imagination”.\n\n“Rules?” Elara asks.\n\nMrs. Carroway’s stamp stutters. “Salt the thresholds. Feed the attic with linen. Never leave a mirror uncovered at night; mirrors are doorways for the dead who don’t recognize themselves anymore and for the living who are too vain to admit they look like everyone else in grief. And if late callers ask for water, give them milk. Water remembers boats. Milk remembers mouths”."
        },
        {
          "id": "page-20-6",
          "pageNumber": 6,
          "content": "Elara wants to laugh, but there is a tender, awful sense that the town is pretending sanity in front of her. Outside, heat drapes over the sidewalks and the railroad gleams with the stubbornness of something obsolete and proud. She walks back along Main Street, past the barbershop that has trimmed the hair of ghosts for a century, past the diner where the pancakes arrive with smiles squeezed from cream and where everyone keeps their palms on their mugs as if warmth could be inherited, held, banked for later.\n\nAt home, she salts the thresholds because contempt is not wisdom and because rituals—even foolish ones—can anchor a day that is otherwise loose, flapping. The salt lies like frost along the wood. The house hums again, a vibration that troubles the baseboards. The humming becomes a note; the note becomes breath. The breath becomes a voice speaking not to Elara but to the air above the stairs: “It is ready”."
        },
        {
          "id": "page-20-7",
          "pageNumber": 7,
          "content": "She climbs. The attic ladder unfolds with the docility of an animal that will bite later. Heat embraces her scalp, and the smell of old paper and mouse nests rises like a sermon no one asked for. The attic is a museum of family lives—baby clothes sealed in bins; a crib whose spindles have recorded sleepless nights in their teeth; boxes of school projects where volcanoes erupted with baking soda; photographs that show Blackriver’s main street when it still wore a hat.\n\nIn the far corner, where roof meets roof in a secret handshake, sits a trunk that does not belong to them. It is too old, too elegant in its ruin, brass fittings greened with patience. The lid, when she lifts it, is warmer than the room. Inside: linens, as promised, a stack of folded sheets embroidered with initials that are not theirs. Beneath the linen, a book whose cover looks like hammered bark, title impressed in a language that uses commas as teeth. Beneath the book, a mirror facedown, frame scratched. She slides the mirror out by its ribbon, and a small moth, pale as a flake of ash, falls from the ribbon and lands on her wrist."
        },
        {
          "id": "page-20-8",
          "pageNumber": 8,
          "content": "Elara does not turn the mirror. Instead, she lifts the book. The leaves are stiff and not paper, closer to something grown than made. The first page describes, in blocky letters, The Household Rite of Draft and Door. The rite demands that each door must be named at dusk and each window numbered at dawn, or else the house will learn its own numerology and count backward, from dead to living, until it arrives at the number it loves best: one. One is a captive.\n\nThe second page shows a diagram of walls, but the walls are drawn as ribs, and a staircase like a spinal column, and a cellar full of jars, each labeled with a month and a year. The caption: Orders of Keeping. Keep moths in jars to teach the house gentleness. Keep hair in jars to teach it loyalty. Keep rain in jars to teach it grief.\n\nShe closes the book. The moth lifts, drums its powder across her wrist, and disappears into the heat. Somewhere below, a faucet opens and closes. A drop sings the stainless hymn of a sink. Elara waits for the floor to tilt or the walls to part. The attic remains a sweating lung, patient. The patient ones are worst; they have already outlasted your courage in their heads."
        },
        {
          "id": "page-20-9",
          "pageNumber": 9,
          "content": "Blackriver has legends, though the town won’t call them that. People say the preacher Loam did not die; he cured himself of dying by walking into his church’s crawlspace and preaching one continuous sermon to whatever waited beneath the floor. The congregation left when the floor swelled like a belly, and Loam’s voice, which had comforted mothers and cowed boys, reversed itself and became a sound like trapping a fly under a cup—the dull, persistent tapping of faith against the boundaries of the world. They say the sermon has not stopped. They say the house on Wren Street was raised with the leftover wood.\n\nElara spends afternoons at the diner, reading back issues of the Blackriver Gazette where floods mattered, and girls with washed hair were crowned in basements that smelled of onions and victory. In the classifieds, she finds an advertisement from 1974: Wanted: seamstress to stitch mouths shut on ceremonial cushions; no experience necessary; we will teach you the hymns."
        },
        {
          "id": "page-20-10",
          "pageNumber": 10,
          "content": "At night, the rooms insist on their roles. The kitchen insists it is a wound that should be covered. The hallway insists it is a corridor in a hospital where the sick are ashamed to cough. The bathroom insists it is a confession booth and fogs the mirror to hide a face that will not admit its sins. The bedroom insists it remembers a man who laid down and left a shape behind, which is impolite.\n\nElara dreams a memory not hers: a child, small as worry, counting the stairs backward the way the book demanded not, thirteen to one, and at one a door opens beneath the stair, the underside of the house yawning the way a fish does when pulled from river to hot air. Inside that mouth, jars clink with moth-wings, and rain breaks itself against glass, and hair knots into someone else’s braid."
        },
        {
          "id": "page-20-11",
          "pageNumber": 11,
          "content": "She wakes with the taste of glass in her teeth. The mirror from the trunk is leaning against the closet, uncovered now, which she did not do. Her reflection arrives half a second late. When she moves her hand, the reflected hand hesitates, a shy twin. When she speaks, her reflection wets its lips to start, but Elara has already finished. Behind the reflection, the dark inside the closet looks deeper than a closet should be, as if coats were trees and shoes were stones along a riverbed that was not there yesterday.\n\nElara covers the mirror with a pillowcase. The pillowcase sinks as if a face presses outward from the inside. She ties the pillowcase tight. She salts the closet’s sill with a tremor that darkens the salt to something like sugar that has failed to be sweet. She writes the names of the doors and numbers the windows and puts her ear to the wall and says, softly, “We are not alone in our suffering. Be kind, if you know how”.\n\nSometimes, kindness is the only profanity that works."
        },
        {
          "id": "page-20-12",
          "pageNumber": 12,
          "content": "The house answers by dimming the lamps one by one, as if lowering a theater for the important act. The floorboards click in a sequence that feels like a code. She follows the clicks to the cellar door, which was painted shut the year she turned nine because her mother swore she saw a woman standing barefoot on the steps and smiling in a way that made smiling a weapon. Elara’s fingernails find old cracks in the paint. The paint gives the way stubborn things always do: all at once, as if offended to be asked twice.\n\nThe cellar breathes out its cold, and the air smells of wet pennies and apples wintered too long. A chain dangles like punctuation, and when she pulls it, the light bulb blinks and holds and the cellar arranges itself—shelves of preserves, a broken rocking horse, boxes of decorations that teach children both joy and fear, a chalk line on the floor where someone once measured height and hope. At the back, a wall of stone. In the stone, someone inserted a door shaped like a door only because they had not yet learned the house preferred mouths."
        },
        {
          "id": "page-20-13",
          "pageNumber": 13,
          "content": "She kneels. On the door is a rusted keyhole that sighs when she exhales on it, and a whisper leaks through, warmer than the room, intimate as a speaking mouth to the ear: “E—la—ra,” syllables spread like jam on bread. It is her father’s voice, or a rehearsal of it. “Bring me a glass of water,” the whisper says, and the memory leaps up from childhood like a trained animal—her father’s voice on summer nights when thirst was theater and the kitchen a stage where she learned mercy. “Bring me a glass of water”.\n\nShe almost speaks his name. The book upstairs weighs against her thoughts. If late callers ask for water, give them milk. Water remembers boats. Milk remembers mouths. She goes up, returns with a glass of milk sweating in the cellar cold, and sets it on the floor where the chalk has thickened. “Drink,” she says to the seam."
        },
        {
          "id": "page-20-14",
          "pageNumber": 14,
          "content": "The milk sours in a blink, skinning itself over with a film that crawls toward the door like it knows where mouths are. The house moans long and low, a church organ with a cracked pipe, and the bulb dims and swells, dims and swells, heart, heart, heart. Behind the door, something licks once, like a thank-you made obscene. “Good girl,” the father-voice says, and the phrase lands in Elara’s stomach and curdles there because it is a phrase that always wore love, and here it is naked and wrong."
        },
        {
          "id": "page-20-15",
          "pageNumber": 15,
          "content": "The next day, she seeks those who have lived long enough to stop pretending. Blackriver has a seamstress who once stitched mouths on ceremonial cushions and who will not touch a needle now because, she says, “You sew a thing closed and the world finds another opening to use.” There is a group that meets in the back of the VFW hall and calls itself The Keepers of Orders; they bring jars wrapped in towels and exchange them like recipes, rain for hair, moths for breath. “You are keeping the wrong thing,” a man tells Elara. “You are keeping your father out. You should be keeping him in, until he remembers his body. The house will borrow yours, if you leave it empty too long”.\n\nNights grow long and inventive. Shadows practice walking without bodies. The refrigerator’s hum becomes a whisper that learns her name backward and forward, delighted with the palindrome of fear. The bass over the doorway opens its mouth wider, and tiny moths fly in and do not fly out. The mirror in the pillowcase drips something that dries to a crust the color of teeth. The jars under the stairs rearrange their labels, months courting years, years courting her age."
        },
        {
          "id": "page-20-16",
          "pageNumber": 16,
          "content": "Somewhere between breath and word, the town’s old boundaries shift. Houses complain. Porches lean closer to eaves. The forest at the edge of Blackriver exhales and forgets the road for an hour each night. The trains pass without incident, but no one hears them; the town is listening to something else—a low, patient sermon in the bass register of the earth, a sermon that promises an ending so complete no one will have to forgive anyone again.\n\nElara writes the doors’ names daily. She speaks to the windows as if they are children asked to sit still for a photograph. She feeds the attic linen and the cellar milk. She tells the house a story: Once there was a girl who left because leaving is how a heart tests its hinges. Once there was a father who taught a girl not to be afraid of dark basements because he did not know basements could learn the shape of a family and echo it back without the love. Once there was a town that decided it was easier to honor a hunger than to fix a wound."
        },
        {
          "id": "page-20-17",
          "pageNumber": 17,
          "content": "The house listens. The house answers by cracking a new seam near the ceiling. A voice—not her father—pushes through in a whisper too crowded with tongues. “We could love you,” it says. “We have learned it from your photographs. We have practiced on your mirrors. We have softened our throats with your mother’s lullabies.” The voice is not cruel. That is worse.\n\nShe takes the book downstairs. She opens to the last pages, where ink thins and hand shakes. The final instruction is simple, almost domestic: If the house will not unlearn its appetite, starve it of its reflection. Name no rooms. Cover all glass. Leave the doors ajar. Move every day, a little. A house that cannot find its edges grows ashamed and eats itself.\n\nElara can starve with it, or she can feed it. She stands in the living room-that-is-a-wound and unnames the things she loves. Table, unnamed. Clock, unnamed. Chair, unnamed. Window, unnamed. She ties sheets together and veils every reflective thing until the house is a bride gone wrong. She opens every door. She slides open every drawer. She makes the house a mouth too full to chew."
        },
        {
          "id": "page-20-18",
          "pageNumber": 18,
          "content": "At 3:16 a.m., the hour where mistakes knock, something loses patience. The television blares snow like a white blizzard of meaning. The bass over the doorway grinds its teeth. The cellar door trembles as if a giant hand pets it, lovingly, preparing to lift. The seam at the ceiling splits, and the voice that has practiced love with her lullabies says, almost tender, “Enough. We will take you the way we took the others. We will leave your shape on a bed to warn the polite”.\n\nElara picks up the mirror bundled in its pillowcase, and for a second she is a child again, carrying a sleeping cat and not wanting to wake it. She walks to the cellar, where milk has crawled into the crack and dried like a second skin. The chalk line is bright as a horizon. She kneels and lays the mirror down, face up, in front of the door-that-is-a-mouth. The pillowcase ascends like breath. The mirror shows what it must—stairs behind stairs, a room beyond the room, and in that brightness the figure of a man who looks like her father if love was a costume people wore to weddings and funerals."
        },
        {
          "id": "page-20-19",
          "pageNumber": 19,
          "content": "The figure leans close. Hair thin as thread. Eyes too bright with rehearsal. “Good girl,” he says again, and this time the phrase is an apology. “Close your eyes.” Elara leaves them open. The mirror does not show Elara. It shows a window where she should be, and the window looks out on a garden where moths sit on milk like ships on fog and where someone is hanging sheets that twitch like breathing. The garden is not theirs, but it could be.\n\nShe speaks to the not-father in the mirror. “Eat yourself,” she says to the house. “You know your shape better than anyone.” The voice above her sobs, a soft child’s sound. The walls shudder. The door-mouth purses. The light bulges. The mirror ripples like a pond tossed a coin. And in the mirror, in the garden, the sheets seize and go still, and behind them rises the image of a house inside out, its studs and joists turned to ribs and the dark inside laid bare to the afternoon."
        },
        {
          "id": "page-20-20",
          "pageNumber": 20,
          "content": "Then the mirror breaks, not into shards but into peels, like bark sloughed from a sick tree. The sound is a howl in a key Elara recognizes as home. The cellar inhales and collapses to silence. Somewhere upstairs, the television admits there was never any program to show and dies modestly. The bass over the doorway finally shuts its wooden mouth.\n\nIn the morning, Blackriver looks unchanged. Porches blink in heat. People pretend the railroad still stops. In the diner, Mrs. Carroway folds a newspaper and does not read the front page, where a photograph of Wren Street shows a house that looks slightly smaller than yesterday, as if embarrassed by the spectacle of having a throat.\n\nElara gathers the peels of mirror into a paper bag. They are not sharp. They are soft as moth wings and smell faintly of milk. She carries them to the edge of town, where the forest exhales its green sermon and the road has been forgetting itself at night. She opens the bag and shakes the peels into the ditch, and moths rise from them like secrets freed by accident. The trees accept this offering the way trees accept weather: without thanks, without malice, with patience."
        },
        {
          "id": "page-20-21",
          "pageNumber": 21,
          "content": "She returns to the house. She makes breakfast for a man who is not here, lays out a cup for a woman who left years ago and stayed gone, opens a window for a girl who used to press her face to the glass and count cars like prayers. The house is quiet. Not cured—houses are never cured. But it is an animal too tired to hunt at noon, and noon is what she has to give.\n\nAcross town, in the back of the VFW hall, The Keepers of Orders break open their jars and let hair tangle with rain and moths settle on mouths made of cloth. Someone laughs the way relief laughs when it has not yet noticed its own price. Someone else says, “Hush,” because Blackriver is listening again—not to sermons but to the ordinary noises that keep people from opening doors at unwise hours."
        },
        {
          "id": "page-20-22",
          "pageNumber": 22,
          "content": "Night will come. The hour will knock. The house will remember the taste of a family and rehearse love into a tool. Elara will rename the doors and number the windows and, on certain evenings when the lamp light is kind and courage is cheap, sit on the porch and tell the town a story about a girl who left and came back and taught her house a new appetite: one where grief is salted, mirrors are veiled, and a mouth learns the mercy of going hungry."
        }
      ]
    },
    "hindi": {
      "title": "",
      "description": "",
      "pages": [
        {
          "id": "page-20-1-hi",
          "pageNumber": 1,
          "content": ""
        },
        {
          "id": "page-20-2-hi",
          "pageNumber": 2,
          "content": ""
        },
        {
          "id": "page-20-3-hi",
          "pageNumber": 3,
          "content": ""
        },
        {
          "id": "page-20-4-hi",
          "pageNumber": 4,
          "content": ""
        },
        {
          "id": "page-20-5-hi",
          "pageNumber": 5,
          "content": ""
        },
        {
          "id": "page-20-6-hi",
          "pageNumber": 6,
          "content": ""
        },
        {
          "id": "page-20-7-hi",
          "pageNumber": 7,
          "content": ""
        },
        {
          "id": "page-20-8-hi",
          "pageNumber": 8,
          "content": ""
        },
        {
          "id": "page-20-9-hi",
          "pageNumber": 9,
          "content": ""
        },
        {
          "id": "page-20-10-hi",
          "pageNumber": 10,
          "content": ""
        },
        {
          "id": "page-20-11-hi",
          "pageNumber": 11,
          "content": ""
        },
        {
          "id": "page-20-12-hi",
          "pageNumber": 12,
          "content": ""
        },
        {
          "id": "page-20-13-hi",
          "pageNumber": 13,
          "content": ""
        },
        {
          "id": "page-20-14-hi",
          "pageNumber": 14,
          "content": ""
        },
        {
          "id": "page-20-15-hi",
          "pageNumber": 15,
          "content": ""
        },
        {
          "id": "page-20-16-hi",
          "pageNumber": 16,
          "content": ""
        },
        {
          "id": "page-20-17-hi",
          "pageNumber": 17,
          "content": ""
        },
        {
          "id": "page-20-18-hi",
          "pageNumber": 18,
          "content": ""
        },
        {
          "id": "page-20-19-hi",
          "pageNumber": 19,
          "content": ""
        },
        {
          "id": "page-20-20-hi",
          "pageNumber": 20,
          "content": ""
        },
        {
          "id": "page-20-21-hi",
          "pageNumber": 21,
          "content": ""
        },
        {
          "id": "page-20-22-hi",
          "pageNumber": 22,
          "content": ""
        }
      ]
    },
    "hinglish": {
      "title": "",
      "description": "",
      "pages": [
        {
          "id": "page-20-1-hn",
          "pageNumber": 1,
          "content": ""
        },
        {
          "id": "page-20-2-hn",
          "pageNumber": 2,
          "content": ""
        },
        {
          "id": "page-20-3-hn",
          "pageNumber": 3,
          "content": ""
        },
        {
          "id": "page-20-4-hn",
          "pageNumber": 4,
          "content": ""
        },
        {
          "id": "page-20-5-hn",
          "pageNumber": 5,
          "content": ""
        },
        {
          "id": "page-20-6-hn",
          "pageNumber": 6,
          "content": ""
        },
        {
          "id": "page-20-7-hn",
          "pageNumber": 7,
          "content": ""
        },
        {
          "id": "page-20-8-hn",
          "pageNumber": 8,
          "content": ""
        },
        {
          "id": "page-20-9-hn",
          "pageNumber": 9,
          "content": ""
        },
        {
          "id": "page-20-10-hn",
          "pageNumber": 10,
          "content": ""
        },
        {
          "id": "page-20-11-hn",
          "pageNumber": 11,
          "content": ""
        },
        {
          "id": "page-20-12-hn",
          "pageNumber": 12,
          "content": ""
        },
        {
          "id": "page-20-13-hn",
          "pageNumber": 13,
          "content": ""
        },
        {
          "id": "page-20-14-hn",
          "pageNumber": 14,
          "content": ""
        },
        {
          "id": "page-20-15-hn",
          "pageNumber": 15,
          "content": ""
        },
        {
          "id": "page-20-16-hn",
          "pageNumber": 16,
          "content": ""
        },
        {
          "id": "page-20-17-hn",
          "pageNumber": 17,
          "content": ""
        },
        {
          "id": "page-20-18-hn",
          "pageNumber": 18,
          "content": ""
        },
        {
          "id": "page-20-19-hn",
          "pageNumber": 19,
          "content": ""
        },
        {
          "id": "page-20-20-hn",
          "pageNumber": 20,
          "content": ""
        },
        {
          "id": "page-20-21-hn",
          "pageNumber": 21,
          "content": ""
        },
        {
          "id": "page-20-22-hn",
          "pageNumber": 22,
          "content": ""
        }
      ]
    }
  }
}
