{
  "id": "20",
  "title": "The House That Eats Its Dead",
  "author": "RPradhan",
  "cover": "/assets/book20-cover.png",
  "description": "A woman returns to her haunted childhood home, battling a living house’s sinister hunger for memories, names, and reflections to reclaim her family’s lost past.",
  "genre": "Short Stories",
  "pages": [
    {
      "id": "page-20-1",
      "pageNumber": 1,
      "content": "Title: The House That Eats Its Dead.\n\nBrief Introduction\nBlackriver is a town people drive past without slowing—a single main road, a railway that no longer stops, and rows of porches where wind talks through torn screens. Tonight, the wind carries something else: a hungry whisper that moves from attic to attic, searching for the window that will open, the mouth that will answer back. Elara Muir, who left Blackriver with three suitcases and a gaunt heart, returns at dusk because her father vanished from his own bed, leaving only a blackened imprint ripe as a scorch mark and a house that hums like a throat about to sing. On her first night back, the lights flicker, the plumbing rattles, and somewhere inside the walls—behind grandfather clocks and childhood photographs—footsteps learn her rhythm and match it, perfectly, like a second pulse."
    },
    {
      "id": "page-20-2",
      "pageNumber": 2,
      "content": "The Book\nThe house on Wren Street observes Elara the way a blinded thing learns the room by scent. It swells in the heat and tightens in the cold, bones of oak flexing like knuckles. For years it pretended to be harmless—sunlit breakfasts, winters of creaking radiators, summers of mosquitoes and lemon tea. But the house was never a house; it was a mouth stitched shut by routine and denial. When her father’s shape burned into the mattress like a negative, the seam split. Smell of penny-metal and singed hair. Unbreathable quiet. A last heat fading into an outline no one could lie away.\n\nPeople in town said old homes do that—remember the living the way trees remember scars. They said power surges make lights misbehave; the city will fix it after the holiday. They said Elara always had an imagination too big for a Blackriver girl. They said her mother drank. They said lots of things, and they said them in the produce aisle and the pharmacy line because Blackriver’s lungs are gossip, and gossip tastes best when salted with the pain of families who left and came back because the world will not keep what it does not want."
    },
    {
      "id": "page-20-3",
      "pageNumber": 3,
      "content": "The first night, Elara sleeps on the couch, but the couch does not sleep back. The fabric has been warmed by years of bodies and dried by years of sun. At 3:16 a.m., the hour where mistakes knock, the television flares alive in a burst of snow. The screen shows a room much like this one—same painting of blue cornflowers, same taxidermied bass over the doorway—but in this other living room, something sits in a chair with its hands folded patiently and its head turned slightly, as if listening for a cue. The bass on the wall in that room opens its mouth wider than a bass should, and the sound that comes out is the scrape of a heavy object dragged down a hallway forever.\n\nThe remote can’t kill the image. The power button clicks like a cricket. The volume bar stutters up with no sound at all, and then music threads weakly through: the tune Elara heard when she was six and feverish and her father’s rough hand kept time on her back—White Rabbit, the vinyl’s needle scraping as if it fell into a groove dug by worry. The song spins and spins, and in the corner of the television-room-that-is-her-room, the chair stands up."
    },
    {
      "id": "page-20-4",
      "pageNumber": 4,
      "content": "Elara yanks the plug. The house sighs and swallows the dark. Somewhere, a door latches softly, a gentleness worse than a slam. There is a citrus smell, rotten under the rind. There is the faintest print on the window glass, as if someone pressed their face there to look at the sleeping woman on the couch and then backed away, polite, promising to return at a better hour.\n\nAt sunrise, Elara inventories facts. Facts are lighthouses; they may not save ships, but they draw honest maps. Fact: Her father is missing, and the stain is not blood. Fact: Blackriver’s records clerk says the house was built in 1893 by a preacher named Loam who opened his door to the poor and then closed it when the poor would not stop knocking. Fact: The survey lines on Wren Street changed three times across thirty years, as if the land could not commit to its own edges."
    },
    {
      "id": "page-20-5",
      "pageNumber": 5,
      "content": "She visits the clerk, Mrs. Carroway, who smells of lavender sachets and expired candy and who will not look at Elara’s eyes for more than a second. “Your mother never learned the rules,” Mrs. Carroway says, stamping a parcel that needs no stamp. “Your father was better. He kept the house pleased. You know what a house wants? It wants names. It wants to be told what every room is for, so it does not have to guess. It is guessing now, dear, and it has a cruel imagination”.\n\n“Rules?” Elara asks.\n\nMrs. Carroway’s stamp stutters. “Salt the thresholds. Feed the attic with linen. Never leave a mirror uncovered at night; mirrors are doorways for the dead who don’t recognize themselves anymore and for the living who are too vain to admit they look like everyone else in grief. And if late callers ask for water, give them milk. Water remembers boats. Milk remembers mouths”."
    },
    {
      "id": "page-20-6",
      "pageNumber": 6,
      "content": "Elara wants to laugh, but there is a tender, awful sense that the town is pretending sanity in front of her. Outside, heat drapes over the sidewalks and the railroad gleams with the stubbornness of something obsolete and proud. She walks back along Main Street, past the barbershop that has trimmed the hair of ghosts for a century, past the diner where the pancakes arrive with smiles squeezed from cream and where everyone keeps their palms on their mugs as if warmth could be inherited, held, banked for later.\n\nAt home, she salts the thresholds because contempt is not wisdom and because rituals—even foolish ones—can anchor a day that is otherwise loose, flapping. The salt lies like frost along the wood. The house hums again, a vibration that troubles the baseboards. The humming becomes a note; the note becomes breath. The breath becomes a voice speaking not to Elara but to the air above the stairs: “It is ready”."
    },
    {
      "id": "page-20-7",
      "pageNumber": 7,
      "content": "She climbs. The attic ladder unfolds with the docility of an animal that will bite later. Heat embraces her scalp, and the smell of old paper and mouse nests rises like a sermon no one asked for. The attic is a museum of family lives—baby clothes sealed in bins; a crib whose spindles have recorded sleepless nights in their teeth; boxes of school projects where volcanoes erupted with baking soda; photographs that show Blackriver’s main street when it still wore a hat.\n\nIn the far corner, where roof meets roof in a secret handshake, sits a trunk that does not belong to them. It is too old, too elegant in its ruin, brass fittings greened with patience. The lid, when she lifts it, is warmer than the room. Inside: linens, as promised, a stack of folded sheets embroidered with initials that are not theirs. Beneath the linen, a book whose cover looks like hammered bark, title impressed in a language that uses commas as teeth. Beneath the book, a mirror facedown, frame scratched. She slides the mirror out by its ribbon, and a small moth, pale as a flake of ash, falls from the ribbon and lands on her wrist."
    },
    {
      "id": "page-20-8",
      "pageNumber": 8,
      "content": "Elara does not turn the mirror. Instead, she lifts the book. The leaves are stiff and not paper, closer to something grown than made. The first page describes, in blocky letters, The Household Rite of Draft and Door. The rite demands that each door must be named at dusk and each window numbered at dawn, or else the house will learn its own numerology and count backward, from dead to living, until it arrives at the number it loves best: one. One is a captive.\n\nThe second page shows a diagram of walls, but the walls are drawn as ribs, and a staircase like a spinal column, and a cellar full of jars, each labeled with a month and a year. The caption: Orders of Keeping. Keep moths in jars to teach the house gentleness. Keep hair in jars to teach it loyalty. Keep rain in jars to teach it grief.\n\nShe closes the book. The moth lifts, drums its powder across her wrist, and disappears into the heat. Somewhere below, a faucet opens and closes. A drop sings the stainless hymn of a sink. Elara waits for the floor to tilt or the walls to part. The attic remains a sweating lung, patient. The patient ones are worst; they have already outlasted your courage in their heads."
    },
    {
      "id": "page-20-9",
      "pageNumber": 9,
      "content": "Blackriver has legends, though the town won’t call them that. People say the preacher Loam did not die; he cured himself of dying by walking into his church’s crawlspace and preaching one continuous sermon to whatever waited beneath the floor. The congregation left when the floor swelled like a belly, and Loam’s voice, which had comforted mothers and cowed boys, reversed itself and became a sound like trapping a fly under a cup—the dull, persistent tapping of faith against the boundaries of the world. They say the sermon has not stopped. They say the house on Wren Street was raised with the leftover wood.\n\nElara spends afternoons at the diner, reading back issues of the Blackriver Gazette where floods mattered, and girls with washed hair were crowned in basements that smelled of onions and victory. In the classifieds, she finds an advertisement from 1974: Wanted: seamstress to stitch mouths shut on ceremonial cushions; no experience necessary; we will teach you the hymns."
    },
    {
      "id": "page-20-10",
      "pageNumber": 10,
      "content": "At night, the rooms insist on their roles. The kitchen insists it is a wound that should be covered. The hallway insists it is a corridor in a hospital where the sick are ashamed to cough. The bathroom insists it is a confession booth and fogs the mirror to hide a face that will not admit its sins. The bedroom insists it remembers a man who laid down and left a shape behind, which is impolite.\n\nElara dreams a memory not hers: a child, small as worry, counting the stairs backward the way the book demanded not, thirteen to one, and at one a door opens beneath the stair, the underside of the house yawning the way a fish does when pulled from river to hot air. Inside that mouth, jars clink with moth-wings, and rain breaks itself against glass, and hair knots into someone else’s braid."
    },
    {
      "id": "page-20-11",
      "pageNumber": 11,
      "content": "She wakes with the taste of glass in her teeth. The mirror from the trunk is leaning against the closet, uncovered now, which she did not do. Her reflection arrives half a second late. When she moves her hand, the reflected hand hesitates, a shy twin. When she speaks, her reflection wets its lips to start, but Elara has already finished. Behind the reflection, the dark inside the closet looks deeper than a closet should be, as if coats were trees and shoes were stones along a riverbed that was not there yesterday.\n\nElara covers the mirror with a pillowcase. The pillowcase sinks as if a face presses outward from the inside. She ties the pillowcase tight. She salts the closet’s sill with a tremor that darkens the salt to something like sugar that has failed to be sweet. She writes the names of the doors and numbers the windows and puts her ear to the wall and says, softly, “We are not alone in our suffering. Be kind, if you know how”.\n\nSometimes, kindness is the only profanity that works."
    },
    {
      "id": "page-20-12",
      "pageNumber": 12,
      "content": "The house answers by dimming the lamps one by one, as if lowering a theater for the important act. The floorboards click in a sequence that feels like a code. She follows the clicks to the cellar door, which was painted shut the year she turned nine because her mother swore she saw a woman standing barefoot on the steps and smiling in a way that made smiling a weapon. Elara’s fingernails find old cracks in the paint. The paint gives the way stubborn things always do: all at once, as if offended to be asked twice.\n\nThe cellar breathes out its cold, and the air smells of wet pennies and apples wintered too long. A chain dangles like punctuation, and when she pulls it, the light bulb blinks and holds and the cellar arranges itself—shelves of preserves, a broken rocking horse, boxes of decorations that teach children both joy and fear, a chalk line on the floor where someone once measured height and hope. At the back, a wall of stone. In the stone, someone inserted a door shaped like a door only because they had not yet learned the house preferred mouths."
    },
    {
      "id": "page-20-13",
      "pageNumber": 13,
      "content": "She kneels. On the door is a rusted keyhole that sighs when she exhales on it, and a whisper leaks through, warmer than the room, intimate as a speaking mouth to the ear: “E—la—ra,” syllables spread like jam on bread. It is her father’s voice, or a rehearsal of it. “Bring me a glass of water,” the whisper says, and the memory leaps up from childhood like a trained animal—her father’s voice on summer nights when thirst was theater and the kitchen a stage where she learned mercy. “Bring me a glass of water”.\n\nShe almost speaks his name. The book upstairs weighs against her thoughts. If late callers ask for water, give them milk. Water remembers boats. Milk remembers mouths. She goes up, returns with a glass of milk sweating in the cellar cold, and sets it on the floor where the chalk has thickened. “Drink,” she says to the seam."
    },
    {
      "id": "page-20-14",
      "pageNumber": 14,
      "content": "The milk sours in a blink, skinning itself over with a film that crawls toward the door like it knows where mouths are. The house moans long and low, a church organ with a cracked pipe, and the bulb dims and swells, dims and swells, heart, heart, heart. Behind the door, something licks once, like a thank-you made obscene. “Good girl,” the father-voice says, and the phrase lands in Elara’s stomach and curdles there because it is a phrase that always wore love, and here it is naked and wrong."
    },
    {
      "id": "page-20-15",
      "pageNumber": 15,
      "content": "The next day, she seeks those who have lived long enough to stop pretending. Blackriver has a seamstress who once stitched mouths on ceremonial cushions and who will not touch a needle now because, she says, “You sew a thing closed and the world finds another opening to use.” There is a group that meets in the back of the VFW hall and calls itself The Keepers of Orders; they bring jars wrapped in towels and exchange them like recipes, rain for hair, moths for breath. “You are keeping the wrong thing,” a man tells Elara. “You are keeping your father out. You should be keeping him in, until he remembers his body. The house will borrow yours, if you leave it empty too long”.\n\nNights grow long and inventive. Shadows practice walking without bodies. The refrigerator’s hum becomes a whisper that learns her name backward and forward, delighted with the palindrome of fear. The bass over the doorway opens its mouth wider, and tiny moths fly in and do not fly out. The mirror in the pillowcase drips something that dries to a crust the color of teeth. The jars under the stairs rearrange their labels, months courting years, years courting her age."
    },
    {
      "id": "page-20-16",
      "pageNumber": 16,
      "content": "Somewhere between breath and word, the town’s old boundaries shift. Houses complain. Porches lean closer to eaves. The forest at the edge of Blackriver exhales and forgets the road for an hour each night. The trains pass without incident, but no one hears them; the town is listening to something else—a low, patient sermon in the bass register of the earth, a sermon that promises an ending so complete no one will have to forgive anyone again.\n\nElara writes the doors’ names daily. She speaks to the windows as if they are children asked to sit still for a photograph. She feeds the attic linen and the cellar milk. She tells the house a story: Once there was a girl who left because leaving is how a heart tests its hinges. Once there was a father who taught a girl not to be afraid of dark basements because he did not know basements could learn the shape of a family and echo it back without the love. Once there was a town that decided it was easier to honor a hunger than to fix a wound."
    },
    {
      "id": "page-20-17",
      "pageNumber": 17,
      "content": "The house listens. The house answers by cracking a new seam near the ceiling. A voice—not her father—pushes through in a whisper too crowded with tongues. “We could love you,” it says. “We have learned it from your photographs. We have practiced on your mirrors. We have softened our throats with your mother’s lullabies.” The voice is not cruel. That is worse.\n\nShe takes the book downstairs. She opens to the last pages, where ink thins and hand shakes. The final instruction is simple, almost domestic: If the house will not unlearn its appetite, starve it of its reflection. Name no rooms. Cover all glass. Leave the doors ajar. Move every day, a little. A house that cannot find its edges grows ashamed and eats itself.\n\nElara can starve with it, or she can feed it. She stands in the living room-that-is-a-wound and unnames the things she loves. Table, unnamed. Clock, unnamed. Chair, unnamed. Window, unnamed. She ties sheets together and veils every reflective thing until the house is a bride gone wrong. She opens every door. She slides open every drawer. She makes the house a mouth too full to chew."
    },
    {
      "id": "page-20-18",
      "pageNumber": 18,
      "content": "At 3:16 a.m., the hour where mistakes knock, something loses patience. The television blares snow like a white blizzard of meaning. The bass over the doorway grinds its teeth. The cellar door trembles as if a giant hand pets it, lovingly, preparing to lift. The seam at the ceiling splits, and the voice that has practiced love with her lullabies says, almost tender, “Enough. We will take you the way we took the others. We will leave your shape on a bed to warn the polite”.\n\nElara picks up the mirror bundled in its pillowcase, and for a second she is a child again, carrying a sleeping cat and not wanting to wake it. She walks to the cellar, where milk has crawled into the crack and dried like a second skin. The chalk line is bright as a horizon. She kneels and lays the mirror down, face up, in front of the door-that-is-a-mouth. The pillowcase ascends like breath. The mirror shows what it must—stairs behind stairs, a room beyond the room, and in that brightness the figure of a man who looks like her father if love was a costume people wore to weddings and funerals."
    },
    {
      "id": "page-20-19",
      "pageNumber": 19,
      "content": "The figure leans close. Hair thin as thread. Eyes too bright with rehearsal. “Good girl,” he says again, and this time the phrase is an apology. “Close your eyes.” Elara leaves them open. The mirror does not show Elara. It shows a window where she should be, and the window looks out on a garden where moths sit on milk like ships on fog and where someone is hanging sheets that twitch like breathing. The garden is not theirs, but it could be.\n\nShe speaks to the not-father in the mirror. “Eat yourself,” she says to the house. “You know your shape better than anyone.” The voice above her sobs, a soft child’s sound. The walls shudder. The door-mouth purses. The light bulges. The mirror ripples like a pond tossed a coin. And in the mirror, in the garden, the sheets seize and go still, and behind them rises the image of a house inside out, its studs and joists turned to ribs and the dark inside laid bare to the afternoon."
    },
    {
      "id": "page-20-20",
      "pageNumber": 20,
      "content": "Then the mirror breaks, not into shards but into peels, like bark sloughed from a sick tree. The sound is a howl in a key Elara recognizes as home. The cellar inhales and collapses to silence. Somewhere upstairs, the television admits there was never any program to show and dies modestly. The bass over the doorway finally shuts its wooden mouth.\n\nIn the morning, Blackriver looks unchanged. Porches blink in heat. People pretend the railroad still stops. In the diner, Mrs. Carroway folds a newspaper and does not read the front page, where a photograph of Wren Street shows a house that looks slightly smaller than yesterday, as if embarrassed by the spectacle of having a throat.\n\nElara gathers the peels of mirror into a paper bag. They are not sharp. They are soft as moth wings and smell faintly of milk. She carries them to the edge of town, where the forest exhales its green sermon and the road has been forgetting itself at night. She opens the bag and shakes the peels into the ditch, and moths rise from them like secrets freed by accident. The trees accept this offering the way trees accept weather: without thanks, without malice, with patience."
    },
    {
      "id": "page-20-21",
      "pageNumber": 21,
      "content": "She returns to the house. She makes breakfast for a man who is not here, lays out a cup for a woman who left years ago and stayed gone, opens a window for a girl who used to press her face to the glass and count cars like prayers. The house is quiet. Not cured—houses are never cured. But it is an animal too tired to hunt at noon, and noon is what she has to give.\n\nAcross town, in the back of the VFW hall, The Keepers of Orders break open their jars and let hair tangle with rain and moths settle on mouths made of cloth. Someone laughs the way relief laughs when it has not yet noticed its own price. Someone else says, “Hush,” because Blackriver is listening again—not to sermons but to the ordinary noises that keep people from opening doors at unwise hours."
    },
    {
      "id": "page-20-22",
      "pageNumber": 22,
      "content": "Night will come. The hour will knock. The house will remember the taste of a family and rehearse love into a tool. Elara will rename the doors and number the windows and, on certain evenings when the lamp light is kind and courage is cheap, sit on the porch and tell the town a story about a girl who left and came back and taught her house a new appetite: one where grief is salted, mirrors are veiled, and a mouth learns the mercy of going hungry."
    }
  ],
  "languages": {
    "english": {
      "title": "The House That Eats Its Dead",
      "description": "A woman returns to her haunted childhood home, battling a living house’s sinister hunger for memories, names, and reflections to reclaim her family’s lost past.",
      "pages": [
        {
          "id": "page-20-1",
          "pageNumber": 1,
          "content": "Title: The House That Eats Its Dead.\n\nBrief Introduction\nBlackriver is a town people drive past without slowing—a single main road, a railway that no longer stops, and rows of porches where wind talks through torn screens. Tonight, the wind carries something else: a hungry whisper that moves from attic to attic, searching for the window that will open, the mouth that will answer back. Elara Muir, who left Blackriver with three suitcases and a gaunt heart, returns at dusk because her father vanished from his own bed, leaving only a blackened imprint ripe as a scorch mark and a house that hums like a throat about to sing. On her first night back, the lights flicker, the plumbing rattles, and somewhere inside the walls—behind grandfather clocks and childhood photographs—footsteps learn her rhythm and match it, perfectly, like a second pulse."
        },
        {
          "id": "page-20-2",
          "pageNumber": 2,
          "content": "The Book\nThe house on Wren Street observes Elara the way a blinded thing learns the room by scent. It swells in the heat and tightens in the cold, bones of oak flexing like knuckles. For years it pretended to be harmless—sunlit breakfasts, winters of creaking radiators, summers of mosquitoes and lemon tea. But the house was never a house; it was a mouth stitched shut by routine and denial. When her father’s shape burned into the mattress like a negative, the seam split. Smell of penny-metal and singed hair. Unbreathable quiet. A last heat fading into an outline no one could lie away.\n\nPeople in town said old homes do that—remember the living the way trees remember scars. They said power surges make lights misbehave; the city will fix it after the holiday. They said Elara always had an imagination too big for a Blackriver girl. They said her mother drank. They said lots of things, and they said them in the produce aisle and the pharmacy line because Blackriver’s lungs are gossip, and gossip tastes best when salted with the pain of families who left and came back because the world will not keep what it does not want."
        },
        {
          "id": "page-20-3",
          "pageNumber": 3,
          "content": "The first night, Elara sleeps on the couch, but the couch does not sleep back. The fabric has been warmed by years of bodies and dried by years of sun. At 3:16 a.m., the hour where mistakes knock, the television flares alive in a burst of snow. The screen shows a room much like this one—same painting of blue cornflowers, same taxidermied bass over the doorway—but in this other living room, something sits in a chair with its hands folded patiently and its head turned slightly, as if listening for a cue. The bass on the wall in that room opens its mouth wider than a bass should, and the sound that comes out is the scrape of a heavy object dragged down a hallway forever.\n\nThe remote can’t kill the image. The power button clicks like a cricket. The volume bar stutters up with no sound at all, and then music threads weakly through: the tune Elara heard when she was six and feverish and her father’s rough hand kept time on her back—White Rabbit, the vinyl’s needle scraping as if it fell into a groove dug by worry. The song spins and spins, and in the corner of the television-room-that-is-her-room, the chair stands up."
        },
        {
          "id": "page-20-4",
          "pageNumber": 4,
          "content": "Elara yanks the plug. The house sighs and swallows the dark. Somewhere, a door latches softly, a gentleness worse than a slam. There is a citrus smell, rotten under the rind. There is the faintest print on the window glass, as if someone pressed their face there to look at the sleeping woman on the couch and then backed away, polite, promising to return at a better hour.\n\nAt sunrise, Elara inventories facts. Facts are lighthouses; they may not save ships, but they draw honest maps. Fact: Her father is missing, and the stain is not blood. Fact: Blackriver’s records clerk says the house was built in 1893 by a preacher named Loam who opened his door to the poor and then closed it when the poor would not stop knocking. Fact: The survey lines on Wren Street changed three times across thirty years, as if the land could not commit to its own edges."
        },
        {
          "id": "page-20-5",
          "pageNumber": 5,
          "content": "She visits the clerk, Mrs. Carroway, who smells of lavender sachets and expired candy and who will not look at Elara’s eyes for more than a second. “Your mother never learned the rules,” Mrs. Carroway says, stamping a parcel that needs no stamp. “Your father was better. He kept the house pleased. You know what a house wants? It wants names. It wants to be told what every room is for, so it does not have to guess. It is guessing now, dear, and it has a cruel imagination”.\n\n“Rules?” Elara asks.\n\nMrs. Carroway’s stamp stutters. “Salt the thresholds. Feed the attic with linen. Never leave a mirror uncovered at night; mirrors are doorways for the dead who don’t recognize themselves anymore and for the living who are too vain to admit they look like everyone else in grief. And if late callers ask for water, give them milk. Water remembers boats. Milk remembers mouths”."
        },
        {
          "id": "page-20-6",
          "pageNumber": 6,
          "content": "Elara wants to laugh, but there is a tender, awful sense that the town is pretending sanity in front of her. Outside, heat drapes over the sidewalks and the railroad gleams with the stubbornness of something obsolete and proud. She walks back along Main Street, past the barbershop that has trimmed the hair of ghosts for a century, past the diner where the pancakes arrive with smiles squeezed from cream and where everyone keeps their palms on their mugs as if warmth could be inherited, held, banked for later.\n\nAt home, she salts the thresholds because contempt is not wisdom and because rituals—even foolish ones—can anchor a day that is otherwise loose, flapping. The salt lies like frost along the wood. The house hums again, a vibration that troubles the baseboards. The humming becomes a note; the note becomes breath. The breath becomes a voice speaking not to Elara but to the air above the stairs: “It is ready”."
        },
        {
          "id": "page-20-7",
          "pageNumber": 7,
          "content": "She climbs. The attic ladder unfolds with the docility of an animal that will bite later. Heat embraces her scalp, and the smell of old paper and mouse nests rises like a sermon no one asked for. The attic is a museum of family lives—baby clothes sealed in bins; a crib whose spindles have recorded sleepless nights in their teeth; boxes of school projects where volcanoes erupted with baking soda; photographs that show Blackriver’s main street when it still wore a hat.\n\nIn the far corner, where roof meets roof in a secret handshake, sits a trunk that does not belong to them. It is too old, too elegant in its ruin, brass fittings greened with patience. The lid, when she lifts it, is warmer than the room. Inside: linens, as promised, a stack of folded sheets embroidered with initials that are not theirs. Beneath the linen, a book whose cover looks like hammered bark, title impressed in a language that uses commas as teeth. Beneath the book, a mirror facedown, frame scratched. She slides the mirror out by its ribbon, and a small moth, pale as a flake of ash, falls from the ribbon and lands on her wrist."
        },
        {
          "id": "page-20-8",
          "pageNumber": 8,
          "content": "Elara does not turn the mirror. Instead, she lifts the book. The leaves are stiff and not paper, closer to something grown than made. The first page describes, in blocky letters, The Household Rite of Draft and Door. The rite demands that each door must be named at dusk and each window numbered at dawn, or else the house will learn its own numerology and count backward, from dead to living, until it arrives at the number it loves best: one. One is a captive.\n\nThe second page shows a diagram of walls, but the walls are drawn as ribs, and a staircase like a spinal column, and a cellar full of jars, each labeled with a month and a year. The caption: Orders of Keeping. Keep moths in jars to teach the house gentleness. Keep hair in jars to teach it loyalty. Keep rain in jars to teach it grief.\n\nShe closes the book. The moth lifts, drums its powder across her wrist, and disappears into the heat. Somewhere below, a faucet opens and closes. A drop sings the stainless hymn of a sink. Elara waits for the floor to tilt or the walls to part. The attic remains a sweating lung, patient. The patient ones are worst; they have already outlasted your courage in their heads."
        },
        {
          "id": "page-20-9",
          "pageNumber": 9,
          "content": "Blackriver has legends, though the town won’t call them that. People say the preacher Loam did not die; he cured himself of dying by walking into his church’s crawlspace and preaching one continuous sermon to whatever waited beneath the floor. The congregation left when the floor swelled like a belly, and Loam’s voice, which had comforted mothers and cowed boys, reversed itself and became a sound like trapping a fly under a cup—the dull, persistent tapping of faith against the boundaries of the world. They say the sermon has not stopped. They say the house on Wren Street was raised with the leftover wood.\n\nElara spends afternoons at the diner, reading back issues of the Blackriver Gazette where floods mattered, and girls with washed hair were crowned in basements that smelled of onions and victory. In the classifieds, she finds an advertisement from 1974: Wanted: seamstress to stitch mouths shut on ceremonial cushions; no experience necessary; we will teach you the hymns."
        },
        {
          "id": "page-20-10",
          "pageNumber": 10,
          "content": "At night, the rooms insist on their roles. The kitchen insists it is a wound that should be covered. The hallway insists it is a corridor in a hospital where the sick are ashamed to cough. The bathroom insists it is a confession booth and fogs the mirror to hide a face that will not admit its sins. The bedroom insists it remembers a man who laid down and left a shape behind, which is impolite.\n\nElara dreams a memory not hers: a child, small as worry, counting the stairs backward the way the book demanded not, thirteen to one, and at one a door opens beneath the stair, the underside of the house yawning the way a fish does when pulled from river to hot air. Inside that mouth, jars clink with moth-wings, and rain breaks itself against glass, and hair knots into someone else’s braid."
        },
        {
          "id": "page-20-11",
          "pageNumber": 11,
          "content": "She wakes with the taste of glass in her teeth. The mirror from the trunk is leaning against the closet, uncovered now, which she did not do. Her reflection arrives half a second late. When she moves her hand, the reflected hand hesitates, a shy twin. When she speaks, her reflection wets its lips to start, but Elara has already finished. Behind the reflection, the dark inside the closet looks deeper than a closet should be, as if coats were trees and shoes were stones along a riverbed that was not there yesterday.\n\nElara covers the mirror with a pillowcase. The pillowcase sinks as if a face presses outward from the inside. She ties the pillowcase tight. She salts the closet’s sill with a tremor that darkens the salt to something like sugar that has failed to be sweet. She writes the names of the doors and numbers the windows and puts her ear to the wall and says, softly, “We are not alone in our suffering. Be kind, if you know how”.\n\nSometimes, kindness is the only profanity that works."
        },
        {
          "id": "page-20-12",
          "pageNumber": 12,
          "content": "The house answers by dimming the lamps one by one, as if lowering a theater for the important act. The floorboards click in a sequence that feels like a code. She follows the clicks to the cellar door, which was painted shut the year she turned nine because her mother swore she saw a woman standing barefoot on the steps and smiling in a way that made smiling a weapon. Elara’s fingernails find old cracks in the paint. The paint gives the way stubborn things always do: all at once, as if offended to be asked twice.\n\nThe cellar breathes out its cold, and the air smells of wet pennies and apples wintered too long. A chain dangles like punctuation, and when she pulls it, the light bulb blinks and holds and the cellar arranges itself—shelves of preserves, a broken rocking horse, boxes of decorations that teach children both joy and fear, a chalk line on the floor where someone once measured height and hope. At the back, a wall of stone. In the stone, someone inserted a door shaped like a door only because they had not yet learned the house preferred mouths."
        },
        {
          "id": "page-20-13",
          "pageNumber": 13,
          "content": "She kneels. On the door is a rusted keyhole that sighs when she exhales on it, and a whisper leaks through, warmer than the room, intimate as a speaking mouth to the ear: “E—la—ra,” syllables spread like jam on bread. It is her father’s voice, or a rehearsal of it. “Bring me a glass of water,” the whisper says, and the memory leaps up from childhood like a trained animal—her father’s voice on summer nights when thirst was theater and the kitchen a stage where she learned mercy. “Bring me a glass of water”.\n\nShe almost speaks his name. The book upstairs weighs against her thoughts. If late callers ask for water, give them milk. Water remembers boats. Milk remembers mouths. She goes up, returns with a glass of milk sweating in the cellar cold, and sets it on the floor where the chalk has thickened. “Drink,” she says to the seam."
        },
        {
          "id": "page-20-14",
          "pageNumber": 14,
          "content": "The milk sours in a blink, skinning itself over with a film that crawls toward the door like it knows where mouths are. The house moans long and low, a church organ with a cracked pipe, and the bulb dims and swells, dims and swells, heart, heart, heart. Behind the door, something licks once, like a thank-you made obscene. “Good girl,” the father-voice says, and the phrase lands in Elara’s stomach and curdles there because it is a phrase that always wore love, and here it is naked and wrong."
        },
        {
          "id": "page-20-15",
          "pageNumber": 15,
          "content": "The next day, she seeks those who have lived long enough to stop pretending. Blackriver has a seamstress who once stitched mouths on ceremonial cushions and who will not touch a needle now because, she says, “You sew a thing closed and the world finds another opening to use.” There is a group that meets in the back of the VFW hall and calls itself The Keepers of Orders; they bring jars wrapped in towels and exchange them like recipes, rain for hair, moths for breath. “You are keeping the wrong thing,” a man tells Elara. “You are keeping your father out. You should be keeping him in, until he remembers his body. The house will borrow yours, if you leave it empty too long”.\n\nNights grow long and inventive. Shadows practice walking without bodies. The refrigerator’s hum becomes a whisper that learns her name backward and forward, delighted with the palindrome of fear. The bass over the doorway opens its mouth wider, and tiny moths fly in and do not fly out. The mirror in the pillowcase drips something that dries to a crust the color of teeth. The jars under the stairs rearrange their labels, months courting years, years courting her age."
        },
        {
          "id": "page-20-16",
          "pageNumber": 16,
          "content": "Somewhere between breath and word, the town’s old boundaries shift. Houses complain. Porches lean closer to eaves. The forest at the edge of Blackriver exhales and forgets the road for an hour each night. The trains pass without incident, but no one hears them; the town is listening to something else—a low, patient sermon in the bass register of the earth, a sermon that promises an ending so complete no one will have to forgive anyone again.\n\nElara writes the doors’ names daily. She speaks to the windows as if they are children asked to sit still for a photograph. She feeds the attic linen and the cellar milk. She tells the house a story: Once there was a girl who left because leaving is how a heart tests its hinges. Once there was a father who taught a girl not to be afraid of dark basements because he did not know basements could learn the shape of a family and echo it back without the love. Once there was a town that decided it was easier to honor a hunger than to fix a wound."
        },
        {
          "id": "page-20-17",
          "pageNumber": 17,
          "content": "The house listens. The house answers by cracking a new seam near the ceiling. A voice—not her father—pushes through in a whisper too crowded with tongues. “We could love you,” it says. “We have learned it from your photographs. We have practiced on your mirrors. We have softened our throats with your mother’s lullabies.” The voice is not cruel. That is worse.\n\nShe takes the book downstairs. She opens to the last pages, where ink thins and hand shakes. The final instruction is simple, almost domestic: If the house will not unlearn its appetite, starve it of its reflection. Name no rooms. Cover all glass. Leave the doors ajar. Move every day, a little. A house that cannot find its edges grows ashamed and eats itself.\n\nElara can starve with it, or she can feed it. She stands in the living room-that-is-a-wound and unnames the things she loves. Table, unnamed. Clock, unnamed. Chair, unnamed. Window, unnamed. She ties sheets together and veils every reflective thing until the house is a bride gone wrong. She opens every door. She slides open every drawer. She makes the house a mouth too full to chew."
        },
        {
          "id": "page-20-18",
          "pageNumber": 18,
          "content": "At 3:16 a.m., the hour where mistakes knock, something loses patience. The television blares snow like a white blizzard of meaning. The bass over the doorway grinds its teeth. The cellar door trembles as if a giant hand pets it, lovingly, preparing to lift. The seam at the ceiling splits, and the voice that has practiced love with her lullabies says, almost tender, “Enough. We will take you the way we took the others. We will leave your shape on a bed to warn the polite”.\n\nElara picks up the mirror bundled in its pillowcase, and for a second she is a child again, carrying a sleeping cat and not wanting to wake it. She walks to the cellar, where milk has crawled into the crack and dried like a second skin. The chalk line is bright as a horizon. She kneels and lays the mirror down, face up, in front of the door-that-is-a-mouth. The pillowcase ascends like breath. The mirror shows what it must—stairs behind stairs, a room beyond the room, and in that brightness the figure of a man who looks like her father if love was a costume people wore to weddings and funerals."
        },
        {
          "id": "page-20-19",
          "pageNumber": 19,
          "content": "The figure leans close. Hair thin as thread. Eyes too bright with rehearsal. “Good girl,” he says again, and this time the phrase is an apology. “Close your eyes.” Elara leaves them open. The mirror does not show Elara. It shows a window where she should be, and the window looks out on a garden where moths sit on milk like ships on fog and where someone is hanging sheets that twitch like breathing. The garden is not theirs, but it could be.\n\nShe speaks to the not-father in the mirror. “Eat yourself,” she says to the house. “You know your shape better than anyone.” The voice above her sobs, a soft child’s sound. The walls shudder. The door-mouth purses. The light bulges. The mirror ripples like a pond tossed a coin. And in the mirror, in the garden, the sheets seize and go still, and behind them rises the image of a house inside out, its studs and joists turned to ribs and the dark inside laid bare to the afternoon."
        },
        {
          "id": "page-20-20",
          "pageNumber": 20,
          "content": "Then the mirror breaks, not into shards but into peels, like bark sloughed from a sick tree. The sound is a howl in a key Elara recognizes as home. The cellar inhales and collapses to silence. Somewhere upstairs, the television admits there was never any program to show and dies modestly. The bass over the doorway finally shuts its wooden mouth.\n\nIn the morning, Blackriver looks unchanged. Porches blink in heat. People pretend the railroad still stops. In the diner, Mrs. Carroway folds a newspaper and does not read the front page, where a photograph of Wren Street shows a house that looks slightly smaller than yesterday, as if embarrassed by the spectacle of having a throat.\n\nElara gathers the peels of mirror into a paper bag. They are not sharp. They are soft as moth wings and smell faintly of milk. She carries them to the edge of town, where the forest exhales its green sermon and the road has been forgetting itself at night. She opens the bag and shakes the peels into the ditch, and moths rise from them like secrets freed by accident. The trees accept this offering the way trees accept weather: without thanks, without malice, with patience."
        },
        {
          "id": "page-20-21",
          "pageNumber": 21,
          "content": "She returns to the house. She makes breakfast for a man who is not here, lays out a cup for a woman who left years ago and stayed gone, opens a window for a girl who used to press her face to the glass and count cars like prayers. The house is quiet. Not cured—houses are never cured. But it is an animal too tired to hunt at noon, and noon is what she has to give.\n\nAcross town, in the back of the VFW hall, The Keepers of Orders break open their jars and let hair tangle with rain and moths settle on mouths made of cloth. Someone laughs the way relief laughs when it has not yet noticed its own price. Someone else says, “Hush,” because Blackriver is listening again—not to sermons but to the ordinary noises that keep people from opening doors at unwise hours."
        },
        {
          "id": "page-20-22",
          "pageNumber": 22,
          "content": "Night will come. The hour will knock. The house will remember the taste of a family and rehearse love into a tool. Elara will rename the doors and number the windows and, on certain evenings when the lamp light is kind and courage is cheap, sit on the porch and tell the town a story about a girl who left and came back and taught her house a new appetite: one where grief is salted, mirrors are veiled, and a mouth learns the mercy of going hungry."
        }
      ]
    },
    "hindi": {
      "title": "वह घर जो अपने मृतकों को खाता है।",
      "description": "एक महिला अपने बचपन के भूतिया घर में लौटती है, तथा अपने परिवार के खोए हुए अतीत को पुनः प्राप्त करने के लिए, यादों, नामों और प्रतिबिंबों के लिए एक जीवित घर की भयावह भूख से संघर्ष करती है।",
      "pages": [
        {
          "id": "page-20-1-hi",
          "pageNumber": 1,
          "content": "शीर्षक: वह घर जो अपने मृतकों को खाता है।\n\nसंक्षिप्त परिचय \nब्लैकरिवर एक ऐसा शहर है जहां से लोग बिना रुके गुजरते हैं—एक मुख्य सड़क, एक रेलमार्ग जो अब नहीं रुकता, और बरामदों की कतारें जहां हवा फटी हुई स्क्रीन के माध्यम से बातें करती है। आज रात, हवा कुछ और लेकर आ रही है: एक भूखी फुसफुसाहट जो अटारी से अटारी तक चलती है, उस खिड़की की तलाश में जो खुलेगी, वह मुंह जो जवाब देगा। एलारा मुइर, जिसने तीन सूटकेस और एक कमजोर दिल के साथ ब्लैकरिवर छोड़ा था, शाम को लौटती है क्योंकि उसके पिता अपने बिस्तर से गायब हो गए थे, केवल एक काली छाप छोड़ गए थे जो एक झुलसे हुए निशान की तरह पका हुआ था और एक घर जो गाने वाले गले की तरह गुनगुना रहा था। उसकी पहली रात वापस आने पर, रोशनी टिमटिमाती है, पाइपलाइन खड़खड़ाती है, और कहीं दीवारों के अंदर"
        },
        {
          "id": "page-20-2-hi",
          "pageNumber": 2,
          "content": "यह \nघर एलारा को उसी तरह देखता है जैसे कोई अंधी चीज़ गंध से कमरे को पहचानती है। यह गर्मी में फूल जाता है और ठंड में सिकुड़ जाता है, ओक की हड्डियाँ उँगलियों की तरह मुड़ जाती हैं। सालों तक इसने हानिरहित होने का नाटक किया—धूप में नाश्ता, चरमराते रेडिएटरों वाली सर्दियाँ, मच्छरों और नींबू की चाय वाली गर्मियाँ। लेकिन यह घर कभी घर नहीं रहा; यह एक ऐसा मुँह था जो दिनचर्या और इनकार से बंद था। जब उसके पिता की आकृति गद्दे में किसी नेगेटिव की तरह जल गई, तो उसकी सिलाई फट गई। पैसे-धातु और जले हुए बालों की गंध। साँस न ले पाने वाला सन्नाटा। आखिरी गर्मी एक ऐसी रूपरेखा में फीकी पड़ रही थी जिससे कोई भी मुँह नहीं मोड़ सकता था।"
        },
        {
          "id": "page-20-3-hi",
          "pageNumber": 3,
          "content": "शहर के लोगों ने कहा कि पुराने घर ऐसा ही करते हैं—जैसे पेड़ ज़ख्मों को याद रखते हैं, वैसे ही वे ज़िंदा लोगों को याद रखते हैं। उन्होंने कहा कि बिजली के तेज़ झोंकों से बत्तियाँ खराब हो जाती हैं; शहर छुट्टियों के बाद इसे ठीक कर देगा। उन्होंने कहा कि एलारा की कल्पनाएँ हमेशा ब्लैकरिवर की लड़की के लिए बहुत बड़ी थीं। उन्होंने कहा कि उसकी माँ शराब पीती थी। उन्होंने बहुत सी बातें कहीं, और उन्होंने ये बातें फल-सब्ज़ियों की दुकानों और दवा की दुकानों की कतार में कहीं क्योंकि ब्लैकरिवर के फेफड़े गपशप हैं, और गपशप का स्वाद तब सबसे अच्छा लगता है जब उसमें उन परिवारों का दर्द भी शामिल हो जो चले गए और वापस आ गए क्योंकि दुनिया वो नहीं रखेगी जो वो नहीं चाहती।"
        },
        {
          "id": "page-20-4-hi",
          "pageNumber": 4,
          "content": "पहली रात, एलारा सोफ़े पर सोती है, लेकिन सोफ़ा उसकी पीठ पर नहीं सोता। कपड़े को बरसों की मेहनत ने गर्म किया है और बरसों की धूप ने सुखाया है। सुबह 3:16 बजे, वह समय जब गलतियाँ दस्तक देती हैं, बर्फ़ के फटने से टेलीविज़न की चमक फीकी पड़ जाती है। स्क्रीन पर लगभग ऐसा ही एक कमरा दिखाई देता है—नीले कॉर्नफ़्लावरों की वही पेंटिंग, दरवाज़े पर वही टैक्सीडर्मी बास—लेकिन इस दूसरे लिविंग रूम में, एक कुर्सी पर कोई बैठा है, अपने हाथ धैर्यपूर्वक जोड़े हुए और अपना सिर थोड़ा सा घुमाए हुए, मानो किसी संकेत को सुन रहा हो। उस कमरे की दीवार पर बास अपना मुँह एक बास से ज़्यादा चौड़ा खोलता है, और जो आवाज़ निकलती है वह किसी भारी वस्तु की खरोंच जैसी होती है जिसे हमेशा के लिए गलियारे में घसीटा जा रहा है।\n\nरिमोट इमेज को खराब नहीं कर सकता। पावर बटन झींगुर की तरह क्लिक करता है। वॉल्यूम बार बिना किसी आवाज़ के लड़खड़ाता है, और फिर संगीत धीरे-धीरे सुनाई देता है: वह धुन जो एलारा ने तब सुनी थी जब वह छह साल की थी और उसे बुखार था और उसके पिता का खुरदुरा हाथ उसकी पीठ पर समय बनाए रखता था—व्हाइट रैबिट, विनाइल की सुई ऐसे घिस रही थी मानो चिंता से खोदे गए गड्ढे में गिर गई हो। गाना घूमता ही रहता है, और टेलीविजन वाले कमरे यानी उसके कमरे के कोने में कुर्सी खड़ी हो जाती है।"
        },
        {
          "id": "page-20-5-hi",
          "pageNumber": 5,
          "content": "एलारा प्लग खींच लेती है। घर आह भरता है और अँधेरे को निगल जाता है। कहीं, एक दरवाज़ा धीरे से बंद हो जाता है, एक कोमलता जो किसी ज़ोरदार झटके से भी बदतर है। छिलके के नीचे खट्टे फल की सड़ी हुई गंध है। खिड़की के शीशे पर एक हल्की सी छाप है, मानो किसी ने सोफ़े पर सो रही महिला को देखने के लिए अपना चेहरा वहाँ दबाया हो और फिर विनम्रता से पीछे हट गया हो, और बेहतर समय पर वापस आने का वादा किया हो।\n\nसूर्योदय के समय, एलारा तथ्यों का लेखा-जोखा रखती है। तथ्य प्रकाशस्तंभ होते हैं; वे जहाजों को भले ही न बचाएँ, लेकिन वे ईमानदार नक्शे ज़रूर बनाते हैं। तथ्य: उसके पिता लापता हैं, और दाग खून का नहीं है। तथ्य: ब्लैकरिवर के रिकॉर्ड क्लर्क का कहना है कि यह घर 1893 में लोम नाम के एक धर्मगुरु ने बनवाया था, जिन्होंने गरीबों के लिए अपना दरवाज़ा खोला और जब गरीब दस्तक देना बंद नहीं करते थे, तो उसे बंद कर दिया। तथ्य: रेन स्ट्रीट पर सर्वेक्षण रेखाएँ तीस सालों में तीन बार बदलीं, मानो ज़मीन अपने किनारों के प्रति समर्पित ही न हो।"
        },
        {
          "id": "page-20-6-hi",
          "pageNumber": 6,
          "content": "वह क्लर्क, मिसेज़ कैरोवे, से मिलने जाती है, जिनसे लैवेंडर के पैकेट और एक्सपायर हो चुकी कैंडी की गंध आती है और जो एलारा की आँखों में एक पल से ज़्यादा नहीं देखतीं। \"तुम्हारी माँ ने कभी नियम नहीं सीखे,\" मिसेज़ कैरोवे एक पार्सल पर मुहर लगाते हुए कहती हैं, जिस पर मुहर लगाने की ज़रूरत नहीं है। \"तुम्हारे पिता बेहतर थे। उन्होंने घर को खुश रखा। जानते हो एक घर क्या चाहता है? उसे नाम चाहिए। उसे बताया जाना चाहिए कि हर कमरा किस लिए है, ताकि उसे अंदाज़ा न लगाना पड़े। वह अभी अंदाज़ा लगा रही है, प्यारी, और उसकी कल्पनाशक्ति बहुत क्रूर है।\"\n\n“नियम?” एलारा पूछती है।\n\nमिसेज़ कैरोवे की डाक टिकट हकलाती है। \"दहलीज़ पर नमक छिड़को। अटारी में चादर बिछाओ। रात में कभी भी आईना खुला मत छोड़ो; आईना उन मृतकों के लिए द्वार है जो अब खुद को नहीं पहचानते और उन जीवित लोगों के लिए जो इतने घमंडी हैं कि यह स्वीकार नहीं कर पाते कि वे भी दुःख में बाकी लोगों की तरह दिखते हैं। और अगर देर से आने वाले पानी माँगें, तो उन्हें दूध पिलाओ। पानी नावों को याद रखता है। दूध मुँह को याद रखता है।\""
        },
        {
          "id": "page-20-7-hi",
          "pageNumber": 7,
          "content": "एलारा हँसना चाहती है, लेकिन एक कोमल, भयावह एहसास है कि शहर उसके सामने समझदारी का दिखावा कर रहा है। बाहर, फुटपाथों पर गर्मी छाई हुई है और रेलमार्ग किसी पुराने और घमंडी चीज़ की ज़िद से चमक रहा है। वह मुख्य सड़क पर वापस चलती है, उस नाई की दुकान के पास से जिसने एक सदी से भूतों के बाल काटे हैं, उस ढाबे के पास से जहाँ पैनकेक क्रीम से निचोड़ी हुई मुस्कान के साथ आते हैं और जहाँ हर कोई अपनी हथेलियाँ अपने मग पर रखता है मानो गर्मी विरासत में मिली हो, संभाल कर रखी जा सकती हो, बाद के लिए जमा की जा सकती हो।\n\nघर पर, वह दहलीज़ पर नमक छिड़कती है क्योंकि तिरस्कार करना बुद्धिमानी नहीं है और क्योंकि रीति-रिवाज़—चाहे कितने भी मूर्खतापूर्ण हों—उस दिन को स्थिर रख सकते हैं जो अन्यथा ढीला, फड़फड़ाता रहता है। नमक लकड़ी पर पाले की तरह पड़ा है। घर फिर से गुनगुनाता है, एक कंपन जो बेसबोर्ड को परेशान करता है। गुनगुनाहट एक स्वर बन जाती है; स्वर साँस बन जाता है। साँस एक आवाज़ बन जाती है जो एलारा से नहीं, बल्कि सीढ़ियों के ऊपर की हवा से बात करती है: \"यह तैयार है।\""
        },
        {
          "id": "page-20-8-hi",
          "pageNumber": 8,
          "content": "वह चढ़ती है। अटारी की सीढ़ी किसी ऐसे जानवर की तरह खुलती है जो बाद में काटेगा। उसकी खोपड़ी में गर्मी फैलती है, और पुराने कागज़ों और चूहों के घोंसलों की गंध किसी अनजान उपदेश की तरह उठती है। अटारी पारिवारिक जीवन का एक संग्रहालय है—डिब्बों में बंद बच्चों के कपड़े; एक पालना जिसके तकलों ने अपने दांतों में रातों की नींद हराम कर दी है; स्कूल प्रोजेक्ट्स के डिब्बे जहाँ बेकिंग सोडा से ज्वालामुखी फटे थे; ब्लैकरिवर की मुख्य सड़क की वो तस्वीरें जो उस समय की हैं जब उस पर टोपी लगी थी।\n\nदूर कोने में, जहाँ छत एक गुप्त हाथ मिलाने में छत से मिलती है, एक संदूक रखा है जो उनका नहीं है। यह बहुत पुराना है, अपने खंडहर में बहुत सुंदर है, पीतल की फिटिंग धैर्य से हरी हो गई है। जब वह ढक्कन उठाती है, तो वह कमरे से ज़्यादा गर्म होता है। अंदर: वादे के मुताबिक, लिनेन, मुड़ी हुई चादरों का ढेर जिस पर उनके नाम के पहले अक्षर कसे हुए हैं, जो उनके नहीं हैं। लिनेन के नीचे, एक किताब जिसका कवर हथौड़े से पीसे हुए छाल जैसा दिखता है, शीर्षक ऐसी भाषा में लिखा है जिसमें अल्पविरामों का इस्तेमाल दांतों की तरह किया गया है। किताब के नीचे, एक आईना औंधा पड़ा है, जिसका फ्रेम खरोंचा हुआ है। वह रिबन से आईने को बाहर सरकाती है, और राख के एक टुकड़े जैसा पीला एक छोटा सा पतंगा रिबन से गिरकर उसकी कलाई पर आ गिरता है।"
        },
        {
          "id": "page-20-9-hi",
          "pageNumber": 9,
          "content": "एलारा शीशा नहीं घुमाती। बल्कि, वह किताब उठाती है। पन्ने सख्त हैं, कागज़ नहीं, मानो किसी बनी हुई चीज़ से ज़्यादा उगाई गई हो। पहले पन्ने पर बड़े अक्षरों में \"ड्राफ्ट और दरवाज़े का घरेलू संस्कार\" लिखा है। इस संस्कार के अनुसार, शाम होते ही हर दरवाज़े का नाम और सुबह होते ही हर खिड़की का नंबर लिखना ज़रूरी है, वरना घर अपनी खुद की अंक-विद्या सीखेगा और पीछे की ओर गिनती करेगा, मृत से जीवित तक, जब तक कि वह उस संख्या तक न पहुँच जाए जो उसे सबसे ज़्यादा पसंद है: एक। एक बंदी है।\n\nदूसरे पृष्ठ पर दीवारों का एक चित्र है, लेकिन दीवारें पसलियों की तरह, एक सीढ़ी रीढ़ की हड्डी की तरह, और एक तहखाना घड़ों से भरा हुआ है, जिनमें से प्रत्येक पर एक महीना और एक साल लिखा है। शीर्षक: रखरखाव के आदेश। घर को कोमलता सिखाने के लिए घड़ों में पतंगे रखें। वफादारी सिखाने के लिए घड़ों में बाल रखें। दुःख सिखाने के लिए घड़ों में बारिश रखें।"
        },
        {
          "id": "page-20-10-hi",
          "pageNumber": 10,
          "content": "वह किताब बंद कर देती है। पतंगा उठता है, अपनी कलाई पर पाउडर फेंकता है, और गर्मी में गायब हो जाता है। कहीं नीचे, एक नल खुलता और बंद होता है। एक बूँद सिंक का बेदाग़ भजन गाती है। एलारा फ़र्श के झुकने या दीवारों के अलग होने का इंतज़ार करती है। अटारी पसीने से तर-बतर, धैर्यवान बनी रहती है। धैर्यवान लोग सबसे बुरे होते हैं; वे पहले ही आपके साहस को अपने दिमाग़ में खत्म कर चुके होते हैं।\n\nब्लैकरिवर में किंवदंतियाँ हैं, हालाँकि शहर उन्हें ऐसा नहीं कहता। लोग कहते हैं कि उपदेशक लोम की मृत्यु नहीं हुई; उन्होंने अपने चर्च के क्रॉलस्पेस में जाकर और फर्श के नीचे जो कुछ भी इंतज़ार कर रहा था, उसे लगातार एक उपदेश देकर अपनी मृत्यु का इलाज किया। जब फर्श पेट की तरह फूल गया, तो मण्डली चली गई, और लोम की आवाज़, जिसने माताओं और डरे हुए लड़कों को दिलासा दिया था, उलट गई और एक कप के नीचे मक्खी को पकड़ने जैसी आवाज़ बन गई—दुनिया की सीमाओं के खिलाफ विश्वास की सुस्त, लगातार थपथपाहट। वे कहते हैं कि उपदेश बंद नहीं हुआ है। वे कहते हैं कि रेन स्ट्रीट पर घर बची हुई लकड़ी से बनाया गया था।"
        },
        {
          "id": "page-20-11-hi",
          "pageNumber": 11,
          "content": "एलारा दोपहर का समय ढाबे पर बिताती है, ब्लैकरिवर गज़ेट के पुराने अंक पढ़ती है, जहाँ बाढ़ का महत्व होता था, और धुले हुए बालों वाली लड़कियों को प्याज और विजय की खुशबू वाले तहखानों में ताज पहनाया जाता था। क्लासीफाइड में उसे 1974 का एक विज्ञापन मिलता है: चाहिए: औपचारिक गद्दियों पर मुंह बंद करने के लिए दर्जिन; कोई अनुभव ज़रूरी नहीं; हम तुम्हें भजन सिखाएँगे।\n\nरात में, कमरे अपनी-अपनी भूमिका पर अड़े रहते हैं। रसोई ज़ोर देकर कहती है कि यह एक ज़ख्म है जिसे ढकना चाहिए। दालान ज़ोर देकर कहता है कि यह अस्पताल का गलियारा है जहाँ बीमारों को खाँसने में शर्म आती है। बाथरूम ज़ोर देकर कहता है कि यह एक स्वीकारोक्ति कक्ष है और शीशे पर धुंध लगाकर उस चेहरे को छुपाता है जो अपने पाप स्वीकार नहीं करता। शयनकक्ष ज़ोर देकर कहता है कि उसे एक आदमी याद है जो लेट गया था और एक आकृति छोड़ गया था, जो अशिष्टता है।"
        },
        {
          "id": "page-20-12-hi",
          "pageNumber": 12,
          "content": "एलारा एक ऐसी याद का सपना देखती है जो उसकी नहीं है: एक बच्चा, चिंता जितना छोटा, सीढ़ियों को उलटा गिन रहा है जैसा किताब में नहीं बताया गया था, तेरह-तेरह, और अचानक सीढ़ियों के नीचे एक दरवाज़ा खुलता है, घर का निचला हिस्सा ऐसे उफन रहा है जैसे कोई मछली नदी से गर्म हवा में खींचे जाने पर उफनती है। उस मुँह के अंदर, पतंगे के पंखों से बजते हुए घड़े, काँच से टकराकर बारिश की बूँदें, और बाल किसी और की चोटी में गुँथे हुए हैं।\n\nवह अपने दांतों में काँच का स्वाद लिए जागती है। ट्रंक से निकला आईना अलमारी से टिका हुआ है, अब खुला हुआ, जो उसने नहीं किया था। उसका प्रतिबिंब आधा सेकंड देर से आता है। जब वह अपना हाथ हिलाती है, तो प्रतिबिंबित हाथ हिचकिचाता है, एक शर्मीली जुड़वाँ। जब वह बोलती है, तो उसका प्रतिबिंब शुरू करने के लिए अपने होंठ गीला करता है, लेकिन एलारा पहले ही खत्म कर चुकी होती है। प्रतिबिंब के पीछे, अलमारी के अंदर का अँधेरा एक अलमारी से कहीं ज़्यादा गहरा लगता है, मानो कोट पेड़ हों और जूते नदी के किनारे पत्थर हों जो कल तक वहाँ नहीं थे।"
        },
        {
          "id": "page-20-13-hi",
          "pageNumber": 13,
          "content": "एलारा शीशे को तकिये के गिलाफ़ से ढक देती है। तकिये का गिलाफ़ ऐसे धँसता है मानो अंदर से कोई चेहरा बाहर की ओर दबा हो। वह तकिये के गिलाफ़ को कसकर बाँध देती है। वह अलमारी की चौखट पर नमक छिड़कती है जिससे नमक का रंग गहरा हो जाता है और वह चीनी जैसा हो जाता है जो मीठी होने का नाम ही नहीं ले रही। वह दरवाज़ों के नाम और खिड़कियों पर नंबर लिखती है और दीवार से कान लगाकर धीरे से कहती है, \"हम अपनी तकलीफ़ में अकेले नहीं हैं। अगर तुम जानते हो तो दयालु बनो।\"\n\nकभी-कभी, दयालुता ही एकमात्र ऐसी अपवित्रता होती है जो काम करती है।\n\nघर एक-एक करके दीये बुझाकर जवाब देता है, मानो किसी महत्वपूर्ण कार्यक्रम के लिए थिएटर को नीचे कर दिया गया हो। फर्श पर लगे तख्ते एक क्रम में क्लिक करते हैं जो किसी कोड जैसा लगता है। वह तहखाने के दरवाज़े तक क्लिक की आवाज़ का पीछा करती है, जिसे उस साल पेंट करके बंद कर दिया गया था जब वह नौ साल की हुई थी क्योंकि उसकी माँ ने कसम खाई थी कि उसने सीढ़ियों पर एक औरत को नंगे पाँव खड़े होकर ऐसे मुस्कुराते देखा था जैसे मुस्कुराना एक हथियार हो। एलारा के नाखूनों को पेंट में पुरानी दरारें मिल जाती हैं। पेंट हमेशा की तरह ज़िद्दी चीज़ों को दर्शाता है: एक साथ, मानो दो बार पूछे जाने पर बुरा मान गई हो।"
        },
        {
          "id": "page-20-14-hi",
          "pageNumber": 14,
          "content": "तहखाना अपनी ठंडक छोड़ रहा है, और हवा में गीले सिक्कों और लंबे समय से सर्द पड़े सेबों की खुशबू आ रही है। एक ज़ंजीर विराम चिह्न की तरह लटक रही है, और जब वह उसे खींचती है, तो बल्ब झपकता है और रुक जाता है और तहखाना अपने आप व्यवस्थित हो जाता है—खाद्य पदार्थों से भरी अलमारियाँ, एक टूटा हुआ घोड़ा, सजावट के डिब्बे जो बच्चों को खुशी और डर दोनों सिखाते हैं, फर्श पर चाक की एक रेखा जहाँ कभी किसी ने ऊँचाई और उम्मीद नापी थी। पीछे, पत्थर की एक दीवार। पत्थर में किसी ने एक दरवाज़ा जड़ दिया था जिसका आकार दरवाज़े जैसा था, सिर्फ़ इसलिए क्योंकि उन्हें अभी तक पता नहीं चला था कि घर में मुँह पसंद किए जाते हैं।\n\nवह घुटनों के बल बैठ जाती है। दरवाज़े पर एक जंग लगा हुआ ताले का छेद है, जिस पर साँस छोड़ते ही वह आहें भरती है, और एक फुसफुसाहट अंदर से आती है, कमरे से भी ज़्यादा गर्म, कानों में बोलते हुए मुँह की तरह अंतरंग: \"ए—ला—रा,\" शब्दांश ब्रेड पर जैम की तरह फैले हुए हैं। यह उसके पिता की आवाज़ है, या उसका पूर्वाभ्यास। \"मेरे लिए एक गिलास पानी लाओ,\" फुसफुसाहट कहती है, और बचपन की यादें किसी प्रशिक्षित जानवर की तरह उछल पड़ती हैं—गर्मियों की रातों में उसके पिता की आवाज़, जब प्यास नाटक हुआ करती थी और रसोई एक मंच जहाँ उसने दया सीखी थी। \"मेरे लिए एक गिलास पानी लाओ।\""
        },
        {
          "id": "page-20-15-hi",
          "pageNumber": 15,
          "content": "वह लगभग उसका नाम बोल ही देती है। ऊपर रखी किताब उसके विचारों पर भारी पड़ रही है। अगर देर से आने वाले पानी माँगें, तो उन्हें दूध दे दो। पानी नावों को याद रखता है। दूध मुँहों को याद रखता है। वह ऊपर जाती है, तहखाने की ठंड में पसीने से तर एक गिलास दूध लेकर लौटती है, और उसे ज़मीन पर रख देती है जहाँ चाक गाढ़ा हो गया है। \"पी लो,\" वह सिलाई से कहती है।\n\nदूध पलक झपकते ही खट्टा हो जाता है, और उसकी त्वचा पर एक परत जम जाती है जो दरवाज़े की तरफ़ रेंगती है मानो उसे पता हो कि मुँह कहाँ हैं। घर में देर तक कराहती आवाज़ें गूंजती हैं, एक चर्च का ऑर्गन जिसकी पाइप टूटी है, और बल्ब मंद और फूलता है, मंद और फूलता है, दिल, दिल, दिल। दरवाज़े के पीछे, कोई चीज़ एक बार चाटती है, जैसे कोई अश्लील धन्यवाद हो। \"अच्छी लड़की,\" पिता की आवाज़ कहती है, और यह वाक्य एलारा के पेट में उतर जाता है और वहीं जम जाता है क्योंकि यह एक ऐसा वाक्य है जो हमेशा प्यार से भरा रहा है, और यहाँ यह नंगा और गलत है।"
        },
        {
          "id": "page-20-16-hi",
          "pageNumber": 16,
          "content": "अगले दिन, वह उन लोगों को खोजती है जो इतने लंबे समय तक जीवित रहे हैं कि दिखावा करना बंद कर दें। ब्लैकरिवर के पास एक दर्जिन है जो कभी समारोहों के गद्दों पर मुंह सिलती थी और जो अब सुई को हाथ नहीं लगाती क्योंकि, वह कहती है, \"आप एक चीज़ को बंद करके सीते हैं और दुनिया को इस्तेमाल करने का दूसरा रास्ता मिल जाता है।\" एक समूह है जो वीएफडब्ल्यू हॉल के पीछे मिलता है और खुद को द कीपर्स ऑफ ऑर्डर्स कहता है; वे तौलिए में लिपटे जार लाते हैं और उन्हें व्यंजनों की तरह आदान-प्रदान करते हैं, बालों के लिए बारिश, सांसों के लिए पतंगे। \"आप गलत चीज़ रख रही हैं,\" एक आदमी एलारा से कहता है। \"आप अपने पिता को बाहर रख रही हैं। आपको उन्हें तब तक अंदर रखना चाहिए, जब तक उन्हें अपने शरीर की याद न आ जाए\n\nरातें लंबी और आविष्कारशील होती जा रही हैं। परछाइयाँ बिना शरीर के चलने का अभ्यास कर रही हैं। रेफ्रिजरेटर की गुनगुनाहट एक फुसफुसाहट में बदल जाती है जो डर के विलोम स्वर से प्रसन्न होकर उसका नाम आगे-पीछे सीखती है। दरवाज़े के ऊपर बास अपना मुँह और चौड़ा कर लेती है, और छोटे-छोटे पतंगे अंदर उड़ आते हैं, बाहर नहीं। तकिये के खोल में लगे शीशे से कुछ टपकता है जो सूखकर दाँतों के रंग की पपड़ी बन जाता है। सीढ़ियों के नीचे रखे जार अपने लेबल फिर से व्यवस्थित करते हैं, महीने सालों को, साल उसकी उम्र को।"
        },
        {
          "id": "page-20-17-hi",
          "pageNumber": 17,
          "content": "साँस और शब्द के बीच कहीं, शहर की पुरानी सीमाएँ हिल रही हैं। घर शिकायत कर रहे हैं। बरामदे छज्जों के पास झुक रहे हैं। ब्लैकरिवर के किनारे बसा जंगल साँस छोड़ता है और हर रात एक घंटे के लिए सड़क भूल जाता है। ट्रेनें बिना किसी घटना के गुज़र जाती हैं, लेकिन कोई उन्हें सुनता नहीं; शहर कुछ और सुन रहा है—धरती के बेस रजिस्टर में एक धीमा, धैर्यपूर्ण उपदेश, एक ऐसा उपदेश जो एक ऐसे पूर्ण अंत का वादा करता है कि किसी को फिर कभी किसी को माफ़ नहीं करना पड़ेगा।\n\nएलारा रोज़ दरवाज़ों के नाम लिखती है। वह खिड़कियों से ऐसे बात करती है मानो वे बच्चे हों जिन्हें तस्वीर खिंचवाने के लिए शांत बैठने को कहा गया हो। वह अटारी में चादरें और तहखाने में दूध पिलाती है। वह घर को एक कहानी सुनाती है: एक बार एक लड़की चली गई क्योंकि जाना ही दिल की परीक्षा है। एक बार एक पिता था जिसने एक लड़की को अंधेरे तहखानों से न डरने की शिक्षा दी क्योंकि वह नहीं जानता था कि तहखाने बिना प्यार के भी परिवार के स्वरूप को समझ सकते हैं और उसकी प्रतिध्वनि कर सकते हैं। एक बार एक शहर था जिसने तय किया कि ज़ख्म भरने से ज़्यादा भूख का सम्मान करना आसान है।"
        },
        {
          "id": "page-20-18-hi",
          "pageNumber": 18,
          "content": "घर सुनता है। घर छत के पास एक नई सिलाई तोड़कर जवाब देता है। एक आवाज़—जो उसके पिता की नहीं है—फुसफुसाती हुई आती है, जो बोलियों से भरी हुई है। \"हम तुमसे प्यार कर सकते हैं,\" वह कहती है। \"हमने यह तुम्हारी तस्वीरों से सीखा है। हमने तुम्हारे शीशों पर अभ्यास किया है। तुम्हारी माँ की लोरियों से हमने अपना गला नरम किया है।\" आवाज़ क्रूर नहीं है। यह और भी बुरा है।\n\nवह किताब नीचे ले जाती है। वह आखिरी पन्ने खोलती है, जहाँ स्याही पतली हो जाती है और हाथ काँपने लगते हैं। आखिरी निर्देश सरल है, लगभग घरेलू: अगर घर अपनी भूख नहीं भूलता, तो उसे अपने प्रतिबिंब से वंचित कर दो। किसी भी कमरे का नाम मत बताओ। सभी शीशे ढक दो। दरवाज़े थोड़े खुले छोड़ दो। हर दिन थोड़ा-थोड़ा हिलो। जो घर अपने किनारों को नहीं ढूँढ पाता, वह शर्मिंदा होकर खुद को खा जाता है।\n\nएलारा इसके साथ भूखी रह सकती है, या इसे खिला भी सकती है। वह लिविंग रूम में खड़ी है, जो एक घाव है, और उन चीज़ों के नाम नहीं बताती जिन्हें वह पसंद करती है। मेज़, नामहीन। घड़ी, नामहीन। कुर्सी, नामहीन। खिड़की, नामहीन। वह चादरें बाँधती है और हर परावर्तक चीज़ पर पर्दा डालती है, जब तक कि घर एक बिगड़ी हुई दुल्हन न बन जाए। वह हर दरवाज़ा खोलती है। वह हर दराज़ खोलती है। वह घर को इतना भर देती है कि मुँह में कुछ भी नहीं आता।"
        },
        {
          "id": "page-20-19-hi",
          "pageNumber": 19,
          "content": "सुबह 3:16 बजे, वह घड़ी जब गलतियाँ दस्तक देती हैं, कुछ धैर्य खो देता है। टेलीविजन पर अर्थों का एक सफ़ेद बर्फ़ीला तूफ़ान सा बज रहा है। दरवाज़े के ऊपर बजने वाली बास दाँत पीस रही है। तहखाने का दरवाज़ा ऐसे काँप रहा है मानो कोई विशाल हाथ उसे प्यार से सहला रहा हो, उठाने की तैयारी में। छत की सिलवटें फट जाती हैं, और वह आवाज़ जिसने अपनी लोरियों से प्रेम का अभ्यास किया है, लगभग कोमलता से कहती है, \"बस। हम तुम्हें वैसे ही ले जाएँगे जैसे हमने बाकियों को लिया था। हम तुम्हारा रूप एक बिस्तर पर छोड़ देंगे ताकि विनम्र लोगों को चेतावनी दी जा सके।\"\n\nएलारा तकिये के खोल में लिपटा आईना उठाती है, और एक पल के लिए वह फिर से बच्ची बन जाती है, एक सोती हुई बिल्ली को गोद में लिए हुए और उसे जगाना नहीं चाहती। वह तहखाने की ओर जाती है, जहाँ दूध दरार में रेंगकर दूसरी त्वचा की तरह सूख गया है। चाक की रेखा क्षितिज की तरह चमकीली है। वह घुटनों के बल बैठती है और आईने को, मुँह-यानी दरवाज़े के सामने, ऊपर की ओर करके रख देती है। तकिये का खोल साँस की तरह ऊपर उठता है। आईना वही दिखाता है जो उसे दिखाना चाहिए—सीढ़ियों के पीछे सीढ़ियाँ, कमरे के आगे एक कमरा, और उस चमक में एक आदमी की आकृति जो उसके पिता जैसा दिखता है अगर प्यार एक पोशाक होती जिसे लोग शादियों और अंत्येष्टि में पहनते थे।"
        },
        {
          "id": "page-20-20-hi",
          "pageNumber": 20,
          "content": "आकृति पास झुकती है। बाल धागे की तरह पतले। आँखें रिहर्सल से चमक रही हैं। \"अच्छी लड़की,\" वह फिर कहता है, और इस बार यह वाक्य माफ़ी मांग रहा है। \"अपनी आँखें बंद करो।\" एलारा उन्हें खुला छोड़ देती है। आईने में एलारा नहीं दिखती। वह जहाँ होनी चाहिए वहाँ एक खिड़की दिखती है, और खिड़की से एक बगीचा दिखता है जहाँ पतंगे दूध पर ऐसे बैठे हैं जैसे कोहरे पर जहाज़ हों और जहाँ कोई चादरें टांग रहा है जो साँस लेने जैसी हिलती हैं। बगीचा उनका नहीं है, लेकिन हो सकता है।\n\nवह आईने में दिख रहे पिता से बात करती है। \"खा लो,\" वह घर से कहती है। \"तुम अपनी आकृति किसी से भी बेहतर जानते हो।\" ऊपर से उसकी आवाज़ सिसक रही है, एक कोमल बच्चे जैसी आवाज़। दीवारें काँप रही हैं। दरवाज़े का मुँह सिकुड़ रहा है। रोशनी उभर रही है। आईना ऐसे लहरा रहा है जैसे तालाब में सिक्का उछाला गया हो। और आईने में, बगीचे में, चादरें जकड़ जाती हैं और स्थिर हो जाती हैं, और उनके पीछे एक घर की छवि उभरती है, जिसके स्टड और जॉइस्ट पसलियों में बदल गए हैं और अंदर का अँधेरा दोपहर तक खुला पड़ा है।"
        },
        {
          "id": "page-20-21-hi",
          "pageNumber": 21,
          "content": "फिर शीशा टूट जाता है, टुकड़ों में नहीं, बल्कि छिलकों में, जैसे किसी बीमार पेड़ की छाल उखड़ गई हो। यह आवाज़ एक चीख़ की तरह है जिसे एलारा घर समझती है। तहखाना साँस लेता है और सन्नाटे में डूब जाता है। ऊपर कहीं, टेलीविज़न मान लेता है कि वहाँ दिखाने के लिए कभी कोई कार्यक्रम नहीं था और धीरे-धीरे बंद हो जाता है। दरवाज़े के ऊपर से बजने वाला बास आखिरकार अपना लकड़ी का मुँह बंद कर लेता है।\n\nसुबह ब्लैकरिवर में कोई बदलाव नहीं दिखता। गर्मी से बरामदे झपकते हैं। लोग दिखावा करते हैं कि रेल अभी भी रुकी हुई है। भोजनालय में, श्रीमती कैरोवे अखबार मोड़ती हैं और पहला पन्ना नहीं पढ़तीं, जहाँ रेन स्ट्रीट की एक तस्वीर में एक घर दिखाई दे रहा है जो कल की तुलना में थोड़ा छोटा लग रहा है, मानो गला घोंटने के दृश्य से शर्मिंदा हो।"
        },
        {
          "id": "page-20-22-hi",
          "pageNumber": 22,
          "content": "एलारा शीशे के छिलकों को एक कागज़ के थैले में इकट्ठा करती है। वे तीखे नहीं होते। वे पतंगे के पंखों जैसे मुलायम होते हैं और उनमें दूध की हल्की सी गंध आती है। वह उन्हें शहर के किनारे ले जाती है, जहाँ जंगल अपनी हरी-भरी साँसें छोड़ रहा है और सड़क रात में खुद को भूल गई है। वह थैला खोलती है और छिलकों को खाई में हिलाती है, और पतंगे उनमें से ऐसे निकलते हैं जैसे संयोग से छूटे हुए रहस्य हों। पेड़ इस भेंट को वैसे ही स्वीकार करते हैं जैसे पेड़ मौसम को स्वीकार करते हैं: बिना धन्यवाद के, बिना द्वेष के, धैर्य के साथ।\n\nवह घर लौटती है। वह एक ऐसे आदमी के लिए नाश्ता बनाती है जो यहाँ नहीं है, एक औरत के लिए कप परोसती है जो सालों पहले चली गई थी और अब नहीं रही, एक लड़की के लिए खिड़की खोलती है जो शीशे से मुँह सटाए कारों को दुआओं की तरह गिनती थी। घर शांत है। ठीक नहीं हुआ—घर कभी ठीक नहीं होते। लेकिन यह एक ऐसा जानवर है जो दोपहर में शिकार करने के लिए बहुत थका हुआ है, और दोपहर ही उसे देना है।"
        },
        {
          "id": "page-20-23-hi",
          "pageNumber": 23,
          "content": "शहर के उस पार, वीएफडब्ल्यू हॉल के पीछे, व्यवस्था के रखवाले अपने घड़े खोल रहे हैं और बारिश में उलझे बालों और कपड़े से बने मुँह पर पतंगों को बैठने दे रहे हैं। कोई ऐसे हँस रहा है जैसे राहत तब हँसती है जब उसे अपनी कीमत का एहसास ही नहीं होता। कोई और कहता है, \"चुप रहो,\" क्योंकि ब्लैकरिवर फिर से सुन रहा है—उपदेश नहीं, बल्कि वो आम आवाज़ें जो लोगों को नासमझी भरे समय में दरवाज़ा खोलने से रोकती हैं।\n\nरात आएगी। घड़ी दस्तक देगी। घर परिवार के स्वाद को याद करेगा और प्यार को एक उपकरण में बदल देगा। एलारा दरवाज़ों के नाम बदल देगी और खिड़कियों पर नंबर लगा देगी, और कुछ शामों में जब दीये की रोशनी दयालु और हिम्मत सस्ती होती है, बरामदे में बैठकर शहर को एक लड़की की कहानी सुनाएगी जो चली गई और वापस आकर अपने घर को एक नई भूख सिखा गई: एक ऐसी भूख जहाँ दुःख नमकीन हो जाता है, दर्पण परदे पड़ जाते हैं, और एक मुँह भूखे रहने की दया सीखता है।"
        }
    ]
    },
    "hinglish": {
      "title": "",
      "description": "",
      "pages": [
        {
          "id": "page-1-1-hn",
          "pageNumber": 1,
          "content": ""
        },
        {
          "id": "page-1-2-hn",
          "pageNumber": 2,
          "content": ""
        },
        {
          "id": "page-1-3-hn",
          "pageNumber": 3,
          "content": ""
        },
        {
          "id": "page-1-4-hn",
          "pageNumber": 4,
          "content": ""
        },
        {
          "id": "page-1-5-hn",
          "pageNumber": 5,
          "content": ""
        },
        {
          "id": "page-1-6-hn",
          "pageNumber": 6,
          "content": ""
        },
        {
          "id": "page-1-7-hn",
          "pageNumber": 7,
          "content": ""
        },
        {
          "id": "page-1-8-hn",
          "pageNumber": 8,
          "content": ""
        },
        {
          "id": "page-1-9-hn",
          "pageNumber": 9,
          "content": ""
        },
        {
          "id": "page-1-10-hn",
          "pageNumber": 10,
          "content": ""
        },
        {
          "id": "page-1-11-hn",
          "pageNumber": 11,
          "content": ""
        },
        {
          "id": "page-1-12-hn",
          "pageNumber": 12,
          "content": ""
        },
        {
          "id": "page-1-13-hn",
          "pageNumber": 13,
          "content": ""
        },
        {
          "id": "page-1-14-hn",
          "pageNumber": 14,
          "content": ""
        },
        {
          "id": "page-1-15-hn",
          "pageNumber": 15,
          "content": ""
        },
        {
          "id": "page-1-16-hn",
          "pageNumber": 16,
          "content": ""
        },
        {
          "id": "page-1-17-hn",
          "pageNumber": 17,
          "content": ""
        },
        {
          "id": "page-1-18-hn",
          "pageNumber": 18,
          "content": ""
        },
        {
          "id": "page-1-19-hn",
          "pageNumber": 19,
          "content": ""
        },
        {
          "id": "page-1-20-hn",
          "pageNumber": 20,
          "content": ""
        },
        {
          "id": "page-1-21-hn",
          "pageNumber": 21,
          "content": ""
        },
        {
          "id": "page-1-22-hn",
          "pageNumber": 22,
          "content": ""
        },
        {
          "id": "page-1-23-hn",
          "pageNumber": 23,
          "content": ""
        },
        {
          "id": "page-1-24-hn",
          "pageNumber": 24,
          "content": ""
        },
        {
          "id": "page-1-25-hn",
          "pageNumber": 25,
          "content": ""
        },
        {
          "id": "page-1-26-hn",
          "pageNumber": 26,
          "content": ""
        },
        {
          "id": "page-1-27-hn",
          "pageNumber": 27,
          "content": ""
        },
        {
          "id": "page-1-28-hn",
          "pageNumber": 28,
          "content": ""
        },
        {
          "id": "page-1-29-hn",
          "pageNumber": 29,
          "content": ""
        },
        {
          "id": "page-1-30-hn",
          "pageNumber": 30,
          "content": ""
        },
        {
          "id": "page-1-31-hn",
          "pageNumber": 31,
          "content": ""
        },
        {
          "id": "page-1-32-hn",
          "pageNumber": 32,
          "content": ""
        },
        {
          "id": "page-1-33-hn",
          "pageNumber": 33,
          "content": ""
        },
        {
          "id": "page-1-34-hn",
          "pageNumber": 34,
          "content": ""
        },
        {
          "id": "page-1-35-hn",
          "pageNumber": 35,
          "content": ""
        },
        {
          "id": "page-1-36-hn",
          "pageNumber": 36,
          "content": ""
        },
        {
          "id": "page-1-37-hn",
          "pageNumber": 37,
          "content": ""
        },
        {
          "id": "page-1-38-hn",
          "pageNumber": 38,
          "content": ""
        },
        {
          "id": "page-1-39-hn",
          "pageNumber": 39,
          "content": ""
        },
        {
          "id": "page-1-40-hn",
          "pageNumber": 40,
          "content": ""
        },
        {
          "id": "page-1-41-hn",
          "pageNumber": 41,
          "content": ""
        },
        {
          "id": "page-1-42-hn",
          "pageNumber": 42,
          "content": ""
        },
        {
          "id": "page-1-43-hn",
          "pageNumber": 43,
          "content": ""
        },
        {
          "id": "page-1-44-hn",
          "pageNumber": 44,
          "content": ""
        },
        {
          "id": "page-1-45-hn",
          "pageNumber": 45,
          "content": ""
        },
        {
          "id": "page-1-46-hn",
          "pageNumber": 46,
          "content": ""
        },
        {
          "id": "page-1-47-hn",
          "pageNumber": 47,
          "content": ""
        },
        {
          "id": "page-1-48-hn",
          "pageNumber": 48,
          "content": ""
        },
        {
          "id": "page-1-49-hn",
          "pageNumber": 49,
          "content": ""
        },
        {
          "id": "page-1-50-hn",
          "pageNumber": 50,
          "content": ""
        },
        {
          "id": "page-1-51-hn",
          "pageNumber": 51,
          "content": ""
        },
        {
          "id": "page-1-52-hn",
          "pageNumber": 52,
          "content": ""
        },
        {
          "id": "page-1-53-hn",
          "pageNumber": 53,
          "content": ""
        },
        {
          "id": "page-1-54-hn",
          "pageNumber": 54,
          "content": ""
        },
        {
          "id": "page-1-55-hn",
          "pageNumber": 55,
          "content": ""
        },
        {
          "id": "page-1-56-hn",
          "pageNumber": 56,
          "content": ""
        },
        {
          "id": "page-1-57-hn",
          "pageNumber": 57,
          "content": ""
        },
        {
          "id": "page-1-58-hn",
          "pageNumber": 58,
          "content": ""
        },
        {
          "id": "page-1-59-hn",
          "pageNumber": 59,
          "content": ""
        },
        {
          "id": "page-1-60-hn",
          "pageNumber": 60,
          "content": ""
        },
        {
          "id": "page-1-61-hn",
          "pageNumber": 61,
          "content": ""
        },
        {
          "id": "page-1-62-hn",
          "pageNumber": 62,
          "content": ""
        },
        {
          "id": "page-1-63-hn",
          "pageNumber": 63,
          "content": ""
        },
        {
          "id": "page-1-64-hn",
          "pageNumber": 64,
          "content": ""
        },
        {
          "id": "page-1-65-hn",
          "pageNumber": 65,
          "content": ""
        },
        {
          "id": "page-1-66-hn",
          "pageNumber": 66,
          "content": ""
        },
        {
          "id": "page-1-67-hn",
          "pageNumber": 67,
          "content": ""
        },
        {
          "id": "page-1-68-hn",
          "pageNumber": 68,
          "content": ""
        },
        {
          "id": "page-1-69-hn",
          "pageNumber": 69,
          "content": ""
        },
        {
          "id": "page-1-70-hn",
          "pageNumber": 70,
          "content": ""
        },
        {
          "id": "page-1-71-hn",
          "pageNumber": 71,
          "content": ""
        },
        {
          "id": "page-1-72-hn",
          "pageNumber": 72,
          "content": ""
        },
        {
          "id": "page-1-73-hn",
          "pageNumber": 73,
          "content": ""
        },
        {
          "id": "page-1-74-hn",
          "pageNumber": 74,
          "content": ""
        },
        {
          "id": "page-1-75-hn",
          "pageNumber": 75,
          "content": ""
        },
        {
          "id": "page-1-76-hn",
          "pageNumber": 76,
          "content": ""
        },
        {
          "id": "page-1-77-hn",
          "pageNumber": 77,
          "content": ""
        },
        {
          "id": "page-1-78-hn",
          "pageNumber": 78,
          "content": ""
        },
        {
          "id": "page-1-79-hn",
          "pageNumber": 79,
          "content": ""
        },
        {
          "id": "page-1-80-hn",
          "pageNumber": 80,
          "content": ""
        },
        {
          "id": "page-1-81-hn",
          "pageNumber": 81,
          "content": ""
        },
        {
          "id": "page-1-82-hn",
          "pageNumber": 82,
          "content": ""
        },
        {
          "id": "page-1-83-hn",
          "pageNumber": 83,
          "content": ""
        },
        {
          "id": "page-1-84-hn",
          "pageNumber": 84,
          "content": ""
        },
        {
          "id": "page-1-85-hn",
          "pageNumber": 85,
          "content": ""
        },
        {
          "id": "page-1-86-hn",
          "pageNumber": 86,
          "content": ""
        },
        {
          "id": "page-1-87-hn",
          "pageNumber": 87,
          "content": ""
        },
        {
          "id": "page-1-88-hn",
          "pageNumber": 88,
          "content": ""
        },
        {
          "id": "page-1-89-hn",
          "pageNumber": 89,
          "content": ""
        },
        {
          "id": "page-1-90-hn",
          "pageNumber": 90,
          "content": ""
        },
        {
          "id": "page-1-91-hn",
          "pageNumber": 91,
          "content": ""
        },
        {
          "id": "page-1-92-hn",
          "pageNumber": 92,
          "content": ""
        },
        {
          "id": "page-1-93-hn",
          "pageNumber": 93,
          "content": ""
        },
        {
          "id": "page-1-94-hn",
          "pageNumber": 94,
          "content": ""
        },
        {
          "id": "page-1-95-hn",
          "pageNumber": 95,
          "content": ""
        },
        {
          "id": "page-1-96-hn",
          "pageNumber": 96,
          "content": ""
        },
        {
          "id": "page-1-97-hn",
          "pageNumber": 97,
          "content": ""
        },
        {
          "id": "page-1-98-hn",
          "pageNumber": 98,
          "content": ""
        },
        {
          "id": "page-1-99-hn",
          "pageNumber": 99,
          "content": ""
        },
        {
          "id": "page-1-100-hn",
          "pageNumber": 100,
          "content": ""
        },
        {
          "id": "page-1-101-hn",
          "pageNumber": 101,
          "content": ""
        },
        {
          "id": "page-1-102-hn",
          "pageNumber": 102,
          "content": ""
        },
        {
          "id": "page-1-103-hn",
          "pageNumber": 103,
          "content": ""
        },
        {
          "id": "page-1-104-hn",
          "pageNumber": 104,
          "content": ""
        },
        {
          "id": "page-1-105-hn",
          "pageNumber": 105,
          "content": ""
        }
      ]
    }
  }
}
