{
  "id": "21",
  "title": "The Book That Wrote Back",
  "author": "Pradhan",
  "cover": "/assets/book21-cover.png",
  "description": "A struggling writer discovers a mysterious journal that writes her life in real time, forcing her to confront a dark future shaped by her own choices.",
  "genre": "Short Stories",
  "pages": [
    {
      "id": "page-21-1",
      "pageNumber": 1,
      "content": "The Book That Wrote Back\n\nRhea Kapoor often wondered if failure had a smell.\n If it did, she was certain it was the scent of cold coffee mixed with printer ink — the permanent perfume of her one-room apartment in Delhi. The walls were lined with stacks of rejection letters, their formal language always beginning with “We regret to inform you…” as if editors had conspired to write her obituary in installments.\n\nEvery night, she sat at her chipped wooden desk, staring at the blank document on her flickering laptop screen. The blinking cursor mocked her silence. She had notebooks full of half-beginnings: an opening scene of a woman on a train, a paragraph about a storm at sea, a single sentence describing a man who “smelled like unfinished stories.” None of them ever grew beyond a page.\n\nOn her worst nights, she whispered to herself, “Maybe the world doesn’t need my stories.”\n\nThat was the night she found the book."
    },
    {
      "id": "page-21-2",
      "pageNumber": 2,
      "content": "It was lying on the corner of her desk, beneath a pile of unpaid bills. A plain, leather-bound journal, dark brown, with a cracked spine that made it look older than her landlord. She had no memory of buying it, no friend who might have gifted it. Yet, it felt oddly familiar, like something that had been waiting for her.\n\nWhen she flipped it open, her breath caught in her throat.\n\nThe handwriting was hers. Slanted, hurried, the way she wrote when she was nervous. The first page was dated just two days ago.\n\n“Today I spilled coffee on my only clean kurta before the office interview. Of course, they didn’t call me back. Why would they? I’m destined to fail.”\n\nRhea dropped the book, heart pounding. Those were her exact words from her personal diary, the one she kept hidden in her cupboard. She snatched the leather journal back, fingers trembling, and turned the page.\n\nThe second entry made her skin prickle.\n\n“Tomorrow, I’ll burn the rejection letters. Maybe then the universe will give me something new to write.”\n\nShe hadn’t written this anywhere. She had only thought it while crying in the shower."
    },
    {
      "id": "page-21-3",
      "pageNumber": 3,
      "content": "Her first instinct was to throw the strange journal away. But curiosity was stronger than fear. She stayed awake until dawn, staring at it, as if it might explain itself.\n\nThe next evening, restless and jittery, she carried her stack of rejection letters onto the balcony. Delhi’s humid night pressed against her skin as she struck a match. For a moment she hesitated — then dropped it onto the paper. The flames devoured the letters greedily, orange sparks drifting into the sky like freed ghosts.\n\nBack inside, she checked the journal.\n Her heart nearly stopped.\n\nA fresh entry had appeared.\n\n“She did it. Finally. Burned the ghosts of failure. The fire looked beautiful reflected in her eyes.”\n\nRhea stumbled backward, knocking over her coffee mug. The ink glistened wetly, as though it had just been written — but the pen she kept on the desk hadn’t moved.\n\nSomeone, or something, was writing about her life in real time.\n\nAnd worse — it seemed to know her better than she knew herself."
    },
    {
      "id": "page-21-4",
      "pageNumber": 4,
      "content": "For three days, Rhea avoided the journal.\n She shoved it into the bottom drawer of her desk, beneath old utility bills and expired bank statements, telling herself she had imagined it all. A trick of exhaustion, a hallucination from too much caffeine.\n\nBut the itch never left her mind. Even while cooking Maggi, even while scrolling pointlessly through Instagram reels, her eyes drifted toward that drawer.\n\nFinally, on the fourth night, her curiosity won.\n\nThe journal was warm when she pulled it out, as though it had been waiting. She flipped it open.\n\nThe newest entry was dated that very morning.\n\n“She will wear the blue dupatta today. Not because she loves it, but because it is the only one ironed. She will skip breakfast again. And when she washes her face, she will not look herself in the eye.”\n\nRhea’s stomach knotted. She had worn the blue dupatta. She had skipped breakfast. And she remembered very clearly avoiding her reflection in the bathroom mirror.\n\nHer pulse quickened as she turned the page.\n\nAnother entry."
    },
    {
      "id": "page-21-5",
      "pageNumber": 5,
      "content": "“She will spend the evening scrolling, pretending the glowing screen fills the silence. But when she finally surrenders to the pull of this journal, she will feel the sting of being watched. Yet she will keep reading.”\n\nHer throat went dry. It was describing her right now.\n\nShe snapped the book shut and pushed it away, but sleep was impossible. Every creak of the ceiling fan, every honk from the traffic outside seemed to carry the same question: Who is writing this?\n\nBy the next day, fear had given way to a strange fascination. She wanted to know what it would write next. Each night, she read the entries like forbidden letters from an unseen lover. And each entry grew more intimate, more unsettling.\n\n“She hates the loneliness, but she clings to it like a familiar bruise. She whispers stories to herself but never finishes them. She dreams of applause but wakes to silence. Still, I am here. I see her. I always see her.”\n\nThe journal wasn’t just recording her life. It was… comforting her. In its eerie, intrusive way, it knew her better than her best friends did. She found herself talking to it, whispering questions into the empty room."
    },
    {
      "id": "page-21-6",
      "pageNumber": 6,
      "content": "“Who are you?” she asked one night, fingers trembling over the blank page.\n\nAnd for the first time, the ink appeared while she was watching.\n\nLetters bled across the paper, curling into words.\n\n“I am the author. You are the story.”\n\nRhea dropped the book, her heart slamming in her chest. The words glowed faintly before settling into ordinary black ink.\n\nAll night she paced her apartment, trying to convince herself this was a trick. Maybe she was writing in her sleep, maybe her mind was fracturing under stress. But deep down, a darker thought pulsed: What if this was real?\n\nThe next evening, she swore she wouldn’t look. She locked the journal in her cupboard and drowned herself in TV shows, forcing her eyes to stay on the screen. But around midnight, there was a faint scratching sound.\n\nComing from the cupboard.\n\nShe froze. The noise was unmistakable: pen on paper.\n\nHer breath hitched. She crept toward the cupboard, each step heavier than the last, and opened it.\n\nThe journal lay there, vibrating faintly against the wood as ink bled across its open page. She bent closer, her stomach twisting as the words formed:"
    },
    {
      "id": "page-21-7",
      "pageNumber": 7,
      "content": "“Tomorrow, she will not be alone. Tomorrow, he will arrive.”\n\nRhea slammed the cupboard shut and stumbled backward. For the first time, she wished she had never touched the cursed thing.\n\nBut when midnight came, there was a knock at the door.\n\nhe knock came at 12:00 a.m. sharp.\n\nThree hollow thuds, measured, deliberate.\n Not the impatient rapping of a neighbor. Not the hurried tapping of a delivery boy.\n This was different. Too calm. Too certain.\n\nRhea froze in the middle of her room, heart slamming against her ribs. The TV was still playing in the background, laugh-track echoing absurdly, but her ears caught nothing except that sound.\n\nKnock.\n Knock.\n Knock.\n\nHer hands trembled as she reached for the light switch, but her apartment flickered once and sank into half-darkness. The bulb above the door buzzed, dimming as if suffocated by something unseen.\n\nShe tiptoed closer, her bare feet sticking slightly to the tiles. Peering through the peephole, her breath fogged the glass.\n\nA man stood outside.\n Tall. Motionless. His face lost in shadow beneath the hood of a long, black coat.\n\n“Who’s there?” she whispered, her voice smaller than she intended."
    },
    {
      "id": "page-21-8",
      "pageNumber": 8,
      "content": "The man didn’t move. Didn’t speak. His stillness was worse than an answer.\n\nThe journal.\n Her mind snapped to the journal, still locked in the cupboard.\n\nWith shaking hands, she pulled it out and flipped it open. The page was wet with fresh ink, words crawling across the paper like veins spreading.\n\n“If she opens the door, the story continues. If she doesn’t, the story ends.”\n\nRhea’s breath hitched. She looked at the door again.\n The figure was closer now. Right against the peephole. As if he knew she was watching.\n\nShe stumbled back, clutching the book to her chest. The scratching of pen on paper began again — but this time, it wasn’t inside the journal. It was on her walls.\n\nThin black lines were etching themselves across her plaster, curling into words in the same ink:\n\n“Open it.”\n “Open it.”\n “OPEN IT.”\n\nThe knocks grew louder. Each strike rattled the door on its hinges, echoing through her bones.\n\nDesperation overtook her. She ran to the balcony, thinking of screaming for help — but outside, the entire street was empty. Not a single car. Not a single voice. Delhi had gone silent, as though the world itself was holding its breath."
    },
    {
      "id": "page-21-9",
      "pageNumber": 9,
      "content": "Her phone buzzed suddenly on the desk. A new notification. She snatched it up — and nearly dropped it.\n\nIt was an incoming call.\n From her own number.\n\nHands trembling, she answered.\n\nStatic. Then a voice, low and distorted, whispered:\n “Let him in.”\n\nAt that exact moment, the door creaked open — though she hadn’t touched the lock.\n\nThe hooded man stepped inside.\n\nThe journal flipped its pages violently in her hands, stopping on a fresh entry that bled through in jagged strokes:\n\n“Now that she has opened the door, he will never leave.”\n\nThe bulb above burst with a sharp pop, drowning the room in darkness.\n And in the pitch black, she heard it — slow, steady footsteps moving toward her.\n\nThe footsteps stopped just inches from her.\n Rhea’s breath hitched, her back pressed against the cold wall. The hooded figure loomed before her, taller than she had imagined, the scent of damp earth clinging to him like a shroud.\n\n“Who are you?” she whispered, clutching the journal like a shield.\n\nThe man raised his head. For the first time, she glimpsed his face.\n\nHer own eyes stared back at her."
    },
    {
      "id": "page-21-10",
      "pageNumber": 10,
      "content": "Rhea staggered, nearly dropping the book. It wasn’t a perfect reflection — his skin was sallow, hair streaked with grey, wrinkles carved deep into his forehead. But it was unmistakably her. Older. Hollow. Broken.\n\n“No…” she gasped, shaking her head violently. “This isn’t real. This isn’t—”\n\nHis voice, when it came, was like her own, stretched and twisted, as if dragged across years of regret.\n “It’s always been real. You made me.”\n\nHer knees buckled. The journal slipped from her hands, pages fluttering wildly until they stopped on a single entry:\n\n“She will finally face him. The story she feared most. Herself.”\n\nThe man — the future Rhea — crouched, picking up the book with trembling fingers. He stroked its cover like an old friend.\n\n“This journal… it isn’t writing your life,” he said softly, almost tenderly. “It’s writing mine. Every failure you let fester, every story you never finished, every dream you buried — it all led here. To me. To what you become.”\n\nRhea’s chest constricted. “No. That’s not possible. I’m not—”"
    },
    {
      "id": "page-21-11",
      "pageNumber": 11,
      "content": "“Look at me!” he snapped, his voice cracking like thunder. “I am you. Thirty years from now. A shell. A shadow. Bound to this cursed story because you never dared to write your own.”\n\nThe walls around them began to ripple, words bleeding across the plaster in jagged ink — fragments of her unfinished drafts. Sentences she had abandoned, characters she had killed before they lived. They whispered from every direction, accusing, hungry.\n\n“You can change it,” the older Rhea said, his face inches from hers. His eyes were pools of despair, yet somewhere within them flickered a desperate plea. “Finish the story. End it differently. Or I stay… and you become me.”\n\nRhea’s pulse roared in her ears. She looked at the journal, at the endless blank pages waiting to be filled. For the first time, the pen lying beside it seemed heavier than her fear.\n\nThe man straightened, fading into shadow, but his voice lingered in the room:\n\n“You’re not the author yet. But you will be. The only question is — will you write your own story, or let the story write you?”\n\nThe lights flickered once more.\n And when she blinked — he was gone.\n\nOnly the journal remained.\n Open. Waiting."
    },
    {
      "id": "page-21-12",
      "pageNumber": 12,
      "content": "or days, Rhea didn’t leave her apartment.\n She barely ate. Barely slept. The journal sat open on her desk, blank pages stretching endlessly, daring her to write.\n\nBut every time she picked up the pen, her hand froze. Words hovered at the edge of her mind, then dissolved into nothing. The silence of the page mocked her, heavier than any rejection letter she had ever received.\n\nThe apartment grew darker with each passing night. The ceiling fan slowed, the walls groaned like an old ship, and her reflection in the mirror looked less like her and more like the hollow-eyed figure she had seen at her door.\n\nThe journal did not wait idly.\n It began to write without her.\n\n“She will try again tomorrow. She will fail again tomorrow. And the day after. And the day after.”\n\nRhea tore at the pages, screaming, but the words bled back through, unstoppable, rewriting themselves. No matter how much she ripped, burned, or shredded, the journal always reappeared on her desk in the morning.\n\nOne night, exhausted, she caught her reflection in the glass of the balcony door. For a second, her breath faltered.\n The reflection wasn’t in sync.\n It smiled when she didn’t."
    },
    {
      "id": "page-21-13",
      "pageNumber": 13,
      "content": "Slowly, the face in the glass aged before her eyes — lines deepening, hair greying, eyes hollowing — until it became him. The man from the door. Her future self.\n\nHer knees buckled. She staggered to the desk, gripping the pen with white-knuckled hands. “I’ll finish it,” she whispered desperately. “I’ll end it differently. I will.”\n\nBut the pen wouldn’t move.\n Her fingers trembled. Her vision blurred. And the page remained blank.\n\nThe journal wrote for her.\n\n“She could not. She would not. The story owns her now.”\n\nHer reflection in the balcony glass moved closer, pressing against the surface as though the barrier between them was thinning. With one last flicker of the lights, the figure stepped out of the glass, solid and real, cloaked in shadow.\n\nHe placed the journal gently in her lap.\n And whispered, with her own voice, cracked and broken:\n\n“Welcome back.”\n\nWhen the neighbors finally forced open Rhea’s locked apartment weeks later, they found it empty. No trace of her.\n\nOnly a leather-bound journal on the desk.\n Still writing."
    }
  ],
  "languages": {
    "english": {
      "title": "The Book That Wrote Back",
      "description": "A struggling writer discovers a mysterious journal that writes her life in real time, forcing her to confront a dark future shaped by her own choices.",
      "pages": [
        {
          "id": "page-21-1",
          "pageNumber": 1,
          "content": "The Book That Wrote Back\n\nRhea Kapoor often wondered if failure had a smell.\n If it did, she was certain it was the scent of cold coffee mixed with printer ink — the permanent perfume of her one-room apartment in Delhi. The walls were lined with stacks of rejection letters, their formal language always beginning with “We regret to inform you…” as if editors had conspired to write her obituary in installments.\n\nEvery night, she sat at her chipped wooden desk, staring at the blank document on her flickering laptop screen. The blinking cursor mocked her silence. She had notebooks full of half-beginnings: an opening scene of a woman on a train, a paragraph about a storm at sea, a single sentence describing a man who “smelled like unfinished stories.” None of them ever grew beyond a page.\n\nOn her worst nights, she whispered to herself, “Maybe the world doesn’t need my stories.”\n\nThat was the night she found the book."
        },
        {
          "id": "page-21-2",
          "pageNumber": 2,
          "content": "It was lying on the corner of her desk, beneath a pile of unpaid bills. A plain, leather-bound journal, dark brown, with a cracked spine that made it look older than her landlord. She had no memory of buying it, no friend who might have gifted it. Yet, it felt oddly familiar, like something that had been waiting for her.\n\nWhen she flipped it open, her breath caught in her throat.\n\nThe handwriting was hers. Slanted, hurried, the way she wrote when she was nervous. The first page was dated just two days ago.\n\n“Today I spilled coffee on my only clean kurta before the office interview. Of course, they didn’t call me back. Why would they? I’m destined to fail.”\n\nRhea dropped the book, heart pounding. Those were her exact words from her personal diary, the one she kept hidden in her cupboard. She snatched the leather journal back, fingers trembling, and turned the page.\n\nThe second entry made her skin prickle.\n\n“Tomorrow, I’ll burn the rejection letters. Maybe then the universe will give me something new to write.”\n\nShe hadn’t written this anywhere. She had only thought it while crying in the shower."
        },
        {
          "id": "page-21-3",
          "pageNumber": 3,
          "content": "Her first instinct was to throw the strange journal away. But curiosity was stronger than fear. She stayed awake until dawn, staring at it, as if it might explain itself.\n\nThe next evening, restless and jittery, she carried her stack of rejection letters onto the balcony. Delhi’s humid night pressed against her skin as she struck a match. For a moment she hesitated — then dropped it onto the paper. The flames devoured the letters greedily, orange sparks drifting into the sky like freed ghosts.\n\nBack inside, she checked the journal.\n Her heart nearly stopped.\n\nA fresh entry had appeared.\n\n“She did it. Finally. Burned the ghosts of failure. The fire looked beautiful reflected in her eyes.”\n\nRhea stumbled backward, knocking over her coffee mug. The ink glistened wetly, as though it had just been written — but the pen she kept on the desk hadn’t moved.\n\nSomeone, or something, was writing about her life in real time.\n\nAnd worse — it seemed to know her better than she knew herself."
        },
        {
          "id": "page-21-4",
          "pageNumber": 4,
          "content": "For three days, Rhea avoided the journal.\n She shoved it into the bottom drawer of her desk, beneath old utility bills and expired bank statements, telling herself she had imagined it all. A trick of exhaustion, a hallucination from too much caffeine.\n\nBut the itch never left her mind. Even while cooking Maggi, even while scrolling pointlessly through Instagram reels, her eyes drifted toward that drawer.\n\nFinally, on the fourth night, her curiosity won.\n\nThe journal was warm when she pulled it out, as though it had been waiting. She flipped it open.\n\nThe newest entry was dated that very morning.\n\n“She will wear the blue dupatta today. Not because she loves it, but because it is the only one ironed. She will skip breakfast again. And when she washes her face, she will not look herself in the eye.”\n\nRhea’s stomach knotted. She had worn the blue dupatta. She had skipped breakfast. And she remembered very clearly avoiding her reflection in the bathroom mirror.\n\nHer pulse quickened as she turned the page.\n\nAnother entry."
        },
        {
          "id": "page-21-5",
          "pageNumber": 5,
          "content": "“She will spend the evening scrolling, pretending the glowing screen fills the silence. But when she finally surrenders to the pull of this journal, she will feel the sting of being watched. Yet she will keep reading.”\n\nHer throat went dry. It was describing her right now.\n\nShe snapped the book shut and pushed it away, but sleep was impossible. Every creak of the ceiling fan, every honk from the traffic outside seemed to carry the same question: Who is writing this?\n\nBy the next day, fear had given way to a strange fascination. She wanted to know what it would write next. Each night, she read the entries like forbidden letters from an unseen lover. And each entry grew more intimate, more unsettling.\n\n“She hates the loneliness, but she clings to it like a familiar bruise. She whispers stories to herself but never finishes them. She dreams of applause but wakes to silence. Still, I am here. I see her. I always see her.”\n\nThe journal wasn’t just recording her life. It was… comforting her. In its eerie, intrusive way, it knew her better than her best friends did. She found herself talking to it, whispering questions into the empty room."
        },
        {
          "id": "page-21-6",
          "pageNumber": 6,
          "content": "“Who are you?” she asked one night, fingers trembling over the blank page.\n\nAnd for the first time, the ink appeared while she was watching.\n\nLetters bled across the paper, curling into words.\n\n“I am the author. You are the story.”\n\nRhea dropped the book, her heart slamming in her chest. The words glowed faintly before settling into ordinary black ink.\n\nAll night she paced her apartment, trying to convince herself this was a trick. Maybe she was writing in her sleep, maybe her mind was fracturing under stress. But deep down, a darker thought pulsed: What if this was real?\n\nThe next evening, she swore she wouldn’t look. She locked the journal in her cupboard and drowned herself in TV shows, forcing her eyes to stay on the screen. But around midnight, there was a faint scratching sound.\n\nComing from the cupboard.\n\nShe froze. The noise was unmistakable: pen on paper.\n\nHer breath hitched. She crept toward the cupboard, each step heavier than the last, and opened it.\n\nThe journal lay there, vibrating faintly against the wood as ink bled across its open page. She bent closer, her stomach twisting as the words formed:"
        },
        {
          "id": "page-21-7",
          "pageNumber": 7,
          "content": "“Tomorrow, she will not be alone. Tomorrow, he will arrive.”\n\nRhea slammed the cupboard shut and stumbled backward. For the first time, she wished she had never touched the cursed thing.\n\nBut when midnight came, there was a knock at the door.\n\nhe knock came at 12:00 a.m. sharp.\n\nThree hollow thuds, measured, deliberate.\n Not the impatient rapping of a neighbor. Not the hurried tapping of a delivery boy.\n This was different. Too calm. Too certain.\n\nRhea froze in the middle of her room, heart slamming against her ribs. The TV was still playing in the background, laugh-track echoing absurdly, but her ears caught nothing except that sound.\n\nKnock.\n Knock.\n Knock.\n\nHer hands trembled as she reached for the light switch, but her apartment flickered once and sank into half-darkness. The bulb above the door buzzed, dimming as if suffocated by something unseen.\n\nShe tiptoed closer, her bare feet sticking slightly to the tiles. Peering through the peephole, her breath fogged the glass.\n\nA man stood outside.\n Tall. Motionless. His face lost in shadow beneath the hood of a long, black coat.\n\n“Who’s there?” she whispered, her voice smaller than she intended."
        },
        {
          "id": "page-21-8",
          "pageNumber": 8,
          "content": "The man didn’t move. Didn’t speak. His stillness was worse than an answer.\n\nThe journal.\n Her mind snapped to the journal, still locked in the cupboard.\n\nWith shaking hands, she pulled it out and flipped it open. The page was wet with fresh ink, words crawling across the paper like veins spreading.\n\n“If she opens the door, the story continues. If she doesn’t, the story ends.”\n\nRhea’s breath hitched. She looked at the door again.\n The figure was closer now. Right against the peephole. As if he knew she was watching.\n\nShe stumbled back, clutching the book to her chest. The scratching of pen on paper began again — but this time, it wasn’t inside the journal. It was on her walls.\n\nThin black lines were etching themselves across her plaster, curling into words in the same ink:\n\n“Open it.”\n “Open it.”\n “OPEN IT.”\n\nThe knocks grew louder. Each strike rattled the door on its hinges, echoing through her bones.\n\nDesperation overtook her. She ran to the balcony, thinking of screaming for help — but outside, the entire street was empty. Not a single car. Not a single voice. Delhi had gone silent, as though the world itself was holding its breath."
        },
        {
          "id": "page-21-9",
          "pageNumber": 9,
          "content": "Her phone buzzed suddenly on the desk. A new notification. She snatched it up — and nearly dropped it.\n\nIt was an incoming call.\n From her own number.\n\nHands trembling, she answered.\n\nStatic. Then a voice, low and distorted, whispered:\n “Let him in.”\n\nAt that exact moment, the door creaked open — though she hadn’t touched the lock.\n\nThe hooded man stepped inside.\n\nThe journal flipped its pages violently in her hands, stopping on a fresh entry that bled through in jagged strokes:\n\n“Now that she has opened the door, he will never leave.”\n\nThe bulb above burst with a sharp pop, drowning the room in darkness.\n And in the pitch black, she heard it — slow, steady footsteps moving toward her.\n\nThe footsteps stopped just inches from her.\n Rhea’s breath hitched, her back pressed against the cold wall. The hooded figure loomed before her, taller than she had imagined, the scent of damp earth clinging to him like a shroud.\n\n“Who are you?” she whispered, clutching the journal like a shield.\n\nThe man raised his head. For the first time, she glimpsed his face.\n\nHer own eyes stared back at her."
        },
        {
          "id": "page-21-10",
          "pageNumber": 10,
          "content": "Rhea staggered, nearly dropping the book. It wasn’t a perfect reflection — his skin was sallow, hair streaked with grey, wrinkles carved deep into his forehead. But it was unmistakably her. Older. Hollow. Broken.\n\n“No…” she gasped, shaking her head violently. “This isn’t real. This isn’t—”\n\nHis voice, when it came, was like her own, stretched and twisted, as if dragged across years of regret.\n “It’s always been real. You made me.”\n\nHer knees buckled. The journal slipped from her hands, pages fluttering wildly until they stopped on a single entry:\n\n“She will finally face him. The story she feared most. Herself.”\n\nThe man — the future Rhea — crouched, picking up the book with trembling fingers. He stroked its cover like an old friend.\n\n“This journal… it isn’t writing your life,” he said softly, almost tenderly. “It’s writing mine. Every failure you let fester, every story you never finished, every dream you buried — it all led here. To me. To what you become.”\n\nRhea’s chest constricted. “No. That’s not possible. I’m not—”"
        },
        {
          "id": "page-21-11",
          "pageNumber": 11,
          "content": "“Look at me!” he snapped, his voice cracking like thunder. “I am you. Thirty years from now. A shell. A shadow. Bound to this cursed story because you never dared to write your own.”\n\nThe walls around them began to ripple, words bleeding across the plaster in jagged ink — fragments of her unfinished drafts. Sentences she had abandoned, characters she had killed before they lived. They whispered from every direction, accusing, hungry.\n\n“You can change it,” the older Rhea said, his face inches from hers. His eyes were pools of despair, yet somewhere within them flickered a desperate plea. “Finish the story. End it differently. Or I stay… and you become me.”\n\nRhea’s pulse roared in her ears. She looked at the journal, at the endless blank pages waiting to be filled. For the first time, the pen lying beside it seemed heavier than her fear.\n\nThe man straightened, fading into shadow, but his voice lingered in the room:\n\n“You’re not the author yet. But you will be. The only question is — will you write your own story, or let the story write you?”\n\nThe lights flickered once more.\n And when she blinked — he was gone.\n\nOnly the journal remained.\n Open. Waiting."
        },
        {
          "id": "page-21-12",
          "pageNumber": 12,
          "content": "or days, Rhea didn’t leave her apartment.\n She barely ate. Barely slept. The journal sat open on her desk, blank pages stretching endlessly, daring her to write.\n\nBut every time she picked up the pen, her hand froze. Words hovered at the edge of her mind, then dissolved into nothing. The silence of the page mocked her, heavier than any rejection letter she had ever received.\n\nThe apartment grew darker with each passing night. The ceiling fan slowed, the walls groaned like an old ship, and her reflection in the mirror looked less like her and more like the hollow-eyed figure she had seen at her door.\n\nThe journal did not wait idly.\n It began to write without her.\n\n“She will try again tomorrow. She will fail again tomorrow. And the day after. And the day after.”\n\nRhea tore at the pages, screaming, but the words bled back through, unstoppable, rewriting themselves. No matter how much she ripped, burned, or shredded, the journal always reappeared on her desk in the morning.\n\nOne night, exhausted, she caught her reflection in the glass of the balcony door. For a second, her breath faltered.\n The reflection wasn’t in sync.\n It smiled when she didn’t."
        },
        {
          "id": "page-21-13",
          "pageNumber": 13,
          "content": "Slowly, the face in the glass aged before her eyes — lines deepening, hair greying, eyes hollowing — until it became him. The man from the door. Her future self.\n\nHer knees buckled. She staggered to the desk, gripping the pen with white-knuckled hands. “I’ll finish it,” she whispered desperately. “I’ll end it differently. I will.”\n\nBut the pen wouldn’t move.\n Her fingers trembled. Her vision blurred. And the page remained blank.\n\nThe journal wrote for her.\n\n“She could not. She would not. The story owns her now.”\n\nHer reflection in the balcony glass moved closer, pressing against the surface as though the barrier between them was thinning. With one last flicker of the lights, the figure stepped out of the glass, solid and real, cloaked in shadow.\n\nHe placed the journal gently in her lap.\n And whispered, with her own voice, cracked and broken:\n\n“Welcome back.”\n\nWhen the neighbors finally forced open Rhea’s locked apartment weeks later, they found it empty. No trace of her.\n\nOnly a leather-bound journal on the desk.\n Still writing."
        }
      ]
    },
    "hindi": {
      "title": "",
      "description": "",
      "pages": [
        {
          "id": "page-21-1-hi",
          "pageNumber": 1,
          "content": ""
        },
        {
          "id": "page-21-2-hi",
          "pageNumber": 2,
          "content": ""
        },
        {
          "id": "page-21-3-hi",
          "pageNumber": 3,
          "content": ""
        },
        {
          "id": "page-21-4-hi",
          "pageNumber": 4,
          "content": ""
        },
        {
          "id": "page-21-5-hi",
          "pageNumber": 5,
          "content": ""
        },
        {
          "id": "page-21-6-hi",
          "pageNumber": 6,
          "content": ""
        },
        {
          "id": "page-21-7-hi",
          "pageNumber": 7,
          "content": ""
        },
        {
          "id": "page-21-8-hi",
          "pageNumber": 8,
          "content": ""
        },
        {
          "id": "page-21-9-hi",
          "pageNumber": 9,
          "content": ""
        },
        {
          "id": "page-21-10-hi",
          "pageNumber": 10,
          "content": ""
        },
        {
          "id": "page-21-11-hi",
          "pageNumber": 11,
          "content": ""
        },
        {
          "id": "page-21-12-hi",
          "pageNumber": 12,
          "content": ""
        },
        {
          "id": "page-21-13-hi",
          "pageNumber": 13,
          "content": ""
        }
      ]
    },
    "hinglish": {
      "title": "",
      "description": "",
      "pages": [
        {
          "id": "page-21-1-hn",
          "pageNumber": 1,
          "content": ""
        },
        {
          "id": "page-21-2-hn",
          "pageNumber": 2,
          "content": ""
        },
        {
          "id": "page-21-3-hn",
          "pageNumber": 3,
          "content": ""
        },
        {
          "id": "page-21-4-hn",
          "pageNumber": 4,
          "content": ""
        },
        {
          "id": "page-21-5-hn",
          "pageNumber": 5,
          "content": ""
        },
        {
          "id": "page-21-6-hn",
          "pageNumber": 6,
          "content": ""
        },
        {
          "id": "page-21-7-hn",
          "pageNumber": 7,
          "content": ""
        },
        {
          "id": "page-21-8-hn",
          "pageNumber": 8,
          "content": ""
        },
        {
          "id": "page-21-9-hn",
          "pageNumber": 9,
          "content": ""
        },
        {
          "id": "page-21-10-hn",
          "pageNumber": 10,
          "content": ""
        },
        {
          "id": "page-21-11-hn",
          "pageNumber": 11,
          "content": ""
        },
        {
          "id": "page-21-12-hn",
          "pageNumber": 12,
          "content": ""
        },
        {
          "id": "page-21-13-hn",
          "pageNumber": 13,
          "content": ""
        }
      ]
    }
  }
}
